Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge5/po/*.po
Languages: cs

source: Dialup Password:
cs: Heslo pro pøístup vytáèenou linkou:

source: Could not allocate space for config info.
cs: Nemohu alokovat dostatek místa pro konfiguraèní údaje.

source: configuration error - unknown item '%s' (notify administrator)
cs: konfiguraèní chyba - neznámý pøedmìt '%s' (informujte správce systému)

source: error - lookup '%s' failed
cs: chyba - hledání '%s' bylo neúspì¹né

source: %s not found
cs: %s nenalezeno

source: Warning: unknown group %s
cs: Varování: skupina %s je neznámá

source: Warning: too many groups
cs: Varování: pøíli¹ mnoho skupin

source: Your password has expired.
cs: Platnost va¹eho hesla vypr¹ela.

source: Your password is inactive.
cs: Va¹e heslo je vypnuto.

source: Your login has expired.
cs: Platnost va¹eho úètu vypr¹ela.

source: Contact the system administrator.
cs: Kontaktujte správce systému.

source: Choose a new password.
cs: Zvolte nové heslo.

source: Your password will expire in %ld days.
cs: Platnost va¹eho hesla vypr¹í za %ld dnù.

source: Your password will expire tomorrow.
cs: Platnost va¹eho hesla vypr¹í zítra.

source: Your password will expire today.
cs: Platnost va¹eho hesla vypr¹í dnes.

source: Unable to change tty %s
cs: TTY %s nelze zmìnit.

source: Environment overflow
cs: Pøeteèení prostøedí

source: You may not change $%s
cs: Nemù¾ete zmìnit $%s

source: %d failure since last login. Last was %s on %s.
cs: Poèet chyb od posledního pøihlá¹ení: %d. Poslední: %s na %s.

source: Too many logins.
cs: Pøíli¹ mnoho soubì¾ných pøihlá¹ení.

source: Password does not decrypt secret key for %s.
cs: Tímto heslem nelze de¹ifrovat tajný klíè pro %s.

source: Could not set %s's secret key: is the keyserv daemon running?
cs: Tajný klíè pro %s nelze nastavit. Je keyserv démon v provozu?

source: You have new mail.
cs: Máte novou po¹tu.

source: No mail.
cs: Nemáte ¾ádnou po¹tu.

source: You have mail.
cs: Máte po¹tu.

source: Bad password: %s.
cs: Heslo %s je chybné.

source: passwd: pam_start() failed, error %d
cs: passwd: volání pam_start() selhalo, chyba %d

source: Incorrect password for %s.
cs: Chybné heslo pro %s.

source: Unable to cd to "%s"
cs: Nelze nastavit aktuální adresáø na "%s".

source: No directory, logging in with HOME=/
cs: ®ádný adresáø, nastavuji HOME na /

source: Executing shell %s
cs: Spou¹tím shell %s.

source: Cannot execute %s
cs: %s nelze spustit.

source: Invalid root directory "%s"
cs: Chybný koøenový adresáø "%s"

source: Can't change root directory to "%s"
cs: Nelze nastavit koøenový adresáø na "%s".

source: malloc(%d) failed
cs: volání malloc(%d) selhalo

source: Password:
cs: Heslo:

source: %s's Password:
cs: Heslo u¾ivatele %s:

source: (Echo on)
cs: (Echo zapnuto)

source: Usage: %s [-l] [-m min_days] [-M max_days] [-W warn] [-I inactive] [-E expire] [-d last_day] user
cs: Pou¾ití: %s [-l] [-m min_dnù] [-M max_dnù] [-W varování] [-I vypnutí] [-E vypr¹ení] [-d poslední_den] u¾ivatel

source: Usage: %s [-l] [-m min_days] [-M max_days] [-d last_day] user
cs: Pou¾ití: %s [-l] [-m min_dnù] [-M max_dnù] [-d poslední_den] u¾ivatel

source: Enter the new value, or press ENTER for the default
cs: Zadejte novou hodnotu, nebo stisknìte ENTER pro pou¾ití implicitní hodnoty

source: Minimum Password Age
cs: Minimální stáøí hesla

source: Maximum Password Age
cs: Maximální stáøí hesla

source: Last Password Change (YYYY-MM-DD)
cs: Poslední zmìna hesla (YYYY-MM-DD)

source: Password Expiration Warning
cs: Varování o vypr¹ení platnosti hesla

source: Password Inactive
cs: Vypnuté heslo

source: Account Expiration Date (YYYY-MM-DD)
cs: Vypr¹ení platnosti úètu (YYYY-MM-DD)

source: Warning: %ld
cs: Varování: %ld

source: Inactive: %ld
cs: Vypnutí: %ld

source: Last Change:
cs: Poslední zmìna:

source: Never
cs: Nikdy

source: Password Expires:
cs: Platnost hesla vypr¹í:

source: Password Inactive:
cs: Vypnuté heslo:

source: Account Expires:
cs: Platnost hesla vypr¹í:

source: %s: do not include "l" with other flags
cs: %s: nepou¾ívejte "l" s ostatními pøíznaky

source: %s: permission denied
cs: %s: pøístup odmítnut

source: %s: PAM authentication failed
cs: %s: ovìøení pøes PAM selhalo

source: %s: can't lock password file
cs: %s: soubor s hesly nelze zamknout

source: %s: can't open password file
cs: %s: soubor s hesly nelze otevøít

source: %s: unknown user: %s
cs: %s: neznámý u¾ivatel: %s

source: %s: can't lock shadow password file
cs: %s: soubor se stínovými hesly nelze zamknout

source: %s: can't open shadow password file
cs: %s: soubor se stínovými hesly nelze otevøít

source: Changing the aging information for %s
cs: Mìním informace o u¾ivateli %s.

source: %s: error changing fields
cs: %s: chyba pøi zmìnì polo¾ek

source: %s: can't update password file
cs: %s: soubor s hesly nelze aktualizovat

source: %s: can't update shadow password file
cs: %s: soubor se stínovými hesly nelze aktualizovat

source: Error updating the DBM password entry.
cs: Chyba pøi aktualizaci DBM databáze hesel.

source: %s: can't rewrite shadow password file
cs: %s: soubor se stínovými hesly nelze pøepsat

source: %s: can't rewrite password file
cs: %s: soubor s hesly nelze pøepsat

source: %s: PAM chauthtok failed
cs: %s: PAM mechanismus chauthok selhal

source: Usage: %s [-f full_name] [-r room_no] [-w work_ph] [-h home_ph] [-o other] [user]
cs: Pou¾ití: %s [-f jméno] [-r èíslo místnosti] [-w telefon do zamìstnání] [-h telefon domù] [-o ostatní] [u¾ivatel]

source: Usage: %s [-f full_name] [-r room_no] [-w work_ph] [-h home_ph]
cs: Pou¾ití: %s [-f jméno] [-r èíslo místnosti] [-w telefon do zamìstnání] [-h telefon domù]

source: Enter the new value, or press ENTER for the default
cs: Zadejte novou hodnotu, nebo stisknìte ENTER pro pou¾ití implicitní hodnoty

source: Full Name
cs: Celé jméno

source: Full Name: %s
cs: Celé jméno: %s

source: Room Number
cs: Èíslo místnosti

source: Room Number: %s
cs: Èíslo místnosti: %s

source: Work Phone
cs: Telefon do zamìstnání

source: Work Phone: %s
cs: Telefon do zamìstnání: %s

source: Home Phone
cs: Telefon domù

source: Home Phone: %s
cs: Telefon domù: %s

source: Other
cs: Ostatní

source: %s: Permission denied.
cs: %s: Pøístup odmítnut.

source: %s: Unknown user %s
cs: %s: Neznámý u¾ivatel %s

source: %s: Cannot determine your user name.
cs: %s: Va¹e u¾ivatelské jméno nelze zjistit.

source: %s: cannot change user `%s' on NIS client.
cs: %s: u¾ivatele `%s' nelze na NIS klientu zmìnit

source: %s: `%s' is the NIS master for this client.
cs: %s: `%s' je hlavním NIS serverem pro tohoto klienta

source: Changing the user information for %s
cs: Mìním informace o u¾ivateli %s

source: %s: invalid name: "%s"
cs: %s: jméno "%s" je chybné

source: %s: invalid room number: "%s"
cs: %s: èíslo místnosti "%s" je chybné

source: %s: invalid work phone: "%s"
cs: %s: telefonní èíslo do zamìstnání "%s" je chybné

source: %s: invalid home phone: "%s"
cs: %s: telefonní èíslo domù "%s" je chybné

source: %s: "%s" contains illegal characters
cs: %s: "%s" obsahuje chybné znaky

source: %s: fields too long
cs: %s: polo¾ka je pøíli¹ dlouhá

source: Cannot change ID to root.
cs: Nelze zmìnit ID na root.

source: Cannot lock the password file; try again later.
cs: Nelze zamknout soubor s hesly; zkuste to pozdìji.

source: Cannot open the password file.
cs: Soubor s hesly nelze otevøít.

source: %s: %s not found in /etc/passwd
cs: %s: %s se v /etc/passwd nenalézá

source: Error updating the password entry.
cs: Chyba pøi aktualizaci polo¾ky v souboru s hesly.

source: Cannot commit password file changes.
cs: Nelze provést zmìny v souboru s hesly.

source: Cannot unlock the password file.
cs: Soubor s hesly nelze odemknout.

source: Usage: chpasswd [options] Options: -e, --encrypted supplied passwords are encrypted -h, --help display this help message and exit -m, --md5 use MD5 encryption instead DES when the supplied passwords are not encrypted
cs: Pou¾ití: chpasswd [volby] Volby: -e, --encrypted zadaná hesla jsou za¹ifrovaná -h, --help zobrazí tuto nápovìdu a skonèí -m, --md5 pokud zadaná hesla nejsou za¹ifrovaná, pou¾ije místo DES algoritmus MD5

source: %s: can't lock shadow file
cs: %s: soubor se stínovými hesly nelze zamknout

source: %s: can't open shadow file
cs: %s: soubor se stínovými hesly nelze otevøít

source: %s: line %d: line too long
cs: %s: øádek %d je pøíli¹ dlouhý

source: %s: line %d: missing new password
cs: %s: øádek %d: chybí nové heslo

source: %s: line %d: unknown user %s
cs: %s: øádek %d: u¾ivatel %s je neznámý

source: %s: line %d: cannot update password entry
cs: %s: øádek %d: polo¾ku v souboru s hesly nelze aktualizovat

source: %s: error detected, changes ignored
cs: %s: chyba, zmìny budou ignorovány

source: %s: error updating shadow file
cs: %s: chyba pøi aktualizaci souboru se stínovými hesly

source: %s: error updating password file
cs: %s: chyba pøi aktualizaci souboru s hesly

source: Usage: %s [-s shell] [name]
cs: Pou¾ití: %s [-s shell] [jméno]

source: Enter the new value, or press return for the default
cs: Zadejte novou hodnotu, nebo stisknìte ENTER pro pou¾ití implicitní hodnoty

source: Login Shell
cs: Implicitní shell

source: You may not change the shell for %s.
cs: Nemù¾ete zmìnit shell pro %s.

source: Changing the login shell for %s
cs: Mìním implicitní shell pro %s

source: %s: Invalid entry: %s
cs: %s: chybná polo¾ka %s

source: %s is an invalid shell.
cs: Shell %s je chybný.

source: Usage: %s [-(a|d)] shell
cs: Pou¾ití: %s [-(ald)] shell

source: Shell password:
cs: Heslo shellu:

source: re-enter Shell password:
cs: zadejte znovu heslo shellu:

source: %s: Passwords do not match, try again.
cs: %s: hesla se li¹í, zkuste to znovu

source: %s: can't create %s
cs: %s: %s nelze vytvoøit

source: %s: can't open %s
cs: %s: %s nelze otevøít

source: %s: Shell %s not found.
cs: %s: Shell %s nebyl nalezen.

source: Usage: expiry {-f|-c}
cs: Pou¾ití: expiry {-f|-c}

source: %s: WARNING! Must be set-UID root!
cs: %s: VAROVÁNÍ! Musí mít oprávnìní superu¾ivatele!

source: %s: unknown user
cs: %s: neznámý u¾ivatel

source: usage: %s [-a|-u user] [-m max] [-r] [-t days] [-l locksecs]
cs: Pou¾ití: %s [-a|-u u¾ivatel] [-m max] [-r] [-t dny] [-l zamkn sek]

source: Unknown User: %s
cs: U¾ivatel %s je neznámý.

source: Username Failures Maximum Latest
cs: U¾ivatel Chyb Maximum Poslední

source: [%lds left]
cs: [%lds zbylo]

source: [%lds lock]
cs: [%lds zámek]

source: usage: %s [-r|-R] group
cs: Pou¾ití: %s [r|-R] skupina

source: %s [-a user] group
cs: %s [-a u¾ivatel] skupina

source: %s [-d user] group
cs: %s [-d u¾ivatel] skupina

source: %s [-A user,...] [-M user,...] group
cs: %s [-A u¾ivatel,...] [-M u¾ivatel,...] skupina

source: %s [-M user,...] group
cs: %s [-M u¾ivatel,...] skupina

source: %s: unknown user %s
cs: %s: u¾ivatel %s je neznámý

source: Permission denied.
cs: Pøístup odmítnut.

source: %s: shadow group passwords required for -A
cs: %s: pøepínaè -A funguje pouze se stínovými hesly skupin

source: Who are you?
cs: Kdo jste?

source: unknown group: %s
cs: skupina %s je neznámá

source: Adding user %s to group %s
cs: Pøidávám u¾ivatele %s do skupiny %s.

source: Removing user %s from group %s
cs: Odstraòuji u¾ivatele %s ze skupiny %s

source: %s: unknown member %s
cs: %s: èlen %s je neznámý

source: %s: Not a tty
cs: %s: Nejedná se o tty

source: Changing the password for group %s
cs: Mìním heslo skupiny %s

source: New Password:
cs: Nové heslo:

source: Re-enter new password:
cs: Zadejte opìt nové heslo:

source: They don't match; try again
cs: Neshodují se; zkuste to znovu

source: %s: Try again later
cs: %s: Zkuste to pozdìji

source: %s: can't get lock
cs: %s: nelze získat zámek

source: %s: can't get shadow lock
cs: %s: nelze získat zámek pro soubor se stínovými hesly

source: %s: can't open file
cs: %s: nelze otevøít soubor

source: %s: can't update entry
cs: %s: nelze aktualizovat polo¾ku

source: %s: can't update shadow entry
cs: %s: nelze aktualizovat polo¾ku souboru se stínovými hesly

source: %s: can't re-write file
cs: %s: nelze pøepsat soubor

source: %s: can't re-write shadow file
cs: %s: nelze pøepsat soubor se stínovými hesly

source: %s: can't unlock file
cs: %s: nelze odemknout soubor

source: %s: can't update DBM files
cs: %s: nelze aktualizovat soubory s DBM databázemi

source: %s: can't update DBM shadow files
cs: %s: nelze aktualizovat soubory s DBM databázemi stínových hesel

source: usage: groupadd [-g gid [-o]] group
cs: Pou¾ití: groupadd [-g gid [-o]] skupina

source: %s: error adding new group entry
cs: %s: chyba pøi pøidávání polo¾ky souboru se skupinami

source: %s: cannot add new dbm group entry
cs: %s: nelze pøidat polo¾ku do souboru s dbm databází skupin

source: %s: name %s is not unique
cs: %s: jméno %s není jedineèné

source: %s: gid %u is not unique
cs: %s: uid %u není jedineèné

source: %s: can't get unique gid
cs: %s: nelze vytvoøit jedineèné gid

source: %s: %s is a not a valid group name
cs: %s: %s není platným jménem skupiny

source: %s: invalid group %s
cs: %s: chybná skupina %s

source: %s: -O requires NAME=VALUE
cs: %s: pøepínaè -O vy¾aduje argument typu JMÉNO=HODNOTA

source: %s: cannot rewrite group file
cs: %s: soubor se skupinami nelze pøepsat

source: %s: cannot rewrite shadow group file
cs: %s: soubor se stínovými skupinami nelze pøepsat

source: %s: unable to lock group file
cs: %s: soubor se skupinami nelze zamknout

source: %s: unable to open group file
cs: %s: soubor se skupinami nelze otevøít

source: %s: unable to lock shadow group file
cs: %s: soubor se stínovými skupinami nelze zamknout

source: %s: unable to open shadow group file
cs: %s: soubor se stínovými skupinami nelze otevøít

source: %s: group %s exists
cs: %s: skupina %s ji¾ existuje

source: usage: groupdel group
cs: Pou¾ití: groupdel skupina

source: %s: error removing group entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru se skupinami

source: %s: error removing group dbm entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru s dbm databází skupin

source: %s: error removing shadow group entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru se stínovými skupinami

source: %s: error removing shadow group dbm entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru s dbm databází stínových skupin

source: %s: cannot remove user's primary group.
cs: %s: primární skupinu u¾ivatele nelze odstranit

source: %s: group %s does not exist
cs: %s: skupina %s neexistuje

source: %s: group %s is a NIS group
cs: %s: skupina %s je NIS skupinou

source: %s: %s is the NIS master
cs: %s: %s je hlavním NIS serverem

source: usage: groupmod [-g gid [-o]] [-n name] group
cs: Pou¾ití: groupmod [-g gid [-o]] [-n jméno] skupina

source: %s: %s not found in /etc/group
cs: %s: %s se v /etc/group nenalézá

source: %s: cannot add new dbm shadow group entry
cs: %s: nelze pøidat polo¾ku do souboru s dbm databází stínových skupin

source: %s: %u is not a unique gid
cs: %s: gid %u není jedineèné

source: %s: %s is not a unique name
cs: %s: jméno %s není jedineèné

source: unknown user %s
cs: u¾ivatel %s je neznámý

source: Usage: %s [-r] [-s] [group [gshadow]]
cs: Pou¾ití: %s [-r] [-s] [soubor se skupinami [soubor se stínovými skupinami]]

source: Usage: %s [-r] [-s] [group]
cs: Pou¾ití: %s [-r] [-s] [soubor se skupinami]

source: No
cs: Ne

source: %s: -s and -r are incompatibile
cs: %s: -s a -r nejsou sluèitelné

source: %s: cannot lock file %s
cs: %s: soubor %s nelze zamknout

source: %s: cannot open file %s
cs: %s: soubor %s nelze otevøít

source: invalid group file entry
cs: chybná polo¾ka v souboru se skupinami

source: delete line `%s'?
cs: smazat øádek `%s'?

source: duplicate group entry
cs: tato polo¾ka se v souboru se skupinami vyskytuje vícekrát

source: invalid group name `%s'
cs: jméno skupiny `%s' je chybné

source: group %s: no user %s
cs: skupina %s: u¾ivatel %s neexistuje

source: delete member `%s'?
cs: smazat èlena `%s'?

source: invalid shadow group file entry
cs: chybná polo¾ka v souboru se stínovými skupinami

source: duplicate shadow group entry
cs: duplikovaná polo¾ka v souboru se stínovými skupinami

source: no matching group file entry
cs: v souboru se skupinami neexistuje odpovídající polo¾ka

source: shadow group %s: no administrative user %s
cs: stínová skupina %s: administrátor %s neexistuje

source: delete administrative member `%s'?
cs: smazat administrátora `%s'?

source: shadow group %s: no user %s
cs: stínová skupina %s: u¾ivatel %s neexistuje

source: %s: cannot update file %s
cs: %s: soubor %s nelze aktualizovat

source: %s: the files have been updated; run mkpasswd
cs: %s: soubory byly aktualizovány; spus»te mkpasswd

source: %s: no changes
cs: %s: ¾ádné zmìny nebyly provedeny

source: %s: the files have been updated
cs: %s: soubory byly aktualizovány

source: %s: can't lock group file
cs: %s: soubor se skupinami nelze zamknout

source: %s: can't open group file
cs: %s: soubor se skupinami nelze otevøít

source: %s: can't lock shadow group file
cs: %s: soubor se stínovými skupinami nelze zamknout

source: %s: can't open shadow group file
cs: %s: soubor se stínovými skupinami nelze otevøít

source: %s: can't remove shadow group %s
cs: %s: polo¾ku stínové skupiny %s nelze odstranit

source: %s: can't update shadow entry for %s
cs: %s: polo¾ku %s souboru se stínovými hesly nelze aktualizovat

source: %s: can't update entry for group %s
cs: %s: polo¾ku skupiny %s nelze odstranit

source: %s: can't update shadow group file
cs: %s: soubor se stínovými hesly nelze aktualizovat

source: %s: can't update group file
cs: %s: soubor s hesly nelze aktualizovat

source: %s: not configured for shadow group support.
cs: %s: podpora pro stínová hesla skupin není nakonfigurována

source: %s: can't delete shadow group file
cs: %s: soubor se stínovými hesly skupin nelze smazat

source: usage: id [-a]
cs: Pou¾ití: id [-a]

source: usage: id
cs: Pou¾ití: id

source: groups=
cs: skupiny=

source: Usage: %s [<-u|--login> login-name] [<-t|--time> days] [<-h|--help>]
cs: Pou¾ití: %s [<-u|--login> jméno_úètu] [<-t|--time> dny] [<-h|--help>]

source: Username Port From Latest
cs: U¾ivatel Port Z Naposledy

source: Username Port Latest
cs: U¾ivatel Port Naposledy

source: **Never logged in**
cs: **Nikdy nebyl pøihlá¹en**

source: usage: %s [-p] [name]
cs: Pou¾ití: %s [-p] jméno

source: %s [-p] [-h host] [-f name]
cs: %s [-p] [-h poèítaè] [-f jméno]

source: %s [-p] -r host
cs: %s [-p] -r poèítaè

source: Invalid login time
cs: Chybný èas pøihlá¹ení

source: System closed for routine maintenance
cs: Systém byl uzavøen kvùli pravidelné údr¾bì.

source: [Disconnect bypassed -- root login allowed.]
cs: [Odpojení pøeskoèeno -- u¾ivatel root smí být pøihlá¹en.]

source: Login timed out after %d seconds.
cs: Vypr¹el èasový limit (%d vteøin) pro pøihlá¹ení.

source: on `%.100s' from `%.200s'
cs: na `%.100s' z `%.200s'

source: on `%.100s'
cs: na `%.100s'

source: TOO MANY LOGIN TRIES (%d)%s FOR `%s'
cs: PØÍLI© MNOHO POKUSÙ O PØIHLÁ©ENÍ (%d)%s U®IVATELE `%s'

source: Maximum number of tries exceeded (%d)
cs: Povolený poèet pokusù vypr¹el (%d)

source: login: abort requested by PAM
cs: login: PAM vy¾aduje ukonèení

source: PAM_ABORT returned from pam_authenticate()
cs: pam_authenticate() vrátil PAM_ABORT

source: FAILED LOGIN (%d)%s FOR `%s', %s
cs: PØIHLÁ©ENÍ SELHALO (%d)%s PRO `%s', %s

source: %s login:
cs: Pøihla¹ovací jméno na %s:

source: login:
cs: Pøihla¹ovací jméno:

source: Login incorrect
cs: Chybné pøihlá¹ení

source: Warning: login re-enabled after temporary lockout.
cs: Varování: po doèasném zákazu je pøihla¹ování opìt povoleno

source: Last login: %s on %s
cs: Poslední pøihlá¹ení: %s na %s

source: Last login: %.19s on %s
cs: Poslední pøihlá¹ení: %.19s na %s

source: from %.*s
cs: z %.*s

source: Starting rad_login
cs: Spou¹tím rad_login

source: %s: no DBM database on system - no action performed
cs: %s: systém neobsahuje ¾ádnou DBM databázi - není co dìlat

source: %s: cannot overwrite file %s
cs: %s: soubor %s nelze pøepsat

source: %s: cannot open DBM files for %s
cs: %s: soubory s DBM databázemi pro %s nelze otevøít

source: %s: the beginning with
cs: %s: zaèátek s

source: is too long
cs: polo¾ka je pøíli¹ dlouhá

source: %s: error parsing line "%s"
cs: %s: chyba pøi zpracování øádku "%s"

source: adding record for name
cs: pøidávám záznam pro jméno

source: %s: error adding record for
cs: %s: chyba pøi zadávání záznamu pro jméno

source: added %d entries, longest was %d
cs: poèet pøidaných polo¾ek: %d; délka nejvìt¹í: %d

source: Usage: %s [-vf] [-p|g|sp|sg] file
cs: Pou¾ití: %s [-vf] [-p|g|sp|sg] soubor

source: Usage: %s [-vf] [-p|g|sp] file
cs: Pou¾ití: %s [-vf] [-p|g|sp] soubor

source: Usage: %s [-vf] [-p|g] file
cs: Pou¾ití: %s [-vf] [-p|g] soubor

source: usage: newgrp [-] [group]
cs: Pou¾ití: newgrp [-] [skupina]

source: usage: sg group [[-c] command]
cs: Pou¾ití: sg skupina [[-c] pøíkaz]

source: unknown uid: %u
cs: uid %u je neznámé

source: unknown gid: %lu
cs: gid %lu je neznámé

source: Sorry.
cs: Lituji.

source: too many groups
cs: pøíli¹ mnoho skupin

source: Usage: %s [input]
cs: Pou¾ití: %s [vstup]

source: %s: can't lock /etc/passwd.
cs: %s: soubor /etc/passwd nelze zamknout

source: %s: can't lock files, try again later
cs: %s: soubory nelze zamknout. Zkuste to opìt pozdìji.

source: %s: can't open files
cs: %s: soubory nelze otevøít

source: %s: line %d: invalid line
cs: %s: øádek %d: chybný øádek

source: %s: line %d: can't create GID
cs: %s: øádek %d: nelze vytvoøit GID

source: %s: line %d: can't create UID
cs: %s: øádek %d: nelze vytvoøit UID

source: %s: line %d: cannot find user %s
cs: %s: øádek %d: u¾ivatele %s nelze nalézt

source: %s: line %d: can't update password
cs: %s: øádek %d: heslo nelze aktualizovat

source: %s: line %d: mkdir failed
cs: %s: øádek %d: volání mkdir selhalo

source: %s: line %d: chown failed
cs: %s: øádek %d: volání chown selhalo

source: %s: line %d: can't update entry
cs: %s: øádek %d: polo¾ku nelze aktualizovat

source: %s: error updating files
cs: %s: chyba pøi aktualizaci souborù

source: usage: %s [-f|-s] [name]
cs: Pou¾ití: %s [-f|-s] [jméno]

source: %s [-x max] [-n min] [-w warn] [-i inact] name
cs: %s [-x max] [-n min] [-w varování] [-i vypnutí] jméno

source: %s {-l|-u|-d|-S|-e} name
cs: %s {-l|-u|-d|-S|-e} jméno

source: User %s has a TCFS key, his old password is required.
cs: U¾ivatel %s má TCFS klíè, je tøeba jeho staré heslo.

source: You can use -t option to force the change.
cs: Mù¾ete pou¾ít pøepínaè -t pro vynucení zmìny.

source: Old password:
cs: Staré heslo:

source: Incorrect password for `%s'
cs: Chybné heslo pro `%s'

source: Warning: user %s has a TCFS key.
cs: Varování: u¾ivatele %s má TCFS klíè.

source: Enter the new password (minimum of %d, maximum of %d characters) Please use a combination of upper and lower case letters and numbers.
cs: Zadejte nové heslo (poèet znakù v intervalu %d a¾ %d). Pou¾ijte kombinaci velkých a malých písmen s èíslicemi.

source: New password:
cs: Nové heslo:

source: Try again.
cs: Zkuste to znovu.

source: Warning: weak password (enter it again to use it anyway).
cs: Varování: slabé heslo (pokud jej opravdu chcete pou¾ít, zadejte jej znovu).

source: They don't match; try again.
cs: Neshodují se; zkuste to znovu.

source: The password for %s cannot be changed.
cs: Heslo pro %s nelze zmìnit.

source: Sorry, the password for %s cannot be changed yet.
cs: Lituji, ale heslo pro %s nelze je¹tì zmìnit.

source: %s: out of memory
cs: %s: do¹la pamì»

source: Cannot lock the TCFS key database; try again later
cs: Nelze zamknout databázi TCFS klíèù. Zkuste to pozdìji.

source: Cannot open the TCFS key database.
cs: Nelze otevøít databázi TCFS klíèù.

source: Error updating the TCFS key database.
cs: Chyba pøi aktualizaci databáze TCFS klíèù.

source: Cannot commit TCFS changes.
cs: Nelze zmìnit TCFS databázi.

source: %s: Cannot execute %s
cs: %s: %s nelze spustit
