Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge5/po/*.po
Languages: cs

source: %s: repository %s not supported
cs: %s: úlo¾na %s není podporována

source: %s: Permission denied
cs: %s: pøístup odmítnut

source: %s: You may not view or modify password information for %s.
cs: %s: Nemù¾ete prohlí¾et nebo mìnit heslo pro %s.

source: Changing password for %s
cs: Mìním heslo u¾ivatele %s

source: The password for %s is unchanged.
cs: Heslo u¾ivatele %s nebylo zmìnìno.

source: Password changed.
cs: Heslo bylo zmìnìno.

source: Usage: %s [-q] [-r] [-s] [passwd [shadow]]
cs: Pou¾ití: %s [-q] [-r] [-s] [soubor s hesly [soubor se stínovými hesly]]

source: Usage: %s [-q] [-r] [-s] [passwd]
cs: Pou¾ití: %s [-q] [-r] [-s] [soubor s hesly]

source: invalid password file entry
cs: chybná polo¾ka v souboru s hesly

source: duplicate password entry
cs: duplikovaná polo¾ka v souboru s hesly

source: invalid user name '%s'
cs: chybné u¾ivatelské jméno '%s'

source: user %s: no group %u
cs: u¾ivatel %s: skupina %u neexistuje

source: user %s: directory %s does not exist
cs: u¾ivatel %s: adresáø %s neexistuje

source: user %s: program %s does not exist
cs: u¾ivatel %s: program %s neexistuje

source: invalid shadow password file entry
cs: chybná polo¾ka v souboru se stínovými hesly

source: duplicate shadow password entry
cs: duplikovaná polo¾ka v souboru se stínovými hesly

source: no matching password file entry
cs: chybí polo¾ka v souboru s hesly

source: user %s: last password change in the future
cs: u¾ivatel %s: poslední zmìna hesla v budoucnosti

source: %s: can't lock passwd file
cs: %s: soubor s hesly nelze zamknout

source: %s: can't open passwd file
cs: %s: soubor s hesly nelze otevøít

source: %s: can't remove shadow entry for %s
cs: %s: polo¾ku souboru s hesly pro u¾ivatele %s nelze odstranit

source: %s: can't update passwd entry for %s
cs: %s: polo¾ku souboru s hesly pro u¾ivatele %s nelze aktualizovat

source: %s: can't update shadow file
cs: %s: soubor se stínovými hesly nelze aktualizovat

source: %s: can't update passwd file
cs: %s: soubor s hesly nelze aktualizovat

source: %s: Shadow passwords are not configured.
cs: %s: stínová hesla nejsou nakonfigurována

source: %s: can't update entry for user %s
cs: %s: polo¾ku pro u¾ivatele %s nelze aktualizovat

source: %s: can't delete shadow password file
cs: %s: nemù¾ete smazat soubor se stínovými hesly

source: Access to su to that account DENIED.
cs: Z tohoto úètu je pøístup k su ZAKÁZÁN.

source: Password authentication bypassed.
cs: Ovìøování heslem vynecháno.

source: Please enter your OWN password as authentication.
cs: Pro ovìøení zadejte VA©E vlastní heslo.

source: Command line args too long
cs: Parametry na pøíkazové øádce jsou pøíli¹ dlouhé

source: No shell
cs: ®ádný shell

source: Sorry.
cs: Lituji.

source: %s: must be run from a terminal
cs: %s: musí být spu¹tìno z terminálu

source: Usage: su [OPTS] [-] [username [ARGS]] - make this a login shell -c, --command=<command> pass command to the invoked shell using its -c option -m, -p, --preserve-environment do not reset environment variables, and keep the same shell -s, --shell=<shell> use shell instead of the default in /etc/passwd
cs: Pou¾ití: su [VOLBY] [-] [u¾ivatel [ARGUMENTY]] - toto bude pøihla¹ovací shell -c, --command=<pøíkaz> ve spu¹tìném shellu spustí <pøíkaz> -m, -p, --preserve-environment promìnným prostøedí ponechá stávající hodnoty a zachová stejný shell -s, --shell=<shell> místo implicitního shellu z /etc/passwd pou¾ije <shell>

source: %s: pam_start: error %d
cs: %s: pam_start: chyba %d

source: Unknown id: %s
cs: Id %s je neznámé.

source: You are not authorized to su %s
cs: Nejste oprávnìn pou¾ívat su %s

source: (Enter your own password.)
cs: (Zadejte va¹e heslo.)

source: %s: %s (Ignored)
cs: %s: %s (Ignoruji)

source: No password file
cs: Soubor s hesly neexistuje

source: No password entry for 'root'
cs: V databázi není polo¾ka pro u¾ivatele 'root'

source: Type control-d to proceed with normal startup, (or give root password for system maintenance):
cs: Stisknìte control-d pro normální spu¹tìní systému, (nebo zadejte heslo u¾ivatele root pro údr¾bu systému):

source: Entering System Maintenance Mode
cs: Vstupuji do re¾imu údr¾by systému

source: %s: rebuild the group database
cs: %s: vytvoøte znovu databázi skupin

source: %s: rebuild the shadow group database
cs: %s: vytvoøte znovu databázi stínových skupin

source: %s: invalid numeric argument `%s'
cs: %s: chybný numerický argument `%s'

source: %s: unknown gid %s
cs: %s: gid %s je neznámé

source: %s: unknown group %s
cs: %s: skupina %s je neznámá

source: group=%s,%u basedir=%s skel=%s
cs: skupina=%s,%u základ. adr.=%s skel=%s

source: inactive=%ld expire=%s
cs: vypnutí=%ld vypr¹ení=%s

source: GROUP=%u
cs: SKUPINA=%u

source: HOME=%s
cs: DOMÁCÍ ADRESÁØ=%s

source: INACTIVE=%ld
cs: VYPNUTÍ=%ld

source: EXPIRE=%s
cs: VYPR©ENÍ=%s

source: SHELL=%s
cs: INTERPRET PØÍKAZÙ=%s

source: SKEL=%s
cs: SKELETON=%s

source: %s: cannot create new defaults file
cs: %s: nemohu vytvoøit nový soubor s implicitními hodnotami

source: %s: cannot open new defaults file
cs: %s: nemohu otevøít nový soubor s implicitními hodnotami

source: %s: rename: %s
cs: %s: pøejmenovat: %s

source: %s: group `%s' is a NIS group.
cs: %s: skupina `%s' je NIS skupinou

source: %s: too many groups specified (max %d).
cs: %s: zadáno pøíli¹ mnoho skupin (max %d).

source: usage: %s [-u uid [-o]] [-g group] [-G group,...]
cs: Pou¾ití: %s [-u uid [-o]] [-g skupina [-G skupina,...]

source: [-d home] [-s shell] [-c comment] [-m [-k template]]
cs: [-d domácí adr.] [-s shell] [-c komentáø] [-m [-k ¹ablona]]

source: [-f inactive] [-e expire ]
cs: [-f vypnutí] [-e vypr¹ení ]

source: [-p passwd] name
cs: [-p heslo] jméno

source: %s -D [-g group] [-b base] [-s shell]
cs: %s -D [-g skupina [-b základní adr.] [-s shell]

source: [-f inactive] [-e expire ]
cs: [-f vypnutí] [-e vypr¹ení ]

source: %s: error locking group file
cs: %s: chyba pøi zamykání souboru se skupinami

source: %s: error opening group file
cs: %s: chyba pøi otevírání souboru se skupinami

source: %s: error locking shadow group file
cs: %s: chyba pøi zamykání souboru se stínovými hesly

source: %s: error opening shadow group file
cs: %s: chyba pøi otevírání souboru se stínovými hesly

source: %s: uid %u is not unique
cs: %s uid %u není jedineèné

source: %s: can't get unique uid
cs: %s: nemohu získat jedineèné uid

source: %s: invalid field `%s'
cs: %s: chybná polo¾ka `%s'

source: %s: invalid base directory `%s'
cs: %s: chybný základní adresáø `%s'

source: %s: invalid comment `%s'
cs: %s: chybný komentáø `%s'

source: %s: invalid home directory `%s'
cs: %s: chybný domácí adresáø `%s'

source: %s: invalid date `%s'
cs: %s: chybné datum `%s'

source: %s: shadow passwords required for -e
cs: %s: pøepínaè -e vy¾aduje stínová hesla

source: %s: shadow passwords required for -f
cs: %s: pøepínaè -f vy¾aduje stínová hesla

source: %s: invalid shell `%s'
cs: %s: chybný shell `%s'

source: %s: invalid user name '%s'
cs: %s: chybné u¾ivatelské jméno `%s'

source: %s: cannot rewrite password file
cs: %s: soubor s hesly nelze pøepsat

source: %s: cannot rewrite shadow password file
cs: %s: soubor se stínovými hesly nelze pøepsat

source: %s: unable to lock password file
cs: %s: soubor s hesly nelze zamknout

source: %s: unable to open password file
cs: %s: soubor s hesly nelze otevøít

source: %s: cannot lock shadow password file
cs: %s: soubor se stínovými hesly nelze zamknout

source: %s: cannot open shadow password file
cs: %s: soubor se stínovými hesly nelze otevøít

source: %s: error adding authentication method
cs: %s: chyba pøi vytváøení ovìøovací metody

source: %s: error adding new password entry
cs: %s: chyba pøi vytváøení nové polo¾ky v souboru s hesly

source: %s: error updating password dbm entry
cs: %s: chyba pøi aktualizaci polo¾ky dbm databáze hesel

source: %s: error adding new shadow password entry
cs: %s: chyba pøi vytváøení nové polo¾ky v souboru se stínovými hesly

source: %s: error updating shadow passwd dbm entry
cs: %s: chyba pøi aktualizaci polo¾ky dbm databáze stínových hesel

source: %s: cannot create directory %s
cs: %s: adresáø %s nelze vytvoøit

source: %s: user %s exists
cs: %s: u¾ivatel %s ji¾ existuje

source: %s: group %s exists - if you want to add this user to that group, use -g.
cs: %s: skupina %s existuje - chcete-li pøidat tohoto u¾ivatele do této skupiny, pou¾ijte -g.

source: %s: warning: CREATE_HOME not supported, please use -m instead.
cs: %s: varování: CREATE_HOME není podporováno, pou¾ijte pøepínaè -m

source: usage: %s [-r] name
cs: Pou¾ití: %s [-r] jméno

source: %s: error updating group entry
cs: %s: polo¾ku souboru se skupinami nelze aktualizovat

source: %s: cannot update dbm group entry
cs: %s: polo¾ku dbm databáze skupin nelze aktualizovat

source: %s: cannot remove dbm group entry
cs: %s: polo¾ku dbm databáze skupin nelze odstranit

source: %s: cannot rewrite TCFS key file
cs: %s: soubor s TCFS klíèi nelze pøepsat

source: %s: cannot lock TCFS key file
cs: %s: soubor s TCFS klíèi nelze zamknout

source: %s: cannot open TCFS key file
cs: %s: soubor s TCFS klíèi nelze otevøít

source: %s: cannot open group file
cs: %s: soubor se skupinami nelze otevøít

source: %s: cannot open shadow group file
cs: %s: soubor se stínovými skupinami nelze otevøít

source: %s: error deleting authentication
cs: %s: chyba pøi odstraòování ovìøovací metody

source: %s: error deleting password entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru s hesly

source: %s: error deleting shadow password entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru se stínovými hesly

source: %s: error deleting TCFS entry
cs: %s: chyba pøi odstraòování TCFS polo¾ky

source: %s: error deleting password dbm entry
cs: %s: chyba pøi odstraòování polo¾ky z dbm databáze hesel

source: %s: error deleting shadow passwd dbm entry
cs: %s: chyba pøi odstraòování polo¾ky z dbm databáze stínových hesel

source: %s: user %s is currently logged in
cs: %s: u¾ivatel %s je právì pøihlá¹en

source: %s: warning: %s not owned by %s, not removing
cs: %s: varování: vlastníkem %s není %s, nema¾u jej

source: %s: warning: can't remove
cs: %s: varování: nemohu smazat

source: %s: user %s does not exist
cs: %s: u¾ivatel %s neexistuje

source: %s: user %s is a NIS user
cs: %s: u¾ivatel %s je NIS u¾ivatelem

source: %s: %s not owned by %s, not removing
cs: %s: vlastníkem %s není %s, nema¾u jej

source: %s: not removing directory %s (would remove home of user %s)
cs: %s: adresáø %s nebudu mazat (je to domácí adresáø u¾ivatele %s)

source: %s: error removing directory %s
cs: %s: chyba pøi mazání adresáøe %s

source: [-d home [-m]] [-s shell] [-c comment] [-l new_name]
cs: [-d domácí adr. [-m]] [-s shell] [-c komentáø] [-l nové jméno]

source: [-p passwd] [-L|-U] name
cs: [-p heslo] [-L|-U] jméno

source: %s: out of memory in update_group
cs: %s nedostatek pamìti v update_group

source: %s: out of memory in update_gshadow
cs: %s: nedostatek pamìti v update_gshadow

source: %s: no flags given
cs: %s: ¾ádné pøepínaèe

source: %s: shadow passwords required for -e and -f
cs: %s: pøepínaèe -e a -f vy¾adují stínová hesla

source: %s: uid %lu is not unique
cs: %s uid %lu není jedineèné

source: %s: error deleting authentication method
cs: %s: chyba pøi odstraòování ovìøovací metody

source: %s: error changing authentication method
cs: %s: chyba pøi zmìnì ovìøovací metody

source: %s: error changing password entry
cs: %s: chyba pøi zmìnì polo¾ky v souboru s hesly

source: %s: error removing password entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru s hesly

source: %s: error adding password dbm entry
cs: %s: chyba pøi pøidávání polo¾ky do dbm databáze hesel

source: %s: error removing passwd dbm entry
cs: %s: chyba pøi odstraòování polo¾ky z dbm databáze hesel

source: %s: error removing shadow password entry
cs: %s: chyba pøi odstraòování polo¾ky ze souboru se stínovými hesly

source: %s: error removing shadow passwd dbm entry
cs: %s: chyba pøi odstraòování polo¾ky z dbm databáze stínových hesel

source: %s: directory %s exists
cs: %s: adresáø %s ji¾ existuje

source: %s: can't create %s
cs: %s: %s nelze vytvoøit

source: %s: can't chown %s
cs: %s: volání chown pro %s selhalo

source: %s: warning: failed to completely remove old home directory %s
cs: %s: varování: odstranìní starého domovského adresáøe %s selhalo

source: %s: cannot rename directory %s to %s
cs: %s: adresáø %s nelze na %s pøejmenovat

source: %s: warning: %s not owned by %s
cs: %s: varování: vlastníkem %s není %s

source: failed to change mailbox owner
cs: chyba pøi zmìnì vlastníka po¹tovní schránky

source: failed to rename mailbox
cs: chyba pøi pøejmenovávání po¹tovní schránky

source: %s: %s is unchanged
cs: %s: %s je beze zmìny

source: Couldn't lock file
cs: Soubor nelze zamknout

source: Couldn't make backup
cs: Zálohování nelze provést.

source: %s: can't restore %s: %s (your changes are in %s)
cs: %s: %s nelze obnovit: %s (zmìny jsou v %s)

source: Usage: `vipw' edits /etc/passwd `vipw -s' edits /etc/shadow `vigr' edits /etc/group `vigr -s' edits /etc/gshadow
cs: Pou¾ití: `vipw' edituje /etc/passwd `vipw -s' edituje /etc/shadow `vigr' edituje /etc/group `vigr -s' edituje /etc/gshadow
