Repository: hallyn/shadow-debian
Catalog: 4.0.3-32/po/*.po
Languages: id, uk

source: Root password:
id: Kata sandi root:
uk: Пароль користувача root:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
id: Anda perlu membuat kata sandi untuk 'root', akun untuk administrasi sistem. Pengguna tidak bertanggung jawab yang memiliki akses root dapat mengakibatkan bencana, jadi anda mesti memilih kata sandi untuk root yang tidak mudah ditebak. Kata sandi sebaiknya bukan kata yang dapat ditemukan dalam kamus, atau kata yang dapat diasosiasikan dengan anda, misalnya nama tengah anda. Kata sandi yang baik berisi campuran huruf, angka dan tanda baca, serta diubah secara berkala. Kata sandi root dapat diganti dengan menjalankan program 'passwd' sebagai root.
uk: Вам потрібно встановити пароль для "root", адміністративного облікового запису системи. Злорадний або некваліфікований користувач з правами "root" може привести систему до непрацездатного стану. Тому ви повинні вибирати пароль користувача root так, щоб його не можна було легко вгадати. Це не повинно бути слово, яке можна знайти в словнику, або слово, яке може бути пов'язане із вами. Гарний пароль повинен складатися із суміші літер, цифр та знаків пунктуації, він повинен регулярно змінюватися. Пароль суперкористувача можна змінити запустивши програму "passwd" як root.

source: Note that you will not be able to see the password as you type it.
id: Perhatikan bahwa anda tidak dapat melihat kata sandi saat anda mengetikkannya.
uk: Зауважте, що ви не будете бачити пароль під час його набору.

source: Please enter the same root password again to verify that you have typed it correctly.
id: Silakan masukkan kata sandi root yang sama lagi untuk memastikan bahwa anda mengetikkannya dengan benar.
uk: Введіть той самий пароль root для перевірки, що ви ввели його вірно.

source: Create a normal user account now?
id: Membuat akun untuk pengguna biasa sekarang?
uk: Створити звичайний обліковий запис?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
id: Merupakan hal yang buruk bila menggunakan akun root untuk aktifitas sehari-hari, misalnya untuk membaca surat elektronik, karena kesalahan yang kecil saja dapat mengakibatkan bencana. Anda disarankan membuat akun pengguna biasa untuk tugas-tugas sehari-hari.
uk: Виконання повсякденної роботи, такої як перегляд електронної пошти, з використанням облікового запису "root" не є гарною ідеєю, оскільки навіть невелика помилка може призвести до катастрофи. Зараз ви можете створити звичайний обліковий запис для виконання повсякденних задач.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
id: Perhatikan bahwa anda dapat membuatnya nanti (juga akun tambahan lain) dengan mengetikkan 'adduser <namapengguna>' sebagai root, dimana <namapengguna> merupakan nama pengguna, seperti 'jojond' atau 'kusno', dll.
uk: Зауважте, що ви можете створити його пізніше (як і інших додаткових користувачів) шляхом введення команди 'adduser <ім'я>' як root. Тут ім'я - це вхідне ім'я, наприклад imurdock' або 'rms'.

source: Enter a username for your account:
id: Masukkan nama untuk akun anda:
uk: Введіть ім'я користувача:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
id: Pilih nama pengguna untuk akun baru. Nama depan anda merupakan pilihan yang baik. Nama pengguna sebaiknya dimulai dengan huruf kecil, yang dapat diikuti dengan kombinasi angka dan huruf kecil.
uk: Виберіть ім'я користувача для нового облікового запису. Ваше ім'я - це гарний вибір. Ім'я користувача повинно починатися із малої латинської літери, за якою може слідувати довільна комбінація цифр та малих латинських літер.

source: Invalid username entered.
id: Nama pengguna yang dimasukkan tidak sah.
uk: Введено невірне ім'я користувача.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
id: Nama pengguna yang anda masukkan tidak sah. Perhatikan bahwa nama pengguna mesti dimulai dengan huruf kecil, yang kemudian diikuti dengan kombinasi angka dan huruf kecil.
uk: Ім'я користувача, яке ви ввели, невірне. Зауважте, що ім'я користувача повинно починатися з малої літери, за якою може слідувати будь-яка комбінація цифр та літер нижнього регістру.

source: Enter a full name for the new user:
id: Masukkan nama lengkap dari pengguna baru:
uk: Введіть повне ім'я нового користувача:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
id: Akun pengguna akan dibuatkan untuk anda gunakan dalam aktifitas non-administratif.
uk: Для вас буде створений обліковий запис користувача замість облікового запису "root" для виконання не-адміністративних задач.

source: Enter a password for the new user:
id: Masukkan kata sandi untuk pengguna baru:
uk: Введіть пароль для нового користувача:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
id: Kata sandi yang baik berisi campuran huruf, angka dan tanda baca, serta diganti secara berkala.
uk: Гарний пароль повинен складатися із суміші літер, цифр та знаків пунктуації, він повинен регулярно змінюватися.

source: Re-enter password to verify:
id: Masukkan lagi kata sandi untuk verifikasi:
uk: Повторіть ввід паролю для перевірки:

source: Please enter the same user password again to verify you have typed it correctly.
id: Silakan masukkan lagi kata sandi pengguna yang sama untuk memastikan anda mengetikkannya dengan benar.
uk: Введіть той самий пароль користувача для перевірки, що ви ввели його вірно.

source: Password input error.
id: Kesalahan masukan kata sandi.
uk: Помилка вводу пароля.

source: The two passwords you entered were not the same. Please try again.
id: Kedua kata sandi yang anda masukkan tidak identik. Silakan coba lagi.
uk: Два введені вами пароля неоднакові. Спробуйте ще раз.

source: Empty password was entered.
id: Kata sandi yang dimasukkan kosong.
uk: Введено порожній пароль.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
id: Anda tampaknya tidak mengetikkan apa-apa untuk kata sandi. Itu tidak aman! Silakan coba lagi.
uk: Схоже, що ви нічого не ввели в якості пароля. Це небезпечно! Спробуйте знову.

source: Enable shadow passwords?
id: Menggunakan kata sandi bayangan?
uk: Ввімкнути підтримку прихованих паролів?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
id: Kata sandi bayangan membuat sistem anda lebih aman, karena tak seorangpun dapat melihat kata sandi terenkripsi. Kata sandi disimpan pada berkas terpisah yang hanya dapat dibaca oleh program-program tertentu. Sangat disarankan menggunakan kata sandi bayangan. Namun jika anda akan menggunakan NIS dapat terjadi masalah.
uk: Приховані паролі роблять вашу систему більш безпечною, оскільки ніхто не може бачити зашифровані паролі. Паролі зберігаються в окремому файлі так, що тільки спеціальні програми можуть їх прочитати. Ми рекомендуємо дужевикористовувати приховані паролі. Але якщо ви збираєтесь використовувати NIS, у вас можуть виникнути проблеми.

source: Enable md5 passwords?
id: Menggunakan kata sandi md5?
uk: Ввімкнути підтримку паролів MD5?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
id: Kata sandi md5 lebih aman dan membolehkan kata sandi lebih panjang dari 8 huruf. Namun, kata sandi md5 dapat mengakibatkan masalah kompatibilitas bila anda menggunakan NIS atau ingin menggunakan berkas kata sandi dengan sistem-sistem lama.
uk: Паролі MD5 більш безпечні та дозволяють використовувати паролі довші за 8 символів. Але вони можуть призвести до виникнення проблем із сумісністю якщо ви використовуєте NIS або використовуєте файли паролів спільно з іншими системами.
