Repository: hallyn/shadow-debian
Catalog: 4.0.3-35/po/*.po
Languages: hi

source: Root password:
hi: रूट पासवर्डः

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
hi: आपको तंत्र प्रशासक रूट खाता हेतु पासवर्ड सेट करना होगा. कोई विद्वेषी या अज्ञानी उपयोक्ता जिसे रूट पासवर्ड की जानकारी हो, तो वह आपके लिए घोर विपत्ति पैदा कर सकता है. अतः आपको ऐसा रूट पासवर्ड नियत करना चाहिए जिसका आसानी से अंदाजा नहीं लगाया जा सके. पासवर्ड ऐसा नहीं होना चाहिए जो शब्दकोश में मिल जाए, या आपका उपनाम. एक अच्छे पासवर्ड में अक्षर, अंक तथा चिह्नों को शामिल होना चाहिए तथा वे नियमित अंतराल से बदले जाने चाहिएँ. रूट पासवर्ड को रूट उपयोक्ता के रूप में 'passwd' प्रोग्राम चलाकर बदला जा सकता है.

source: Note that you will not be able to see the password as you type it.
hi: टीप लें कि आप पासवर्ड को टाइप करते समय नहीं देख पाएँगे.

source: Please enter the same root password again to verify that you have typed it correctly.
hi: कृपया उसी रूट पासवर्ड को भरें यह सत्यापित करने के लिए कि उसे आपने सही टाइप किया है.

source: Create a normal user account now?
hi: सामान्य उपयोक्ता खाता अभी बनाएँ?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
hi: यह अच्छा विचार नहीं है कि रोजाना के कार्यों मसलन ई-मेल पढ़ने हेतु रूट खाते का उपयोग किया जाए, क्योंकि एक छोटी सी भूल भी आपके लिए घोर विपत्ति ला सकती है. ऐसे रोजाना के कार्यों के लिए आप अपने लिए एक साधारण उपयोक्ता खाता बना लें.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
hi: टीप लें कि आप इसे बाद में भी बना सकते हैं (तथा और भी अन्य खाते) बस आपको रूट उपयोक्ता के रूप में टाइप करना है- 'adduser <username>', जहाँ <username> उपयोक्ता का नाम होगा जैसे कि 'ravi' या 'rekha'.

source: Enter a username for your account:
hi: आपके खाता के लिए उपयोक्ता नाम भरें:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
hi: नया खाता के लिए उपयोक्ता नाम चुनें. आपका प्रथम नाम एक सही चुनाव हो सकता है. उपयोक्ता नाम लोअर-केस अक्षर से प्रारंभ होना चाहिए जो कि अंकों के किसी भी अनुक्रम तथा और अन्य लोअर-केस अक्षरों से बन सकते हैं.

source: Invalid username entered.
hi: अवैध उपयोक्ता नाम भरा गया.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
hi: आपने जो उपयोक्ता नाम भरा है वह अवैध है. टीप लें कि उपयोक्ता नाम को लोअर-केस अक्षर से प्रारंभ होना चाहिए, जो अंकों तथा तथा अन्य लोअर-केस अक्षरों के कैसे भी संयोजन से लिखे जा सकते हैं.

source: Enter a full name for the new user:
hi: नए उपयोक्ता का पूरा नाम भरें:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
hi: अ-प्रशासकीय कार्यों हेतु आपके लिए रूट खाता के बदले एक उपयोक्ता खाता बनाया जाएगा.

source: Enter a password for the new user:
hi: नए उपयोक्ता हेतु पासवर्ड भरें:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
hi: एक अच्छे पासवर्ड में अक्षर, संख्याएँ तथा चिह्न मिले जुले होने चाहिएँ तथा नियमित अंतराल में बदले जाने चाहिएँ.

source: Re-enter password to verify:
hi: सत्यापित करने हेतु पासवर्ड फिर से भरें:

source: Please enter the same user password again to verify you have typed it correctly.
hi: कृपया वही उपयोक्ता पासवर्ड फिर से भरें ताकि यह सत्यापित किया जा सके कि आपने इसे सही टाइप किया है.

source: Password input error.
hi: पासवर्ड इनपुट त्रुटि.

source: The two passwords you entered were not the same. Please try again.
hi: दो पासवर्ड जो आपने भरा है वे एक जैसे नहीं हैं, कृपया फिर कोशिश करें.

source: Empty password was entered.
hi: रिक्त पासवर्ड प्रविष्ट किया गया.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
hi: प्रतीत होता है कि आपने पासवर्ड के लिए कुछ भी भरा नहीं है. यह सुरक्षित नहीं है! कृपया फिर से कोशिश करें.

source: Enable shadow passwords?
hi: शेडो पासवर्ड सक्षम करें?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
hi: शेडो पासवर्ड आपके तंत्र को अधिक सुरक्षित बनाते हैं चूंकि आपके एनक्रिप्टेड पासवर्ड को भी कोई देख नहीं पाएगा. पासवर्ड को अलग फ़ाइलों में भंडारित किया जाता है जो कि विशिष्ट प्रोग्राम द्वारा ही पढ़ा जा सकता है. शेडो पासवर्ड के उपयोग के लिए सशक्त अनुशंसा की जाती है.
