Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/debian/po/*.po
Languages: es, hr, sv

source: Root password:
es: Clave del superusuario:
hr: Korijenska zaporka:
sv: Root-lösenord:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
es: Necesita definir una contraseña para el superusuario, la cuenta de administración del sistema. Un usuario malicioso o sin la debida cualificación con acceso a la cuenta de administración puede acarrear unos resultados desastrosos, así que debe de tener cuidado para que la contraseña del superusuario no sea fácil de adivinar. No debe ser una palabra de diccionario, o una palabra que pueda asociarse fácilmente con usted, como su segundo nombre. Una buena contraseña debe contener una mezcla de letras, números y signos de puntuación, y se debe cambiar regularmente. La contraseña del superusuario se cambia ejecutando el programa 'passwd' como superusuario.
hr: Morate postaviti zaporku za korijenskog korisnika, raèun administratora sustava. Zlonamjeran ili nestruèan korisnik koji ima korijenski pristup mo¾e izazvati golemu ¹tetu, pa se pobrinite da korijensku zaporku ne bude jednostavno odgonetnuti. To ne bi trebala biti obièna rijeè, ili rijeè koju je lako povezati s vama. Dobru zaporku sastavit æete od slova, brojaka i interpunkcija i redovito æete je mijenjati. Korijensku zaporku mo¾ete promijeniti pomoæu programa "passwd", prijavljeni kao korijenski korisnik.
sv: Nu måste du ange ett lösenord för "root", systemadministratörskontot. En illvillig eller oerfaren användare med root-tillgång kan få katastrofala följder, så du bör se till att välja ett root-lösenord som inte är lätt att gissa. Det bör inte vara ett ord som kan hittas i ordbok, inte heller ett ord som lätt kan förknippas med dig, som delar av ditt namn. Ett bra lösenord innehåller en blandning av bokstäver, siffror och interpunktion och ändras regelbundet. Root-lösenordet ändras genom att köra programmet "passwd" som root.

source: Note that you will not be able to see the password as you type it.
es: Tenga en cuenta que no podrá ver la contraseña mientras la introduce.
hr: Primijetite da neæete moæi vidjeti zaporku tipkajuæi je.
sv: Notera att du inte kommer att kunna se lösenordet när du skriver det

source: Please enter the same root password again to verify that you have typed it correctly.
es: Por favor, introduzca la misma contraseña de superusuario de nuevo para verificar que la introdujo correctamente.
hr: Molim unesite istu korijensku zaporku kao potvrdu da ste je ispravno utipkali.
sv: Ange samma root-lösenord igen för att bekräfta att du skrev det korrekt.

source: Create a normal user account now?
es: ¿Creo ahora una cuenta de usuario normal?
hr: Naèini i obièan korisnièki raèun?
sv: Skapa ett vanligt användarkonto nu?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
es: Es una mala idea usar la cuenta de superusuario para las actividades diarias, como leer el correo electrónico, ya que incluso el fallo más pequeño puede dar lugar a un desastre. Debería crear una cuenta de usuario normal para esas tareas cotidianas.
hr: Nije dobro koristiti korijenski raèun za svakodnevne aktivnosti., primjerice èitanje i slanje e-po¹te, jer vam i mala pogre¹ka mo¾e prièiniti veliku ¹tetu. Zato trebate naèiniti obièni korisnièki raèun.
sv: Det är inte bra att använda root-kontot för dagliga aktiviteter som att läsa e-post eftersom även ett litet misstag kan sluta i katastrof. Du bör skapa ett vanligt användarkonto och använda det för dagliga sysslor.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
es: También puede crearla luego (igual que cualquier otra cuenta adicional) ejecutando como superusuario 'adduser <nombre>' donde <nombre> es un nombre de usuario como 'imurdock' o 'rms'.
hr: Mo¾ete ga naèiniti i kasnije (kao i bilo koji dodatni korisnièki raèun) tako da utipkate 'adduser <ime_korisnika>', prijavljeni kao korijenski korisnik. To <ime_korisnika> mo¾e biti proizvoljno, primjerice 'pero', 'ana'...
sv: Notera att du kan skapa det senare (liksom ytterligare konton) genom att skriva "adduser <användarnamn>" som root, där <användarnamn> är ett användarnamn som "imurdock" eller "rms".

source: Enter a username for your account:
es: Introduzca un nombre de usuario para su cuenta:
hr: Unesite korisnièko ime za va¹ raèun:
sv: Ange ett användarnamn för ditt konto:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
es: Selecciones un nombre de usuario para la nueva cuenta. Su primer nombre es una elección razonable. El nombre de usuario debe empezar con una letra minúscula, seguida de cualquier combinación de números y más letras minúsculas.
hr: Izaberite korisnièko ime za novi korisnièki raèun. Va¹e ime je uobièajeni izabir. Korisnièko ime treba zapoèinjati malim slovom, a mo¾e se sastojati od bilo koje kombinacije brojaka i malih slova.
sv: Välj ett användarnamn för det nya kontot. Ditt förnamn är ofta ett bra val. Användarnamnet bör inledas med liten bokstav och kan sedan följas av en godtycklig kombination av siffror och små bokstäver.

source: Invalid username entered.
es: Nombre de usuario no válido.
hr: Uneseno nevaljano korisnièko ime.
sv: Ogiltigt användarnamn angavs.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
es: El nombre de usuario que ha introducido no es válido. Los nombres de usuario deben empezar con una letra minúscula, seguida de cualquier combinación de números y más minúsculas.
hr: Korisnièko ime koje ste unijeli nije valjano. Korisnièka imena moraju zapoèinjati malim slovima, a mogu se sastojati od bilo koje kombinacije brojaka i malih slova.
sv: Användarnamnet som du angav är ogiltigt. Notera att användarnamnet måste inledas med en gemen bokstav, vilken sedan kan följas av en valfri kombination av siffror och fler gemena bokstäver.

source: Enter a full name for the new user:
es: Introduzca el nombre completo de su nuevo usuario:
hr: Unesite puno ime novoga korisnika:
sv: Ange det fullständiga namnet för den nya användaren:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
es: Se creará una cuenta de usuario para que la use en vez de la cuenta de superusuario en sus tareas que no sean administrativas.
hr: Bit æe naèinjen obièni korisnièki raèun da ga mo¾ete koristiti namjesto korijenskog, za svakodnevne aktivnosti.
sv: Ett användarkonto kommer att skapas som du bör använda istället för root-kontot för icke-administrativa sysslor.

source: Enter a password for the new user:
es: Introduzca una contraseña para el nuevo usuario:
hr: Unesite zaporku za novoga korisnika:
sv: Ange ett lösenord för den nya användaren:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
es: Una buena contraseña debe contener una mezcla de letras, números y signos de puntuación, y se debe cambiar regularmente.
hr: Dobru zaporku sastavit æete od slova, brojaka i interpunkcija i redovito æete je mijenjati.
sv: Ett bra lösenord innehåller en blandning av bokstäver, siffror och interpunktion och ändras regelbundet.

source: Re-enter password to verify:
es: Vuelva a introducir la contraseña para su verificación:
hr: Iznova unesite zaporku za potvrdu:
sv: Ange lösenordet igen som bekräftelse:

source: Please enter the same user password again to verify you have typed it correctly.
es: Por favor, introduzca la misma contraseña de usuario de nuevo para verificar que la introdujo correctamente.
hr: Molim unesite istu korisnièku zaporku kao potvrdu da ste je ispravno utipkali.
sv: Ange samma användarlösenord igen för att bekräfta att du skrev det korrekt.

source: Password input error.
es: Error al introducir la contraseña.
hr: Pogre¹ka pri uno¹enju zaporke
sv: Inmatningsfel av lösenord.

source: The two passwords you entered were not the same. Please try again.
es: Las dos contraseñas que ha introducido no son la misma. Por favor, inténtelo de nuevo.
hr: Zaporke koje ste unijeli nisu jednake. Molim poku¹ajte iznova.
sv: De två lösenorden som du angav var inte samma. Försök igen.

source: Empty password was entered.
es: Introdujo una contraseña vacía.
hr: Unesena je prazna zaporka.
sv: Tomt lösenord angavs.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
es: Parece ser que usted no ha introducido nada como contraseña. ¡Esto es inseguro! Por favor, inténtelo de nuevo.
hr: Èini se da niste ni¹ta unijeli kao zaporku. To je nesigurno! Molim poku¹ajte iznova.
sv: Du verkar inte ha skrivit in någonting alls som lösenord. Det är osäkert!Försök igen.

source: Enable shadow passwords?
es: ¿Habilito las contraseñas ocultas (shadow)?
hr: Omoguæi sjenkaste zaporke?
sv: Aktivera shadow-lösenord?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
es: Las contraseñas ocultas hacen su sistema más seguro, porque nadie podrá ver ni siquiera las contraseñas cifradas. Las contraseñas se almacenan en un fichero separado, que sólo puede ser leído por programas especiales. Le recomendamos encarecidamente el uso de las contraseñas ocultas. Sin embargo, si va a usar NIS podría tener problemas.
hr: Sjenkaste zaporke èine va¹ sustav sigurnijim, jer nitko ne mo¾e vidjeti èak niti enkriptirane zaporke. Sve one su spremljene u posebnu datoteku koju mogu èitati samo posebni programi. Uporaba sjenkastih zaporki se ozbiljno preporuèa. Meðutim, ako æete koristiti NIS, mo¾ete upasti u nevolje.
sv: Shadow-lösenord gör ditt system säkrare eftersom ingen kan se ens krypterade lösenord. Lösenord lagras i en separat fil som bara kan läsas av speciella program. Det rekommenderas starkt att du använder shadow-lösenord. Om du ska använda NIS kan du dock stöta på problem.

source: Enable md5 passwords?
es: ¿Habilito las contraseñas md5?
hr: Omoguæi md5 zaporke?
sv: Aktivera md5-lösenord?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
es: Las contraseñas md5 son más seguras y permiten usar contraseñas de más de 8 caracteres. Si embargo pueden causar problemas de compatibilidad si usa NIS o comparte ficheros de contraseñas con sistemas más antiguos.
hr: Md5 zaporke su sigurnije i dopu¹taju kori¹tenje zaporki du¾ih od 8 znakova. Meðutim, mogu prouzrokovati nekompatibilnosti ako rabite NIS ili dijelite datoteke zaporki sa starijim sustavima.
sv: Md5-lösenord är säkrare och tillåter att lösenord som är längre än 8 tecken används. De kan dock orsaka kompabilitetsproblem om du använder NIS eller delar lösenord med äldre system.
