Repository: hallyn/shadow-debian
Catalog: 4.0.18.1-4/po/*.po
Languages: hu

source: Root password:
hu: Root jelszó:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in dictionaries, or a word that could be easily associated with you.
hu: Add meg a 'root', a rendszer adminisztrátori hozzáférés jelszavát. A rosszindulatú vagy képzetlen felhasználók root hozzáféréssel katasztrófát okozhatnak, ezért a root jelszó ne legyen könnyen kitalálható. Ne legyen szótári, vagy könnyen hozzád köthető szó.

source: Note that you will not be able to see the password as you type it.
hu: Fontos, hogy a begépelés közben a jelszó nem jelenik meg.

source: Please enter the same root password again to verify that you have typed it correctly.
hu: A 'root' felhasználó jelszavának ellenőrzése céljából ismét írd be azt.

source: Create a normal user account now?
hu: Létrehozol normál felhasználót most?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
hu: A 'root' fiókot soha nem használjuk hétköznapi tevékenységekre, például elektronikus levelek olvasására, mert még egy kis tévedés is katasztrófát okozhat. Egy sima felhasználót kell létrehozni a mindennapi feladatokra.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
hu: Végső esetben ez később is létrehozható (és további fiókok) az 'adduser <felhasználónév>' parancsot mint root kiadva (ahol a <felhasználónév> a felhasználó neve, mint például 'imurdock' vagy 'rms').

source: Full name for the new user:
hu: Az új felhasználó TELJES Neve:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
hu: Egy felhasználói fiók jön létre a normál használatra, mert a root fiókot kizárólag adminisztratív feladatokra használjuk.

source: Please enter the real name of this user. This information will be used for instance as default origin for emails sent by this user as well as any program which displays or uses the user's real name. Your full name is a reasonable choice.
hu: Add meg e felhasználó VALÓDI Nevét. Ez az adat például e felhasználó által küldött levelek alapértelmezett feladójaként és a felhasználó VALÓDI Nevét megjelenítő más programok által használt. A TELJES Név egy jó választás.

source: Username for your account:
hu: A felhasználó neve:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
hu: Add meg az új felhasználói fiókhoz rendelt nevet. A keresztnév általában megfelel e célra. A felhasználónév kisbetűvel kell kezdődjön, aztán számok és további kisbetűk tetszőleges kombinációja állhat.

source: Invalid username
hu: Érvénytelen felhasználónév

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
hu: A megadott felhasználónév nem érvényes. A felhasználónévnek kisbetűvel kell kezdődnie, aztán számok és további kisbetűk tetszőleges kombinációja állhat.

source: Password for the new user:
hu: Az új felhasználó jelszava:

source: A good password will contain a mixture of letters, numbers and punctuation and should be changed at regular intervals.
hu: A jó jelszó betűk, számok és írásjelek keveréke és szabályos időközönként cserélni kell.

source: Re-enter password to verify:
hu: A jelszó ellenőrző ismétlése:

source: Please enter the same user password again to verify you have typed it correctly.
hu: A jelszó ellenőrzése céljából ismét írd be azt.

source: Password input error
hu: Jelszóbeviteli hiba

source: The two passwords you entered were not the same. Please try again.
hu: A két megadott jelszó nem egyezik. Add meg ismét a jelszót.

source: Empty password
hu: Üres jelszó

source: You entered an empty password, which is not allowed. Please choose a non-empty password.
hu: Üres jelszót adtál meg, mely tilos. Adj meg egy nem-üres jelszót.

source: Enable shadow passwords?
hu: A jelszavak legyenek "árnyékolva"?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. The passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended, except in a few cases such as NIS environments.
hu: Az árnyék jelszavak növelik a rendszer biztonságát, mert senki nem tudja megnézni a titkosított jelszavakat sem. A jelszavak egy külön fájlban vannak, mely csak különleges programokkal olvasható. Az árnyék jelszavak használata nagyon ajánlott, kivéve pár esetben, például NIS környezetben.

source: Set up users and passwords
hu: Felhasználók és jelszavak beállítása
