Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge5/debian/po/*.po
Languages: da, de, hu, ko

source: Root password:
da: Root-adgangskode:
de: Root-Passwort:
hu: A 'root' felhasználó jelszava:
ko: 루트 열쇠글:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
da: Du skal angive en adgangskode for 'root', systemets administrationskonto. Hvis en ondsindet eller ukvalificeret bruger får adgang som root, kan det have katastrofale følger, så du bør vælge en root-adgangskode, der ikke er for let at gætte. Den bør ikke være et ord, der findes i ordbøger eller et ord som nemt kan forbindes med dig, såsom dit mellemnavn. En god adgangskode indeholder en blanding af bogstaver, tal og tegnsætning, og bliver ændret fra tid til anden. Adgangskoden kan ændres ved at køre programmet 'passwd'som root.
de: Sie müssen ein Passwort für »root«, das systemverwaltende Konto, angeben. Ein bösartiger Benutzer oder jemand, der sich nicht auskennt und Root-Rechte besitzt, kann verheerende Schäden anrichten. Deswegen sollten Sie darauf achten, ein Passwort zu wählen, dass nicht einfach zu erraten ist. Es sollte nicht in einem Wörterbuch vorkommen oder leicht mit Ihnen in Verbindung gebracht werden, wie z.B. Ihr zweiter Vorname. Ein gutes Passwort enthält eine Mixtur aus Buchstaben, Zahlen und Sonderzeichen und wird in regelmäßigen Abständen geändert. Das root Passwort kann durch Ausführen von »passwd« als root geändert werden.
hu: Állítsa be a 'root' felhasználó (a rendszer adminisztrátora) jelszavát. Mivel rosszindulatú vagy hozzánemértő felhasználók számára nem tanácsos rendszeradminisztrátori hozzáférést lehetővé tenni, a 'root' jelszavát gondosan válassza meg, az ne legyen könnyen kitalálható. Mellőzze a szótári és a személyhez köthető szavakat (pl. beceneveket). Az igazán jó jelszavak betűk, számok és írásjelek keverékéből állnak, emellett rendszeres cserén esnek át. A 'root' jelszavát a 'passwd' program 'root' felhasználó nevében történő futtatásával változtathatja meg.
ko: 이제 'root'의 열쇠글을 설정해야 합니다. 루트(root)는 시스템 관리자의 계정입니다. 악의가 있는 사용자나 잘 모르는 사용자가 루트 권한을 갖게 되면 막심한 피해를 입을 수도 있습니다. 그러므로 루트 열쇠글을 설정할 때 열쇠글을 쉽게 예측하지 못하도록 신경을 써야 합니다. 사전에 있는 단어를 사용하면 안 되고, 본인 신상정보와 관련해서 쉽게 예측할 수 있는 열쇠글을 사용해서도 안 됩니다 (별명 따위). 좋은 열쇠글은 글자, 숫자, 기호를 섞어서 만들고 정기적으로 바꾸는 게 좋습니다. 루트 열쇠글은 루트 사용자로 'passwd' 프로그램을 실행해서 바꿀 수 있습니다.

source: Note that you will not be able to see the password as you type it.
da: Bemærk at du ikke vil kunne se adgangskoden imens du skriver det.
de: Hinweis: Sie werden das Passwort während der Eingabe nicht sehen.
hu: Fontos, hogy a begépelés közben a jelszó nem jelenik meg.
ko: 열쇠글을 입력할 때 입력한 글자는 보이지 않습니다.

source: Please enter the same root password again to verify that you have typed it correctly.
da: Angiv den samme root-adgangskode igen for at tjekke at du har indtastet den korrekt.
de: Bitte geben Sie dasselbe root Passwort nochmals ein, um sicher zu gehen, dass Sie es richtig eingegeben haben.
hu: A 'root' felhasználó jelszavának ellenőrzése céljából ismét írja be azt.
ko: 제대로 입력했는지 확인하기 위해 루트 열쇠글을 한번 더 입력하십시오.

source: Create a normal user account now?
da: Opret en almindelig brugerkonto nu?
de: Soll jetzt ein normales Benutzer-Konto erstellt werden?
hu: Létrehoz most egy átlagos jogkörrel bíró felhasználót?
ko: 일반 사용자 계정을 지금 만들까요?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
da: Det er en dårlig idé, at bruge root-kontoen til almindelige dagligdags gøremål, som f.eks. at læse e-post, da selv en lille fejltagelse kan få katastrofale følger. Du kan nu oprette en normal brugerkonto, som kan benyttes til disse almindelige arbejdsopgaver.
de: Es ist keine gute Idee, das root-Konto für die alltägliche Arbeit einzusetzen, wie z.B. lesen der E-Mails, denn selbst ein kleiner Fehler kann in einer Katastrophe enden. Sie sollten nun ein normales Benutzer-Konto erstellen.
hu: A 'root' fiókot nem szabad elektronikus levelezés és egyéb mindennapos tevékenységek elvégzésére rendszeresíteni, hiszen akár a legkisebb tévedés is katasztrófába torkollhat. E mindennapos tevékenységekre egy átlagos jogkörrel bíró felhasználót kell létrehozni.
ko: 자주 하는 일반적인 (예를 들어 전자메일 읽기) 컴퓨터 작업에서는 루트 계정을 쓰지 않는 게 좋습니다. 루트 계정에서는 아주 작은 실수때문에 큰 피해를 입을 수도 있기 때문입니다. 일반적인 작업에 사용할 일반 사용자 계정을 지금 만들 수 있습니다.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
da: Bemærk at du også kan oprette den senere (eller oprette flere konti) ved at skrive 'adduser <brugernavn>' som root, hvor <brugernavn> er et brugernavn, som f.eks. 'hansen' eller 'rms'.
de: Beachten Sie, dass Sie das Benutzerkonto auch später erstellen können (genauso wie weitere Benutzerkonten) durch Eingabe von »adduser <Benutzername>« als root, wobei <Benutzername> ein Benutzername ist, wie z.B. »imurdock« oder »rms«.
hu: Erre (és további felhasználók létrehozására) persze később is sort keríthet, mindössze az 'adduser <felhasználónév>' parancsot kell 'root' felhasználóként kiadnia (ahol a <felhasználónév> a felhasználó neve, mint pl. 'imurdock' vagy 'rms').
ko: 나중에 루트 사용자로 'adduser <사용자이름>'을 실행해서 계정을 만들 수도 있습니다. 여기서 <사용자이름>은 'imurdock'이나 'rms'같은 사용자 이름입니다.

source: Enter a username for your account:
da: Angiv et brugernavn til din konto:
de: Geben Sie den Benutzernamen für Ihr Konto ein:
hu: A felhasználó neve:
ko: 계정의 사용자 이름을 입력하십시오:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
da: Vælg et brugernavn til den nye konto. Dit fornavn kan være et fornuftigt valg. Brugernavnet skal starte med et lille bogstav efterfulgt af en kombination af numre og små bogstaver.
de: Wählen Sie einen Benutzernamen für das neue Benutzerkonto. Der Vorname ist meist eine gute Wahl. Der Benutzername sollte mit einem kleinen Buchstaben beginnen, gefolgt von weiteren kleinen Buchstaben oder auch Zahlen.
hu: Adja meg az új felhasználói fiókhoz rendelt nevet. A keresztnév általában meg szokott felelni a célra. A lényeg, hogy a felhasználónév kisbetűvel kezdődjön, aztán számok és további kisbetűk tetszőleges kombinációja állhat.
ko: 새 계정에 쓸 사용자 이름을 지정하십시오. 이름을 쓰는 것도 좋은 방법입니다. 사용자 이름은 영문 소문자로 시작해야 하고, 그 뒤에는 숫자나 영문 소문자를 몇 개든지 쓸 수 있습니다.

source: Invalid username entered.
da: Ugyldigt brugernavn indtastet.
de: Sie haben einen ungültigen Benutzernamen eingegeben.
hu: A megadott felhasználónév érvénytelen.
ko: 잘못된 사용자 이름을 입력했습니다.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
da: Brugernavnet du angav, er ugyldigt. Bemærk at brugernavne skal starte med et lille bogstav efterfulgt af en kombination af numre og flere små bogstaver.
de: Der Benutzername, den Sie eingegeben haben, ist ungültig. Hinweis: Der Benutzername sollte mit einem kleinen Buchstaben beginnen, welcher von einer Kombination aus Zahlen oder weiteren klein geschriebenen Buchstaben ergänzt werden kann.
hu: A megadott felhasználónév nem érvényes. A felhasználónévnek kisbetűvel kell kezdődnie, aztán számok és további kisbetűk tetszőleges kombinációja állhat.
ko: 입력한 사용자 이름이 잘못되었습니다. 사용자 이름은 영문 소문자로 시작해야 하고, 그 뒤에는 숫자나 영문 소문자를 쓸 수 있습니다.

source: Enter a full name for the new user:
da: Indtast den nye brugers fulde navn:
de: Geben Sie den vollen Namen für den neuen Benutzer ein:
hu: Adja meg az új felhasználó teljes nevét:
ko: 새로 만들 사용자의 전체 이름을 입력하십시오:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
da: Der vil blive oprettet en brugerkonto, som du kan bruge i stedet for root-kontoen til ikke-administrative aktiviteter.
de: Für Sie wird ein Konto angelegt, das Sie statt dem Root-Konto für die alltägliche Arbeit verwenden können.
hu: Hogy a 'root' fiókot ne kelljen szüntelenül igénybevennie, az adminisztratív feladatokon kívül minden egyébre rendszeresítse a most létrehozandó felhasználói fiókot.
ko: 관리와 관계없는 활동에 루트 계정 대신 사용할 사용자 계정을 만듭니다. 새로 만들 계정의 사용자 이름을 입력하십시오

source: Enter a password for the new user:
da: Indtast en adgangskode til den nye bruger:
de: Geben Sie bitte das Passwort für den neuen Benutzer ein:
hu: Adja meg az új felhasználó jelszavát:
ko: 새로 만들 사용자의 열쇠글을 입력하십시오:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
da: En god adgangskode indeholder en blanding af bogstaver, tal og tegnsætning og ændres fra tid til anden.
de: Ein gutes Passwort enthält eine Mixtur aus Buchstaben, Zahlen und Sonderzeichen und wird in regelmäßigen Abständen geändert.
hu: Az igazán jó jelszavak betűk, számok és írásjelek keverékéből állnak, emellett rendszeres cserén esnek át.
ko: 좋은 열쇠글은 글자, 숫자, 기호를 섞어서 만들고 정기적으로 바꾸는 게 좋습니다.

source: Re-enter password to verify:
da: Angiv adgangskoden igen for at tjekke:
de: Bitte geben Sie das Passwort nochmals zur Bestätigung ein:
hu: A jelszó ellenőrző ismétlése:
ko: 확인을 위해 열쇠글을 다시 입력하십시오:

source: Please enter the same user password again to verify you have typed it correctly.
da: Angiv den samme brugeradgangskode igen for at tjekk at du har indtastet den korrekt.
de: Bitte geben Sie das gleiche Benutzer-Passwort nochmals ein, um zu prüfen, dass Sie sich nicht vertippt haben.
hu: A jelszó ellenőrzése céljából ismét írja be azt.
ko: 제대로 입력했는지 확인하기 위해 사용자 열쇠글을 다시 한번 입력하십시오.

source: Password input error.
da: Adgangskode-indtastningsfejl.
de: Passwort-Fehler.
hu: Jelszóbeviteli hiba.
ko: 열쇠글 입력 오류.

source: The two passwords you entered were not the same. Please try again.
da: De to adgangskoder du indtastede var ikke ens. Prøv igen.
de: Die beiden Passwörter, die Sie eingegeben haben, sind nicht gleich. Bitte versuchen Sie es nocheinmal.
hu: A két megadott jelszó nem egyezik. Adja meg ismét a jelszót.
ko: 입력한 두 열쇠글이 같지 않습니다. 다시 입력하십시오.

source: Empty password was entered.
da: Der blev indtastet en tom adgangskode.
de: Leeres Passwort wurde eingegeben.
hu: A megadott jelszó üres.
ko: 빈 열쇠글을 입력했습니다.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
da: Det ser ud til at du intet har indtastet som adgangskode. Dette giver dårlig sikkerhed! Prøv igen.
de: Sie haben anscheinend keine Eingaben für das Passwort gemacht. Das ist sehr unsicher! Bitte versuchen Sie es nocheinmal.
hu: Üres jelszót adott meg. Ez nem biztonságos! Adja meg ismét a jelszót.
ko: 열쇠글로 아무것도 입력하지 않았습니다. 이러면 보안에 문제가 있습니다! 다시 입력하십시오.

source: Enable shadow passwords?
da: Aktivér skyggeadgangskoder?
de: Shadow Passwörter benutzen?
hu: A jelszavak legyenek "árnyékolva"?
ko: 셰도우 열쇠글을 사용하시겠습니까?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
da: Skyggeadgangskoder gør dit system mere sikkert, fordi de forhindrer at nogen ser de krypterede adgangskoder. Adgangskoderne gemmes i en separat fil, som kun kan læses af særlige programmer. Vi anbefaler kraftigt brugen af skyggeadgangskoder. Hvis du skal bruge NIS, kan de dog give problemer.
de: Shadow Passwörter machen Ihr System sicherer, weil niemand die verschlüsselten Passwörter auslesen kann. Passwörter werden in einer separaten Datei gespeichert, welche nur von speziellen Programmen gelesen werden kann. Shadow Passwörter sind ausdrücklich empfohlen. Wenn Sie jedoch NIS einsetzen möchten, könnten Sie damit Probleme bekommen.
hu: Az "árnyékolt" jelszavak (shadow passwords) növelik a rendszer biztonságát, mivel még a jelszavak rejtjelzett alakját sem teszik senki számára elérhetővé. A jelszavakat egy külön fájl tartalmazza, melyhez csak különleges (biztonságilag alaposan bevizsgált) programok férhetnek hozzá. Az "árnyékolt" jelszavak használata nagyon ajánlott. Ha viszont rendszerében NIS-t használ, akkor lehetnek vele gondok.
ko: 셰도우 열쇠글을 쓰면 암호화한 열쇠글조차 아무도 보지 못하기 때문에 시스템의 보안이 더 좋아집니다. 열쇠글은 별도 파일에 저장하게 되고 특별한 몇몇 프로그램만 읽을 수 있습니다. 셰도우 열쇠글을 사용하길 강력히 권합니다. 하지만, NIS를 사용할 예정이라면 셰도우 열쇠글때문에 문제가 생길 수 있습니다.

source: Enable md5 passwords?
da: Aktivér md5-adgangskoder?
de: md5-Passwörter benutzen?
hu: A jelszavakat MD5-tel rejtjelzi?
ko: MD5 열쇠글을 사용하시겠습니까?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
da: Md5-adgangskoder er mere sikre og tillader adgangskoder, der er længere end 8 tegn. Dog kan det skabe problemer hvis du bruger NIS eller deler adgangskoder med ældre systemer.
de: Md5 Passwörter sind sicherer und erlauben mehr als 8 Zeichen. Es kann jedoch zu Kompatibilitätsproblemen kommen, wenn Sie NIS benutzen oder die Passwort Dateien mit älteren Systemen teilen.
hu: Az MD5-tel rejtjelzett jelszavak növelik a rendszer biztonságát, és 8 karakternél hosszabb jelszavakat is lehetővé tesznek. Ha viszont rendszerében NIS-t használ vagy régebbi rendszerek jelszófájljain osztozik, akkor lehetnek vele kompatibilitási gondok.
ko: MD5 열쇠글은 보안이 더 뛰어나고, 8자보다 긴 열쇠글을 사용할 수 있습니다. 하지만 기존 시스템과 NIS를 통해 열쇠글을 공유하는 경우에 호환성 문제가 발생할 수 있습니다.
