Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: By default, B<pwck> operates on the files I</etc/passwd> and I</etc/shadow>. The user may select alternate files with the I<passwd> and I<shadow> parameters. Additionally, the user may execute the command in read-only mode by specifying the B<-r> flag. This causes all questions regarding changes to be answered B<no> without user intervention. B<pwck> can also sort entries in I</etc/passwd> and I</etc/shadow> by UID. To run it in sort mode pass it B<-s> flag. No checks are performed then, it just sorts.
fr: Par défaut, B<pwck> opère sur les fichiers I</etc/passwd> et I</etc/shadow>. L'utilisateur peut spécifier d'autres fichiers avec les paramètres I<passwd> et I<shadow>. De plus, l'utilisateur peut exécuter les commandes en lecture seule en utilisant l'option B<-r>. Ceci aura pour conséquence de répondre B<no> à toutes les questions demandant des modifications, sans intervention de l'utilisateur. B<Pwck> permet aussi de trier les entrées de I</etc/passwd> et I</etc/shadow> par UID. Pour effectuer ce tri, utilisez l'option B<-s>. Aucune vérification n'est alors effectuée, les entrées sont seulement triées.

source: /etc/passwd - user account information
fr: /etc/passwd - informations sur les comptes des utilisateurs

source: /etc/shadow - encrypted password information
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: /etc/group - group information
fr: /etc/group - informations sur les groupes

source: The B<pwck> command exits with the following values:
fr: La commande B<pwck> retourne les valeurs suivantes en quittant\ :

source: Success
fr: Succès

source: Syntax Error
fr: Erreur de syntaxe

source: One or more bad password entries
fr: Une entrée de mot de passe ou plus est incorrecte

source: Cannot open password files
fr: Impossible d'ouvrir le fichier de mots de passe

source: Cannot lock password files
fr: Impossible de verrouiller le fichier de mots de passe

source: Cannot update password files
fr: Impossible de mettre à jour le fichier de mots de passe

source: shadow - encrypted password file
fr: shadow - mots de passe cachés des utilisateurs

source: I<shadow> contains the encrypted password information for user's accounts and optional the password aging information. Included is
fr: Le fichier I</etc/shadow> contient les informations cachées concernant les mots de passe des utilisateurs et leurs dates de validité. Ces informations comprennent\ :

source: Login name
fr: Nom de connexion de l'utilisateur («\ login\ »)

source: Encrypted password
fr: Mot de passe chiffré

source: Days since Jan 1, 1970 that password was last changed
fr: Nombre de jours écoulés depuis le 1er janvier 1970 jusqu'au dernier changement de mot de passe

source: Days before password may be changed
fr: Nombre de jours à attendre avant de pouvoir changer le mot de passe

source: Days after which password must be changed
fr: Nombre de jours après lesquels le mot de passe doit être changé

source: Days before password is to expire that user is warned
fr: Nombre de jours avant la fin de validité du mot de passe impliquant l'avertissement de l'utilisateur

source: Days after password expires that account is disabled
fr: Nombre de jours après la fin de validité provoquant la désactivation du compte

source: Days since Jan 1, 1970 that account is disabled
fr: Numéro du jour depuis le 1er janvier 1970 à partir duquel le compte est désactivé

source: A reserved field
fr: Champ réservé

source: The date of the last password change is given as the number of days since Jan 1, 1970. The password may not be changed again until the proper number of days have passed, and must be changed after the maximum number of days. If the minimum number of days required is greater than the maximum number of day allowed, this password may not be changed by the user.
fr: La date de dernière modification du mot de passe est donné par le nombre de jours écoulés depuis le 1er janvier 1970 jusqu'au dernier changement du mot de passe. Un mot de passe ne peut pas être changé de nouveau avant le nombre de jours indiqués, et doit être modifié avant le nombre maximal de jours spécifié. Si le nombre minimal de jours requis est plus grand que le nombre maximal de jours de validité, ce mot de passe ne peut pas être changé par l'utilisateur.

source: An account is considered to be inactive and is disabled if the password is not changed within the specified number of days after the password expires. An account will also be disabled on the specified day regardless of other password expiration information.
fr: Un compte est considéré comme inactif et est désactivé si le mot de passe n'est pas changé dans l'intervalle spécifié après la fin de la validité du mot de passe. Un compte est également désactivé le jour indiqué quel que soit les autres informations de validité.

source: This information supercedes any password or password age information present in I</etc/passwd>.
fr: Ces informations sont prioritaires sur tous les autres champs présents dans I</etc/passwd>.

source: This file must not be readable by regular users if password security is to be maintained.
fr: Ce fichier ne doit pas être accessible en lecture par les utilisateurs normaux afin de maintenir la sécurité des mots de passe, en particuliers pour prévenir les attaques par dictionnaires.

source: login.access - Login access control table
fr: login.access - table de contrôle des connexions

source: The I<login.access> file specifies (user, host) combinations and/or (user, tty) combinations for which a login will be either accepted or refused.
fr: Le fichier I<login.access> permet de spécifier des couples (utilisateur, hôte) et/ou (utilisateur, tty) pour lesquels toute connexion sera soit acceptée soit refusée.

source: When someone logs in, the I<login.access> is scanned for the first entry that matches the (user, host) combination, or, in case of non-networked logins, the first entry that matches the (user, tty) combination. The permissions field of that table entry determines whether the login will be accepted or refused.
fr: Lorsqu'un utilisateur se connecte, le fichier I<login.access> est lu jusqu'à la première entrée correspondant au couple (utilisateur, hôte) ou, dans le cas d'une connexion ne passant pas par le réseau, à la première entrée correspondant au couple (utilisateur, tty). Le champ des permissions de la table pour cette entrée détermine alors si la connexion doit être acceptée ou refusée.

source: Each line of the login access control table has three fields separated by a ":" character:
fr: Chaque ligne de la table de contrôle des connexions («\ login access control table\ ») est composée de trois champs séparés par le caractère «\ :\ »\ :

source: I< permission>:I<users>:I<origins>
fr: I< permission>:I<utilisateurs>:I<origines>

source: The first field should be a "B<+>" (access granted) or "B<->" (access denied) character. The second field should be a list of one or more login names, group names, or B<ALL> (always matches). The third field should be a list of one or more tty names (for non-networked logins), host names, domain names (begin with "B<.>"), host addresses, internet network numbers (end with "B<.>"), B<ALL> (always matches) or B<LOCAL> (matches any string that does not contain a "B<.>" character). If you run NIS you can use @netgroupname in host or user patterns.
fr: Le premier champ est soit un «\ B<+>\ » (accès autorisé), soit un «\ B<->\ » (accès refusé). Le second champ est une liste d'un ou plusieurs noms d'utilisateurs ou de groupes, ou B<ALL> (correspond à tous les utilisateurs). Le troisième champ est une liste d'un ou plusieurs noms de tty (pour les connexions hors réseau), noms d'hôtes, noms de domaines (commençant par un «\ B<.>\ »), adresses d'hôte, adresses de sous-réseau (terminant par un «\ B<.>\ »), B<ALL> (pour spécifier n'importe quelle connexion), ou B<LOCAL> (correspond à n'importe quelle chaîne ne contenant pas de «\ B<.>\ »). Si vous utilisez NIS, vous pouvez utiliser @nomdegroupe pour les motifs d'utilisateur et d'hôte.

source: The B<EXCEPT> operator makes it possible to write very compact rules.
fr: L'opérateur B<EXCEPT> permet d'écrire des règles très compactes.

source: The group file is searched only when a name does not match that of the logged-in user. Only groups are matched in which users are explicitly listed: the program does not look at a user's primary group id value.
fr: Le fichier d'informations sur les groupes (group) n'est utilisé que lorsqu'un nom ne correspond à aucun utilisateur connecté. Seuls les groupes pour lesquels la liste des utilisateurs est spécifiée sont utilisés\ : le programme ne recherche pas parmi les groupes primaires des utilisateurs.

source: lastlog - examine lastlog file
fr: lastlog - examine le fichier lastlog

source: B<lastlog> [E<lt>B<-u>|B<--user>E<gt> I<login-name>]
fr: B<lastlog> [E<lt>B<-u>|B<--user>E<gt> I<identifiant>]

source: [E<lt>B<-t>|B<--time>E<gt> I<days>] [E<lt>B<-h>|B<--help>E<gt>]
fr: [E<lt>B<-t>|B<--time>E<gt> I<jours>] [E<lt>B<-h>|B<--help>E<gt>]

source: B<lastlog> formats and prints the contents of the last login log I</var/log/lastlog> file. The B<login-name>, B<port>, and B<last login time> will be printed. The default (no flags) causes lastlog entries to be printed, sorted by their order in /etc/passwd.
fr: B<Lastlog> affiche le contenu du journal des dernières connexions (I</var/log/lastlog>). Les champs B<Utilisateur>, B<Port>, date de B<Dernière> connexion sont affichés. Par défaut (aucune option de spécifiée), les entrées de laslog sont affichées triées par ordre d'apparition dans /etc/passwd.

source: B<-u>, B<--user> I<login-name>
fr: B<-u>, B<--user> I<identifiant>

source: will cause the lastlog record for I<login-name> only to be printed
fr: n'affiche que les entrées correspondant à l'utilisateur I<identifiant>.

source: B<-t>, B<--time> I<days>
fr: B<-t>, B<--time> I<jours>

source: will cause only the lastlogins more recent than fIdays to be printed
fr: n'affiche que les entrées plus récentes que I<jours> jours.

source: print a one-line help message and exit.
fr: affiche une ligne d'aide et quitte.

source: The B<-t> flag overrides the use of B<-u>.
fr: L'utilisation de l'option B<-t> supplante celle de B<-u>.

source: If the user has never logged in the message B<"**Never logged in**"> will be displayed instead of the port and time.
fr: Dans le cas où l'utilisateur ne s'est jamais connecté, le message «\ B<**Never logged in**>\ » («\ B<**Jamais connecté**>\ ») est affiché à la place des champs B<Port> et date de B<Dernière> connexion.

source: /var/log/lastlog - lastlog logging file
fr: /var/log/lastlog - journal des dernières connexions

source: Large gaps in uid numbers will cause the lastlog program to run longer with no output to the screen (i.e. if mmdf=800 and last uid=170, program will appear to hang as it processes uid 171-799).
fr: S'il y a des écarts importants dans les valeurs des UID, lastlog s'exécutera plus longtemps, sans affichage à l'écran (c-à-d si mmdf=800 et que le dernier UID est 170, le programme semblera bloqué comme s'il examinait les UID 171 à 799).

source: AUTHORS
fr: AUTEURS

source: /etc/login.defs - shadow password suite configuration
fr: /etc/login.defs - configuration de la suite des mots de passe cachés «\ shadow password\ »

source: The I</etc/login.defs> file defines the site-specific configuration for the shadow password suite. This file is required. Absence of this file will not prevent system operation, but will probably result in undesirable operation.
fr: Le fichier I</etc/login.defs> défini la configuration de la suite shadow password (mots de passe cachés) pour le système. Ce fichier est indispensable. Son absence n'empêchera pas le système de fonctionner, mais aura probablement des conséquences indésirables.

source: This file is a readable text file, each line of the file describing one configuration parameter. The lines consist of a configuration name and value, separated by whitespace. Blank lines and comment lines are ignored. Comments are introduced with a `#' pound sign and the pound sign must be the first non-white character of the line.
fr: Ce fichier est un fichier texte, dont chaque ligne décrit un paramètre de configuration. Les lignes consistent en un nom et une valeur, séparés par un espace. Les lignes blanches et les lignes de commentaires sont ignorées. Les commentaires commencent par un caractère «\ #\ », qui ne doit être précédé que par des espaces.

source: Parameter values may be of four types: strings, booleans, numbers, and long numbers. A string is comprised of any printable characters. A boolean should be either the value ``yes'' or ``no''. An undefined boolean parameter or one with a value other than these will be given a ``no'' value. Numbers (both regular and long) may be either decimal values, octal values (precede the value with ``0'') or hexadecimal values (precede the value with ``0x''). The maximum value of the regular and long numeric parameters is machine-dependent.
fr: Les valeurs des paramètres sont de quatre types\ : chaînes de caractères, booléens, nombres et nombres longs. Une chaîne de caractères est constituée de n'importe quel caractère imprimable. Un booléen est soit «\ yes\ » (oui) soit «\ no\ » (non). Un paramètre booléen non défini, ou défini avec une valeur autre prendra la valeur «\ no\ ». Un nombre (normal ou long) peut être soit décimal, soit octal (en précédant la valeur d'un «\ 0\ »), ou encore hexadécimal (en précédant la valeur de «\ 0x\ »). La valeur maximale des paramètres numériques normaux ou longs dépend de la machine.

source: The following configuration items are provided:
fr: Les paramètres de configuration suivants sont fournis\ :

source: CHFN_AUTH (boolean)
fr: CHFN_AUTH (booléen)

source: If I<yes>, the B<chfn> and B<chsh> programs will require authentication before making any changes, unless run by the superuser.
fr: La valeur I<yes> indique que les programmes B<chfn> et B<chsh> nécessiteront une authentification avant de procéder à tout changement, à moins qu'ils ne soient exécutés par le superutilisateur.

source: CHFN_RESTRICT (string)
fr: CHFN_RESTRICT (chaîne)

source: This parameter specifies which values in the I<gecos> field of the I<passwd> file may be changed by regular users using the B<chfn> program. It can be any combination of letters I<f>, I<r>, I<w>, I<h>, for Full name, Room number, Work phone, and Home phone, respectively. For backward compatibility, "yes" is equivalent to "rwh" and "no" is equivalent to "frwh". If not specified, only the superuser can make any changes. The most restrictive setting is better achieved by not installing chfn SUID.
fr: Ce paramètre spécifie quelles valeurs du champ I<gecos> du fichier I<passwd> peuvent être modifiées par les utilisateurs ordinaires avec le programme B<chfn>. Il est constitué d'une combinaison de lettre parmi I<f>, I<r>, I<w> et I<h>, correspondant respectivement au nom complet, au numéro de bureau, au numéro de téléphone professionnel et au numéro de téléphone personnel. Pour des raisons de compatibilité avec des versions antérieures, «\ yes\ » est équivalent à «\ rwh\ » et «\ no\ », à «\ frwh\ ». S'il n'est pas spécifié, seul le superutilisateur peut réaliser une modification. Pour une configuration encore plus restrictive, il sera préférable de ne pas installer B<chfn> avec le drapeau SUID.

source: CREATE_HOME (boolean)
fr: CREATE_HOME (booléen)

source: This defines whether useradd should create home directories for users by default. This option is OR'ed with the -m flag on useradd command line.
fr: Ce paramètre indique si B<useradd> doit par défaut créer le répertoire personnel des utilisateurs. Un OU est réalisé avec l'option -m de la ligne de commande de B<useradd>.

source: GID_MAX (number)
fr: GID_MAX (nombre)

source: GID_MIN (number)
fr: GID_MIN (nombre)

source: Range of group IDs to choose from for the B<useradd> and B<groupadd> programs.
fr: Domaine des identifiants de groupe que les commandes B<useradd> et B<groupadd> peuvent utiliser.

source: MAIL_DIR (string)
fr: MAIL_DIR (chaîne)

source: The mail spool directory. This is needed to manipulate the mailbox when its corresponding user account is modified or deleted. If not specified, a compile-time default is used.
fr: Le répertoire d'attente des courriels («\ mail spool directory\ »). Ce paramètre est nécessaire pour manipuler les boîtes aux lettres lorsque le compte d'un utilisateur est modifié ou supprimé. S'il n'est pas spécifié, une valeur par défaut définie à la compilation est utilisée.

source: PASS_MAX_DAYS (number)
fr: PASS_MAX_DAYS (nombre)

source: The maximum number of days a password may be used. If the password is older than this, a password change will be forced. If not specified, -1 will be assumed (which disables the restriction).
fr: Le nombre de jours maximal de validité d'un mot de passe. Après cette durée, une modification du mot de passe est obligatoire. S'il n'est pas précisé, la valeur de -1 est utilisée (ce qui enlève toute restriction).

source: PASS_MIN_DAYS (number)
fr: PASS_MIN_DAYS (nombre)

source: The minimum number of days allowed between password changes. Any password changes attempted sooner than this will be rejected. If not specified, -1 will be assumed (which disables the restriction).
fr: Le nombre de jours minimal autorisé avant la modification d'un mot de passe. Toute tentative de modification du mot de passe avant cette durée est rejetée. S'il n'est pas précisé, la valeur de -1 est utilisée (ce qui enlève toute restriction).

source: PASS_WARN_AGE (number)
fr: PASS_WARN_AGE (nombre)

source: The number of days warning given before a password expires. A zero means warning is given only upon the day of expiration, a negative value means no warning is given. If not specified, no warning will be provided.
fr: Le nombre de jours durant lesquels l'utilisateur recevra un avertissement avant que son mot de passe arrive en fin de validité. Une valeur négative signifie qu'aucun avertissement n'est donné. S'il n'est pas précisé, aucun avertissement n'est donné.

source: PASS_MAX_DAYS, PASS_MIN_DAYS and PASS_WARN_AGE are only used at the time of account creation. Any changes to these settings won't affect existing accounts.
fr: Les paramètres PASS_MAX_DAYS, PASS_MIN_DAYS et PASS_WARN_AGE ne sont utilisés qu'au moment de la création d'un compte. Les changements n'affecteront pas les comptes existants.

source: UID_MAX (number)
fr: UID_MAX (nombre)

source: UID_MIN (number)
fr: UID_MIN (nombre)

source: Range of user IDs to choose from for the B<useradd> program.
fr: Domaine d'identifiant utilisateur que B<useradd> peut utiliser.

source: UMASK (number)
fr: UMASK (nombre)

source: The permission mask is initialized to this value. If not specified, the permission mask will be initialized to 077.
fr: Valeur d'initialisation du masque de permissions. S'il n'est pas précisé, le masque est initialisé à 077.

source: USERDEL_CMD (string)
fr: USERDEL_CMD (chaîne)

source: If defined, this command is run when removing a user. It should remove any at/cron/print jobs etc. owned by the user to be removed (passed as the first argument).
fr: Si ce paramètre est défini, cette commande est exécutée lors de la suppression d'un utilisateur. Elle pourra supprimer toutes les tâches périodiques cron ou at, tous les travaux d'impression, etc. de l'utilisateur (qui sera fourni comme premier argument).

source: CROSS REFERENCE
fr: RÉFÉRENCES CROISÉES

source: The following cross reference shows which programs in the shadow password suite use which parameters.
fr: Les références croisées ci-dessous montrent quels sont les paramètres utilisés par les différents programmes de la suite shadow password.

source: Much of the functionality that used to be provided by the shadow password suite is now handled by PAM. Thus, I</etc/login.defs> is no longer used by programs such as B<login>(1), B<passwd>(1) and B<su>(1). Please refer to the corresponding PAM configuration files instead.
fr: La plupart des fonctionnalités qui étaient fournies par les mots de passe cachés («\ shadow password\ ») sont désormais gérées par PAM. De ce fait, I</etc/login.defs> n'est plus utilisé par les programmes tels que B<login>(1), B<passwd>(1) et B<su>(1). Veuillez plutôt vous référer aux fichiers de configuration de PAM correspondant.

source: Chip Rosenthal (chip@unicom.com)
fr: Chip Rosenthal E<lt>chip@unicom.comE<gt>

source: mkpasswd - Update passwd and group database files
fr: mkpasswd - met à jour les bases de données des mots de passe et des groupes

source: B<mkpasswd> [B<-fvgps>] I<file>
fr: B<mkpasswd> [B<-fvgps>] I<fichier>

source: B<mkpasswd> reads the file in the format given by the flags and converts it to the corresponding database file format. These database files are used to improve access performance on systems with large numbers of users. The output files will be named I<file>.dir and I<file>.pag.
fr: B<Mkpasswd> lit le fichier dans le format indiqué par les options, et le convertit au format de la base de données corespondante. Ces fichiers de bases de données permettent d'améliorer les performances d'accès aux systèmes avec un grand nombre d'utilisateurs. Les fichiers de sortie seront nommés I<file>.dir et I<file>.pag.

source: The B<-f> option causes B<mkpasswd> to ignore any existing output files and overwrite them. Normally B<mkpasswd> complains about existing output files and quits.
fr: Avec l'option B<-f>, B<mkpasswd> ignore et écrase le fichier de sortie s'ils existent. Sinon, B<mkpasswd> avertit que les fichiers de sortie existent et quitte.

source: The B<-v> option causes B<mkpasswd> to output information about each record as it is converted, with a final message at the very end.
fr: Avec l'option B<-v>, B<mkpasswd> affiche des informations pour chaque entrée convertie, ainsi qu'un message final.

source: The B<-g> option treats the input file as though it were in I</etc/group> file format. When combined with the B<-s> option, the I</etc/gshadow> file format is used instead.
fr: L'option B<-g> permet de traiter le fichier d'entrée comme s'il s'agissait du fichier I</etc/group>. Lorsqu'elle est combinée avec l'option B<-s>, le format du fichier I</etc/gshadow> est utilisé.

source: The B<-p> option treats the input file as though it were in I</etc/passwd> file format. This is the default. When combined with the B<-s> option, the I</etc/shadow> file format is used instead.
fr: L'option B<-p> permet de traiter le fichier d'entrée comme s'il s'agissait du fichier I</etc/passwd>. Lorsqu'elle est combinée avec l'option B<-s>, le format du fichier I</etc/shadow> est utilisé.

source: The use of more than one database file is limited to systems which include the NDBM database library and therefore may not be available on every system.
fr: L'utilisation de plus d'un fichier de base de données n'est permise que sur les systèmes qui incluent la bibliothèque de base de données NDBM, ce qui n'est pas le cas de tous les sytèmes.

source: Since most commands are capable of updating the database files as changes are made, this command need only be used when re-creating a deleted or corrupted database file.
fr: Comme la plupart des commandes sont capables de mettre à jour les fichiers de base de données lors des modifications, cette commande n'est nécessaire que pour recréer un fichier de base de donnée détruit ou corrompu.

source: /etc/shadow - shadow user information
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: /etc/gshadow - shadow group information
fr: /etc/gshadow - informations cachées sur les groupes

source: 19 Apr 1997
fr: 19 avril 1997

source: shadowconfig - toggle shadow passwords on and off
fr: shadowconfig - active ou désactive les mots de passe cachés
