Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: [B<-E >I<expiredate>] [B<-W >I<warndays>] I<user>
fr: [B<-E> I<date_fin_valid>] [B<-W> I<jours_avert>] I<utilisateur>

source: B<-l >I<user>
fr: B<-l> I<utilisateur>

source: B<chage> changes the number of days between password changes and the date of the last password change. This information is used by the system to determine when a user must change her password. The B<chage> command is restricted to the root user, except for the B<-l> option, which may be used by an unprivileged user to determine when her password or account is due to expire.
fr: B<Chage> modifie le nombre de jours entre les changements de mot de passe et la date du dernier changement. Ces informations sont utilisées par le système pour déterminer si un utilisateur doit changer son mot de passe. La commande B<chage> est réservée à l'utilisateur root, sauf pour l'option B<-l>, qui peut être utilisée par un utilisateur non privilégié pour savoir quand son mot de passe ou son compte arrivera en fin de validité.

source: With the B<-m> option, the value of I<mindays> is the minimum number of days between password changes. A value of zero for this field indicates that the user may change her password at any time.
fr: Avec l'option B<-m>, la valeur de I<jours_min> représente le nombre minimum de jours entre chaque changement de mot de passe. Une valeur de zéro pour ce champ indique que l'utilisateur peut changer son mot de passe n'importe quand.

source: With the B<-M> option, the value of I<maxdays> is the maximum number of days during which a password is valid. When I<maxdays> plus I<lastday> is less than the current day, the user will be required to change her password before being able to use her account. This occurrence can be planned for in advance by use of the B<-W> option, which provides the user with advance warning.
fr: Avec l'option B<-M>, la valeur de I<jours_max> représente le nombre maximum de jours pendant lesquels un mot de passe est valable. Quand I<max_jours> plus I<dernier_jour> est inférieur à la date courante, l'utilisateur est obligé de changer son mot de passe avant de pouvoir utiliser son compte. Cet événement peut être déclenché plus tôt grâce à l'option B<-W> qui prévient l'utilisateur à l'avance avec un message d'alerte.

source: With the B<-d> option, the value of I<lastday> is the number of days since January 1st, 1970 when the password was last changed. The date may also be expressed in the format YYYY-MM-DD (or the format more commonly used in your area).
fr: Avec l'option B<-d>, la valeur I<dernier_jour> est le numéro du jour depuis le 1er janvier 1970, où le mot de passe a été changé la dernière fois. La date peut aussi être exprimée dans le format YYYY-MM-DD (ou le format utilisé plus communément dans votre région).

source: The B<-E> option is used to set a date on which the user's account will no longer be accessible. The I<expiredate> option is the number of days since January 1, 1970 on which the accounted is locked. The date may also be expressed in the format YYYY-MM-DD (or the format more commonly used in your area). A user whose account is locked must contact the system administrator before being able to use the system again.
fr: L'option B<-E> est utilisée pour définir une date à partir de laquelle le compte de l'utilisateur ne sera plus accessible. La valeur I<date_fin_valid> est le numéro du jour depuis le 1er janvier 1970 après lequel le compte sera bloqué. La date peut aussi être exprimée dans un format YYYY-MM-DD (ou le format plus communément utilisé dans votre région). Un utilisateur dont le compte est bloqué doit contacter l'administrateur système pour pouvoir utiliser le système à nouveau.

source: The B<-I> option is used to set the number of days of inactivity after a password has expired before the account is locked. The I<inactive> option is the number of days of inactivity. A value of 0 disables this feature. A user whose account is locked must contact the system administrator before being able to use the system again.
fr: L'option B<-I> est utilisée pour définir le nombre de jours d'inactivité, après qu'un mot de passe ait dépassé la date de fin de validité, avant que le compte ne soit bloqué. La valeur I<durée_inact> est le nombre de jours d'inactivité. Une valeur de 0 désactive cette fonctionnalité. Un utilisateur dont le compte est bloqué doit contacter l'administrateur système avant de pouvoir utiliser le système à nouveau.

source: The B<-W> option is used to set the number of days of warning before a password change is required. The I<warndays> option is the number of days prior to the password expiring that a user will be warned her password is about to expire.
fr: L'option B<-W> est utilisée pour définir le nombre de jours d'avertissement avant que le changement de mot de passe ne soit obligatoire. La valeur I<durée_avert> est le nombre de jours précédant la fin de validité pendant lesquels un utilisateur sera prévenu que son mot de passe est sur le point d'arriver en fin de validité.

source: If none of the options are selected, B<chage> operates in an interactive fashion, prompting the user with the current values for all of the fields. Enter the new value to change the field, or leave the line blank to use the current value. The current value is displayed between a pair of B<[ ]> marks.
fr: Si aucune de ces options n'est donnée, B<chage> utilise un mode interactif, demandant confirmation à l'utilisateur pour les valeurs de tous les champs. Entrez la nouvelle valeur pour changer la valeur du champ, ou laissez la ligne vide pour conserver la valeur actuelle. La valeur actuelle est affichée entre crochets.

source: The B<chage> program requires shadow password file to be available. Its functionality is not available when passwords are stored in the passwd file.
fr: Le programme B<chage> nécessite l'utilisation d'un fichier de mots de passe cachés («\ shadow password file\ »). Ces fonctionnalités ne sont pas disponibles quand les mots de passe sont enregistrés dans un fichier de mots de passe simple («\ passwd file\ »).

source: limits.conf - Resource limits definition
fr: limits.conf - définition des limites de ressource

source: The I<limits.conf> file (/etc/security/limits.conf) describes the resource limits you wish to impose. It should be owned by root and readable by root account only.
fr: Le fichier I<limits.conf> (/etc/security/limits.conf) décrit les limites de ressource que vous voulez imposer. Il doit être possédé par root et ne doit être lisible que par le compte root.

source: By default no quotas are imposed on 'root'. In fact, there is no way to impose limits via this procedure to root-equiv accounts (accounts with UID 0).
fr: Par défaut, aucun quota (aucune limite) n'est imposé à «\ root\ ». En fait, il n'est pas possible d'imposer de cette façon de limite aux comptes root ou équivalents (comptes ayant un UID de 0).

source: Each line describes a limit for a user in the form:
fr: Chaque ligne décrit une limite pour un utilisateur et est de la forme suivante\ :

source: I<user LIMITS_STRING>
fr: I<utilisateur> I<LISTE_DE_LIMITES>

source: The B<LIMITS_STRING> is a string of a concatenated list of resource limits. Each limit consists of a letter identifier followed by a numerical limit.
fr: Où B<LISTE_DE_LIMITES> est une chaîne construite par la concaténation d'une liste de limites de ressource. Chaque limite consiste en une lettre (identifiant le type de limite) et une valeur numérique.

source: The valid identifiers are:
fr: Les identifiants possibles sont\ :

source: A: max address space (KB)
fr: A\ : espace d'adressage maximal (en kilo octets)

source: C: max core file size (KB)
fr: C\ : taille maximale d'un vidage mémoire («\ core\ », en kilo octets)

source: D: max data size (KB)
fr: D\ : taille maximale du segment de données d'un programme (en kilo octets)

source: F: maximum filesize (KB)
fr: F\ : taille maximale des fichiers (en kilo octets)

source: M: max locked-in-memory address space (KB)
fr: M\ : taille maximale de mémoire verrouillée («\ locked-in-memory\ », en kilo octets)

source: N: max number of open files
fr: N\ : nombre maximal de fichiers ouverts

source: R: max resident set size (KB)
fr: R\ : taille maximale de la mémoire résidente («\ resident set size\ », en kilo octets)

source: S: max stack size (KB)
fr: S\ : taille maximale de la pile (en kilo octets)

source: T: max CPU time (MIN)
fr: T\ : temps processeur maximal consommé (en minutes)

source: U: max number of processes
fr: U\ : nombre maximal de processus

source: K: file creation mask, set by B<umask>(2).
fr: K\ : masque de création de fichier, positionné par B<umask>(2).

source: L: max number of logins for this user
fr: L\ : nombre maximal de connexions simultanées pour cet utilisateur

source: P: process priority, set by B<setpriority>(2).
fr: P\ : priorité des processus, positionné par B<setpriority>(2).

source: For example, I<L2D2048N5> is a valid B<LIMITS_STRING>. For reading convenience, the following entries are equivalent:
fr: Par exemple, I<L2D2048N5> est une chaîne B<LISTE_DE_LIMITES> valable. Pour faciliter la lecture, les entrées suivantes sont équivalentes\ :

source: username L2D2048N5
fr: utilisateur L2D2048N5

source: username L2 D2048 N5
fr: utilisateur L2 D2048 N5

source: Be aware that after I<username> the rest of the line is considered a limit string, thus comments are not allowed. A invalid limits string will be rejected (not considered) by the login program.
fr: Attention\ : tout ce qui suit I<utilisateur> est considéré comme une limite. Les commentaires ne sont pas autorisés. Une chaîne de limites non valable sera rejetée (non utilisée) lors de la connexion.

source: The default entry is denoted by username "B<*>". If you have multiple I<default> entries in your B<LIMITS_FILE>, then the last one will be used as the default entry.
fr: L'utilisateur «\ *\ » permet de spécifier une entrée par défaut. Si plusieurs entrées par défaut sont présentes dans le fichier de limites, alors seule la dernière sera prise en compte.

source: To completely disable limits for a user, a single dash "B<->" will do.
fr: Pour enlever toute limite à un utilisateur, un simple tiret «\ -\ » fera l'affaire.

source: Also, please note that all limit settings are set PER LOGIN. They are not global, nor are they permanent. Perhaps global limits will come, but for now this will have to do ;)
fr: Notez également que les limites ne sont spécifiées que PAR CONNEXION. Il n'y a pas de limite globale ou permanente. Des limites globales pourraient voir le jour, mais pour l'instant, il faut faire sans.

source: pwconv, pwunconv, grpconv, grpunconv - convert to and from shadow passwords and groups.
fr: pwconv, pwunconv, grpconv, grpunconv - conversion vers ou depuis les fichiers de mots de passe ou de groupe cachés

source: These four programs all operate on the normal and shadow password and group files: I</etc/passwd>, I</etc/group>, I</etc/shadow>, and I</etc/gshadow>.
fr: Ces quatre programmes opèrent sur les fichiers de mots de passe et d'informations sur les groupes cachés ou non\ : I</etc/passwd>, I</etc/group>, I</etc/shadow>, and I</etc/gshadow>.

source: B<pwconv> creates I<shadow> from I<passwd> and an optionally existing I<shadow>. B<pwunconv> creates I<passwd> from I<passwd> and I<shadow> and then removes I<shadow>. B<grpconv> creates I<gshadow> from I<group> and an optionally existing I<gshadow>. B<grpunconv> creates I<group> from I<group> and I<gshadow> and then removes I<gshadow>.
fr: B<Pwconv> crée le fichier I<shadow> à partir du fichier I<passwd> et d'un éventuel fichier I<shadow>. B<Pwunconv> crée le fichier I<passwd> à partir des fichiers I<passwd> et I<shadow>, puis supprime I<shadow>. B<Grpconv> crée I<gshadow> à partir de I<group> et d'un éventuel fichier I<gshadow>. B<Grpunconv> crée I<group> à partir des fichiers I<group> et I<gshadow>, puis supprime I<gshadow>.

source: Each program acquires the necessary locks before conversion.
fr: Chaque programme place les verrous nécessaires avant de réaliser la conversion.

source: B<pwconv> and B<grpconv> are similar. First, entries in the shadowed file which don't exist in the main file are removed. Then, shadowed entries which don't have `x' as the password in the main file are updated. Any missing shadowed entries are added. Finally, passwords in the main file are replaced with `x'. These programs can be used for initial conversion as well to update the shadowed file if the main file is edited by hand.
fr: B<Pwconv> et B<grpconv> sont similaires. Dans un premier temps, les entrées présentes dans le fichier de mots de passe cachés (I</etc/shadow> ou I</etc/gshadow>), mais non présentes dans le fichier principal (I<passwd> ou I<group>), sont retirées. Ensuite, les entrées du fichier I<shadow> n'ayant pas pour mot de passe «\ x\ » dans le fichier I<passwd> sont mises à jour. Enfin, les mots de passe du fichier I<passwd> sont remplacés par «\ x\ ». Ces programmes peuvent être utilisés pour une première conversion, ou bien pour une mise à jour, si les fichiers principaux [\ NdT\ : non cachés\ ] ont été édités à la main.

source: B<pwconv> will use the values of B<PASS_MIN_DAYS>, B<PASS_MAX_DAYS>, and B<PASS_WARN_AGE> from I</etc/login.defs> when adding new entries to I</etc/shadow>.
fr: Lors de l'ajout de nouvelles entrées dans I</etc/shadow>, B<pwconv> utilisera les valeurs de B<PASS_MIN_DAYS> [\ NdT\ : durée minimale avant qu'un mot de passe puisse être modifié\ ], B<PASS_MAX_DAYS> [\ NdT\ : durée de validité maximale d'un mot de passe\ ], et B<PASS_WARN_AGE> [\ NdT\ : durée durant laquelle l'utilisateur est averti de la fin prochaine de la validité de son mot de passe\ ] définis dans le fichier I</etc/login.defs>.

source: Likewise, B<pwunconv> and B<grpunconv> are similiar. Passwords in the main file are updated from the shadowed file. Entries which exist in the main file but not in the shadowed file are left alone. Finally, the shadowed file is removed.
fr: De même, B<pwunconv> et B<grpunconv> sont similaires. Les mots de passe des fichiers principaux sont mis à jour à partir des fichiers d'informations cachées («\ shadowed file\ »). Les entrées existant dans un fichier principal, mais pas dans le fichier caché sont laissées. Enfin, le fichier caché est supprimé.

source: Some password aging information is lost by B<pwunconv>. It will convert what it can.
fr: Les informations d'âge des mots de passe sont perdues par B<pwunconv>. Il ne convertit que ce qu'il peut.

source: Errors in the password or group files (such as invalid or duplicate entries) may cause these programs to loop forever or fail in other strange ways. Please run B<pwck> and B<grpck> to correct any such errors before converting to or from shadow passwords or groups.
fr: Des erreurs dans les fichiers de mots de passe ou d'informations sur les groupes (comme des entrées invalides ou redondantes) peuvent conduire ces programmes à boucler indéfiniment ou à échouer d'une manière toute aussi étrange. Veuillez exécuter B<pwck> et B<grpck> pour corriger ces erreurs avant lancer toute conversion.

source: B<chpasswd> - update password file in batch
fr: B<chpasswd> - met à jour des mots de passe par lot

source: B<chpasswd> reads a file of user name and password pairs from standard input and uses this information to update a group of existing users. Without the --encrypted switch, the passwords are expected to be cleartext. With the --encrypted switch, the passwords are expected to be in encrypted form. Each line is of the format
fr: B<Chpasswd> lit une liste de paires de noms d'utilisateurs et de mots de passe depuis l'entrée standard et utilise ces informations pour mettre à jour un groupe d'utilisateurs existants. En l'absence de l'option --encrypted, les mots de passe doivent être fournis en clair. Avec cette option, ils doivent être fournis sous forme chiffrée. Chaque ligne est au format suivant\ :

source: I<user_name>:I<password>
fr: I<nom_utilisateur>:I<mot_de_passe>

source: The named user must exist. The supplied password will be encrypted as necessary, and the password age updated, if present.
fr: L'utilisateur doit exister. Le mot de passe fourni sera chiffré comme nécessaire. Son âge sera également mis à jour, s'il est présent.

source: This command is intended to be used in a large system environment where many accounts are created at a single time.
fr: Cette commande est destinée aux gros systèmes pour lesquels un nombre importants de comptes sont créés en une seule fois.

source: The --md5 switch allows using MD5 encryption instead of the default DES encryption when the supplied passwords are not already in encrypted form.
fr: L'option --md5 permet d'utiliser le chiffrement MD5, plutôt que DES, lorsque les mots de passe fournis ne sont pas chiffrés.

source: The input file must be protected if it contains unencrypted passwords.
fr: Le fichier d'entrée doit être correctement protégé s'il contient des mots de passe en clair.

source: B<dpasswd> - change dialup password
fr: B<dpasswd> - change le mot de passe de connexion par le réseau commuté

source: B<dpasswd> [(B<-af>|B<-d>)] I<shell>
fr: B<dpasswd> [(B<-af>|B<-d>)] I<interpréteur>

source: B<dpasswd> adds, deletes, and updates dialup passwords for user login shells. The dialup password is prompted for after a user's password has been authenticated whenever the user logs in over a dialup line. B<dpasswd> will prompt for the new password twice to insure it has been entered correctly.
fr: B<Dpasswd> ajoute, détruit et met à jour les mots de passe d'accès à l'interpréteur initial («\ login shell\ ») par le réseau commuté. Ce mot de passe est demandé après que l'utilisateur ait entré son mot de passe à chaque fois qu'il se connecte par une ligne téléphonique. B<Dpasswd> demandera le nouveau mot de passe deux fois afin de s'assurer qu'il a été entré correctement.

source: The I<shell> argument must be the complete pathname of the login program.
fr: L'argument I<interpréteur> doit être le chemin complet d'un interpréteur de commandes initial («\ login shell\ »).
