Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: B<userdel> will not allow you to remove an account if the user is currently logged in. You must kill any running processes which belong to an account that you are deleting. You may not remove any NIS attributes on an NIS client. This must be performed on the NIS server.
fr: B<Userdel> ne vous permet pas de supprimer un compte si l'utilisateur en question est actuellement connecté. Vous devez tuer tous les processus en cours d'exécution appartenant à l'utilisateur que vous êtes en train de supprimer. Vous ne pouvez pas supprimer d'attribut NIS d'un client NIS. Cela doit être effectué sur le serveur NIS.

source: vipw, vigr - edit the password, group, shadow-password, or shadow-group file.
fr: vipw, vigr - édite les fichiers passwd, group, shadow et gshadow

source: B<vipw> and B<vigr> will edit the files I</etc/passwd> and I</etc/group>, respectively. With the B<-s> flag, they will edit the shadow versions of those files, I</etc/shadow> and I</etc/gshadow>, respectively. The programs will set the appropriate locks to prevent file corruption.
fr: B<Vipw> et B<vigr> permettent d'éditer les fichiers I</etc/passwd> et I</etc/group>, respectivement. Avec l'option B<-s>, ils permettent d'éditer les versions cachées de ces fichiers\ : I</etc/shadow> et I</etc/gshadow>, respectivement. Ces programmes placent les verrous nécessaires afin d'éviter toute corruption des fichiers.

source: When looking for an editor, the programs will first try the environment variable B<VISUAL>, then the environment variable B<EDITOR>, and finally the default editor, B<vi>.
fr: L'éditeur utilisé est choisi en fonction des variables d'environnement B<VISUAL> et B<EDITOR>, et est par défaut B<vi>.

source: logoutd - Enforce login time restrictions
fr: logoutd - impose les restrictions de connexion dans le temps

source: B<logoutd> enforces the login time and port restrictions specified in I</etc/porttime>. B<logoutd> should be started from I</etc/rc>. The I</etc/utmp> file is scanned periodically and each user name is checked to see if the named user is permitted on the named port at the current time. Any login session which is violating the restrictions in I</etc/porttime> is terminated.
fr: B<Logoutd> impose les restrictions (sur les ports, la date et l'heure de connexion) spécifiées dans I</etc/porttime>. B<Logoutd> doit être démarré depuis I</etc/rc>. Il analyse le fichier I</var/run/utmp> régulièrement, et, pour chaque utilisateur, il vérifie que ce nom d'utilisateur est autorisé à être connecté à ce port à ce moment. Toute session en violation avec les restrictions de I</etc/porttime> est terminée.

source: /etc/porttime - login and port permissions
fr: /etc/porttime - fichier des autorisations d'accès en fonction de la date et de l'heure

source: /etc/utmp - current login sessions
fr: /var/run/utmp - liste des connexions courantes

source: newgrp - log in to a new group
fr: newgrp - se connecte avec un nouveau groupe

source: sg - execute command as different group ID
fr: sg - exécute une commande avec un autre identifiant de groupe

source: B<newgrp> [B<->] [I<group>]
fr: B<newgrp> [B<->] [I<groupe>]

source: B<sg> [B<->] [I<group> [[B<-c>] I<command>]]
fr: B<sg> [B<->] [I<groupe> [[B<-c>] I<commande>]]

source: B<newgrp> is used to change the current group ID during a login session. If the optional B<-> flag is given, the user's environment will be reinitialized as though the user had logged in, otherwise the current environment, including current working directory, remains unchanged.
fr: B<Newgrp> permet de changer l'identifiant de groupe de l'utilisateur au cours d'une session. Si l'option B<-> est fournie, l'environnement de l'utilisateur est réinitialisé, comme si l'utilisateur venait de se connecter. Sinon, l'environnement courant est utilisé. Entre autre, le répertoire de travail est conservé.

source: B<newgrp> changes the current real group ID to the named group, or to the default group listed in I</etc/passwd> if no group name is given. The user will be prompted for a password if she do not have a password and the group does, or if the user is not listed as a member and the group has a password. The user will be denied access if the group password is empty and the user is not listed as a member.
fr: B<Newgrp> change l'identifiant de groupe réel à la valeur du groupe donné en argument, ou au groupe par défaut défini dans I</etc/passwd> si aucun groupe n'est fourni. Un mot de passe sera demandé si l'utilisateur n'utilise pas de mot de passe, mais que le groupe en a un, ou si l'utilisateur n'est pas dans la liste des membres de ce groupe et que ce groupe utilise un mot de passe. L'accès sera refusé si le groupe n'a pas de mot de passe et que l'utilisateur ne fait pas partie de ses membres.

source: The B<sg> command works similar to B<newgrp> but accepts a command. The command will be executed with the Bourne shell. With most shells you may run B<sg> from, you need to enclose multi-word commands in quotes. Another difference between B<newgrp> and B<sg> is that some shells treat B<newgrp> specially, replacing themselves with a new instance of a shell that B<newgrp> creates. This doesn't happen with B<sg>, so upon exit from a B<sg> command you are returned to your previous group ID.
fr: La commande B<sg> fonctionne de la même manière que B<newgrp>, mais accepte une commande comme argument. Cette commande sera exécutée avec un interpréteur de commandes («\ Bourne shell\ »). Avec la plupart des interpréteurs de commandes permettant d'exécuter B<sg>, si la commande comporte plusieurs mots, il faut la placer entre des guillemets («\ "\ »).

source: chsh - change login shell
fr: chsh - change l'interpréteur de commandes initial

source: [B<-s >I<login_shell>] [I<user>]
fr: [B<-s> I<interpréteur>] [I<utilisateur>]

source: B<chsh> changes the user login shell. This determines the name of the user's initial login command. A normal user may only change the login shell for her own account, the super user may change the login shell for any account.
fr: B<Chsh> modifie l'interpréteur de commandes initial («\ login shell\ ») de l'utilisateur qui sera invoqué lors des connexions de l'utilisateur. Un utilisateur normal ne peut changer que l'interpréteur associé à son compte. Le superutilisateur peut changer l'interpréteur de commandes initial pour n'importe quel compte.

source: The only restrictions placed on the login shell is that the command name must be listed in I</etc/shells>, unless the invoker is the super-user, and then any value may be added. An account with a restricted login shell may not change her login shell. For this reason, placing B</bin/rsh> in I</etc/shells> is discouraged since accidentally changing to a restricted shell would prevent the user from every changing her login shell back to its original value.
fr: La seule restriction placée sur I<interpréteur> est que cette commande doit être listée dans I</etc/shells>, à moins que B<chsh> ne soit invoqué par le superutilisateur. Un compte avec un interpréteur de commandes restreint ne peut pas changer son interpréteur. Pour cette raison, il est déconseillé de placer B</bin/rsh> dans I</etc/shells>, puisqu'un changement accidentel vers un interpréteur restreint empêchera alors l'utilisateur de retourner ensuite à l'interpréteur précédent.

source: If the B<-s> option is not selected, B<chsh> operates in an interactive fashion, prompting the user with the current login shell. Enter the new value to change the shell, or leave the line blank to use the current one. The current shell is displayed between a pair of B<[ ]> marks.
fr: Quand l'option B<-s> n'est pas sélectionnée, B<chsh> opère de façon interactive, demandant à l'utilisateur quel doit être le nouvel interpréteur de commandes initial («\ login shell\ »). L'utilisateur pourra entrer une nouvelle valeur pour modifier l'interpréteur, ou laisser la ligne blanche pour conserver l'interpréteur actuel. L'interpréteur actuel est indiqué entre crochets (B<[\ ]>).

source: /etc/shells - list of valid login shells
fr: /etc/shells - liste des interpréteurs de commandes initiaux valables

source: pwauth - administrator defined password authentication
fr: pwauth - authentification par un programme défini par l'administrateur

source: The system administrator is able to define a list of programs which are used to validate a user's identity. These programs are given in place of the encrypted password information which is present in either the I</etc/passwd> or I</etc/shadow> files. The utilities which administer user accounts examine the encrypted password field and determine if the user has an administrator defined authentication program. The B<pw_auth> function will be invoked whenever one of these administration programs determines that a user which is being altered has authentication programs defined.
fr: L'administrateur peut définir une liste de programmes permettant d'authentifier un utilisateur. Ces programmes remplacent le champ de mot de passe chiffré dans les fichiers I</etc/passwd> ou I</etc/shadow>. Les utilitaires qui administrent les comptes des utilisateurs examinent le mot de passe chiffré et déterminent si l'administrateur a défini un programme d'authentification pour cet utilisateur. La fonction B<pw_auth> sera invoquée à chaque fois qu'un de ces utilitaires se rend compte que l'utilisateur utilise un programme d'authentification.

source: The initial entry is created with the B<useradd> command. Alterations, such as changing authentication information or deleting the user account, will cause the B<pw_auth> function to be invoked. This keeps the authentication information up to date for each user account.
fr: L'entrée initiale est créée avec la commande B<useradd>. Les modifications telles qu'un changement des informations d'authentification ou la suppression du compte entraîneront un appel de la fonction B<pw_auth>. Ceci permet de garder les informations d'authentification à jour pour chaque utilisateur.

source: The authentication programs do not create the actual login or network sessions. The exit code from the authentication program is taken as an indication that the action is to be permitted. The calling process must have the appropriate priviledges to create the login or network session itself.
fr: Les programmes d'authentification ne créent pas les véritables sessions locales ou distantes («\ actual login or network session\ »). La valeur de retour du programme d'authentification indique si l'action est autorisée. Le programme appelant doit avoir les privilèges appropriés pour créer ces sessions.

source: gpasswd - administer the /etc/group file
fr: gpasswd - administre le fichier /etc/group

source: B<gpasswd >I<group>
fr: B<gpasswd> I<groupe>

source: B<gpasswd -a >I<user> I<group>
fr: B<gpasswd -a> I<utilisateur> I<groupe>

source: B<gpasswd -d >I<user> I<group>
fr: B<gpasswd -d> I<utilisateur> I<groupe>

source: B<gpasswd -R >I<group>
fr: B<gpasswd -R> I<groupe>

source: B<gpasswd -r >I<group>
fr: B<gpasswd -r> I<groupe>

source: B<gpasswd> [B<-A >I<user>,...] [B<-M> I<user>,...] I<group>
fr: B<gpasswd> [B<-A> I<utilisateur>,...] [B<-M> I<utilisateur>,...] I<groupe>

source: B<gpasswd> is used to administer the /etc/group file (and /etc/gshadow file if compiled with SHADOWGRP defined). Every group can have administrators, members and a password. System administrator can use B<-A> option to define group administrator(s) and B<-M> option to define members and has all rights of group administrators and members.
fr: B<Gpasswd> est utilisé pour administrer le fichier /etc/group (ainsi que le fichier /etc/gshadow si l'option SHADOWGRP a été définie lors de la compilation). Chaque groupe peut avoir des administrateurs, des membres ainsi qu'un mot de passe. L'administrateur système peut utiliser l'option B<-A> pour définir le(s) administrateur(s) de groupe et l'option B<-M> pour en définir les membres. Il possède également les droits des administrateurs de groupe ou des membres.

source: Group administrator can add and delete users using B<-a> and B<-d> options respectively. Administrators can use B<-r> option to remove group password. When no password is set only group members can use B<newgrp>(1) to join the group. Option B<-R> disables access to the group through B<newgrp>(1) command.
fr: Un administrateur de groupe peut ajouter ou supprimer des utilisateurs en utilisant respectivement les options B<-a> et B<-d>. Les administrateurs peuvent utiliser l'option B<-r> pour supprimer le mot de passe d'un groupe. Lorsqu'aucun mot de passe n'est défini, seuls les membres d'un groupe peuvent utiliser B<newgrp>(1) pour utiliser ce groupe. L'option B<-R> désactive l'accès au groupe via la commande B<newgrp>(1).

source: B<gpasswd> called by a group administrator with group name only prompts for the group password. If password is set the members can still B<newgrp>(1) without a password, non-members must supply the password.
fr: B<Gpasswd> exécuté par un administrateur de groupe suivi d'un nom de groupe, affiche simplement l'invite de mot de passe du groupe. Si un mot de passe est défini alors les membres du groupe pourront utiliser B<newgrp>(1) sans mot de passe, tandis que les utilisateurs n'étant pas membre du groupe devront fournir le mot de passe.

source: login - begin session on the system
fr: login - démarre une session sur le système

source: B<login> [B<-p>] [I<username>] [I<ENV=VAR> ...]
fr: B<login> [B<-p>] [I<utilisateur>] [I<ENV=VAR> ...]

source: B<login> [B<-p>] [B<-h >I<host>] [B<-f >I<username>]
fr: B<login> [B<-p>] [B<-h> I<hôte>] [B<-f> I<utilisateur>]

source: B<login> [B<-p>] B<-r >I<host>
fr: B<login> [B<-p>] B<-r> I<hôte>

source: B<login> is used to establish a new session with the system. It is normally invoked automatically by responding to the I<login:> prompt on the user\'s terminal. B<login> may be special to the shell and may not be invoked as a sub-process. Typically, B<login> is treated by the shell as B<exec login> which causes the user to exit from the current shell. Attempting to execute B<login> from any shell but the login shell will produce an error message.
fr: B<Login> permet d'établir une nouvelle session sur le système. Il est généralement invoqué après avoir répondu à l'invite de login I<login:> sur le terminal de l'utilisateur. B<Login> peut être particulier pour l'interpréteur de commandes («\ shell\ ») et ne devrait pas être invoqué comme un sous-processus. En général, B<login> est traité comme B<exec login>, ce qui entraîne la sortie de l'interpréteur de commandes de l'utilisateur. L'exécution de B<login> depuis un interpréteur de commandes («\ shell\ ») autre qu'un interpréteur de commandes initial («\ login shell\ ») produira un message d'erreur.

source: When invoked from the I<login:> prompt, the user may enter environmental variables after the username. These variables are entered in the form B<NAME=VALUE>. Not all variables may be set in the fashion, notably B<PATH>, B<HOME> and B<SHELL>. Additionally, B<IFS> may be inhibited if the user\'s login shell is B</bin/sh>.
fr: Lorsqu'il est invoqué depuis l'invite de login I<login:>, l'utilisateur peut entrer des variables d'environnement après son nom d'utilisateur. Ces variables sont entrées sous la forme B<NOM=VALEUR>. Toutes les variables d'environnement ne peuvent pas être positionnées de cette façon, notamment B<PATH>, B<HOME> et B<SHELL>. De plus, B<IFS> peut être désactivé si l'interpréteur de commandes initial de l'utilisateur est B</bin/sh>.

source: The user is then prompted for a password, where appropriate. Echoing is disabled to prevent revealing the password. Only a small number of password failures are permitted before B<login> exits and the communications link is severed.
fr: Un mot de passe est ensuite demandé à l'utilisateur. L'affichage du mot de passe est désactivé pour éviter de révéler le mot de passe. Seul un petit nombre d'échecs sont permis avant que B<login> ne quitte et que la liaison ne soit interrompue.

source: If password aging has been enabled for your account, you may be prompted for a new password before proceeding. You will be forced to provide your old password and the new password before continuing. Please refer to B<passwd>(1) for more information.
fr: Si une date de fin de validité du mot de passe a été définie pour ce compte, un nouveau mot de passe pourra vous être demandé. Votre ancien mot de passe et votre nouveau mot de passe vous seront alors demandés avant de pouvoir continuer. Veuillez lire la page de manuel B<passwd>(1) pour plus d'informations.

source: After a successful login, you will be informed of any system messages and the presence of mail. You may turn off the printing of the system message file, I</etc/motd>, by creating a zero-length file I<.hushlogin> in your login directory. The mail message will be one of "B<You have new mail.>", "B<You have mail.>", or "B<No Mail.>" according to the condition of your mailbox.
fr: Après une connexion réussie, un message du système et la présence de courrier pourront vous être notifiés. Vous pouvez désactiver l'affichage du message du système (I</etc/motd>), en créant un fichier vide I<.hushlogin> dans le répertoire de votre compte. Le message concernant les courriers sera «\ B<You have new mail.>\ », «\ B<You have mail.>\ », ou «\ B<No Mail.>\ » suivant l'état de votre boîte aux lettres.

source: Your user and group ID will be set according to their values in the I</etc/passwd> file. The value for B<$HOME>, B<$SHELL>, B<$PATH>, B<$LOGNAME>, and B<$MAIL> are set according to the appropriate fields in the password entry. Ulimit, umask and nice values may also be set according to entries in the GECOS field.
fr: Votre identifiant d'utilisateur et de groupe seront placés en fonction des valeurs spécifiées dans le fichier I</etc/passwd>. Les valeurs des variables d'environnement B<$HOME>, B<$SHELL>, B<$PATH>, B<$LOGNAME>, et B<$MAIL> seront affectées en fonction des champs appropriés de l'entrée qui vous correspond. Les valeurs d'ulimit, d'umask et de nice pourront également être affectées en fonction du champ GECOS.

source: On some installations, the environmental variable B<$TERM> will be initialized to the terminal type on your tty line, as specified in I</etc/ttytype>.
fr: Pour certains systèmes, la variable d'environnement B<$TERM> sera initialisée au type de terminal de votre tty, comme spécifié dans I</etc/ttytype>.

source: An initialization script for your command interpreter may also be executed. Please see the appropriate manual section for more information on this function.
fr: Un script d'initialisation pour votre interpréteur de commandes pourra également être exécuté. Veuillez vous référer à la section de manuel appropriée pour plus d'informations sur cette fonctionnalité.

source: A subsystem login is indicated by the presence of a "*" as the first character of the login shell. The given home directory will be used as the root of a new file system which the user is actually logged into.
fr: Une connexion à un sous-système est indiquée par la présence d'un «\ *\ » comme premier caractère de l'interpréteur de commandes initial. Le répertoire personnel sera utilisé comme racine d'un nouveau système de fichier dans lequel l'utilisateur sera connecté.

source: Preserve environment.
fr: Préserve l'environnement.

source: Do not perform authentication, user is preauthenticated.
fr: Ne réalise pas d'authentification. L'utilisateur est pré-authentifié.

source: Name of the remote host for this login.
fr: Nom de l'hôte distant pour cette connexion.

source: Perform autologin protocol for rlogin.
fr: Exécute le protocole de connexion automatique (autologin) pour rlogin.

source: The B<-r>, B<-h> and B<-f> options are only used when B<login> is invoked by root.
fr: Les options B<-r>, B<-h> et B<-f> ne peuvent être utilisées que par root.

source: This version of B<login> has many compilation options, only some of which may be in use at any particular site.
fr: Cette version de B<login> a de nombreuses options de compilation. Seules certaines d'entre elles peuvent avoir été activées sur votre site.

source: The location of files is subject to differences in system configuration.
fr: L'emplacement des fichiers peut varier suivant la configuration du système.

source: The B<login> program is NOT responsible for removing users from the utmp file. It is the responsibility of B<getty>(8) and B<init>(8) to clean up apparent ownership of a terminal session. If you use B<login> from the shell prompt without B<exec>, the user you use will continue to appear to be logged in even after you log out of the "subsession".
fr: Le programme B<login> n'est PAS responsable de la suppression d'utilisateurs dans le fichier utmp. Les responsables du nettoyage de l'appartenance des sessions de terminal sont B<getty>(8) et B<init>(8). Si vous utilisez B<login> depuis un interpréteur de commandes sans B<exec>, l'utilisateur que vous utilisez continuera à apparaître comme étant connecté même après s'être déconnecté de cette «\ sous-session\ ».

source: /var/run/utmp - list of current login sessions
fr: /var/run/utmp - liste des connexions courantes

source: /var/log/wtmp - list of previous login sessions
fr: /var/log/wtmp - liste des connexions précédentes

source: /etc/shadow - encrypted passwords and age information
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: /etc/motd - system message file
fr: /etc/motd - fichier contenant le message du système

source: /etc/nologin - prevent non-root users from logging in
fr: /etc/nologin - empêche certains utilisateurs non-root de se connecter

source: /etc/ttytype - list of terminal types
fr: /etc/ttytype - liste des types de terminal

source: $HOME/.profile - initialization script for default shell
fr: $HOME/.profile - script d'initialisation pour l'interpréteur de commandes («\ shell\ ») par défaut

source: $HOME/.hushlogin - suppress printing of system messages
fr: $HOME/.hushlogin - supprime l'affichage du message du système

source: groups - display current group names
fr: groups - affiche la liste des groupes auxquels appartient l'utilisateur

source: B<groups> [I<user>]
fr: B<groups> [I<utilisateur>]

source: B<groups> displays the current group names or ID values. If the value does not have a corresponding entry in I</etc/group>, the value will be displayed as the numerical group value. The optional I<user> parameter will display the groups for the named I<user>.
fr: B<Groups> affiche la liste des noms de groupe (ou leur identifiant numérique) de l'utilisateur. Si une valeur n'a pas d'entrée correspondante dans I</etc/group>, l'identifiant numérique du groupe est affiché. L'argument optionnel I<utilisateur> permet d'afficher la liste des groupes pour cet utilisateur.

source: Systems which do not support concurrent group sets will have the information from I</etc/group> reported. The user must use B<newgrp> or B<sg> to change their current real and effective group ID.
fr: Sur les systèmes ne supportant pas l'appartenance à plusieurs groupes, seules les informations contenues dans I</etc/group> sont affichées. L'utilisateur doit utiliser B<newgrp> ou B<sg> pour modifier l'identifiant de groupe réel et effectif.

source: porttime - port access time file
fr: porttime - fichier de configuration des droits d'accès en fonction de la date et de l'heure

source: I<porttime> contains a list of tty devices, user names, and permitted login times.
fr: I<porttime> contient une liste de tty, noms d'utilisateurs, et horaires d'accès autorisés.
