Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: Each entry consists of three colon separated fields. The first field is a comma separated list of tty devices, or an asterisk to indicate that all tty devices are matched by this entry. The second field is a comma separated list of user names, or an asterisk to indicated that all user names are matched by this entry. The third field is a comma separated list of permitted access times.
fr: Chaque entrée consiste en trois champs séparés par un caractère deux-points «\ :\ ». Le premier champ est une liste de tty séparés par des virgules, ou un astérisque «\ *\ » pour indiquer que l'entrée correspond à tous les tty. Le second champ est une liste de noms d'utilisateurs, ou un astérisque pour indiquer que cette entrée correspond à n'importe quel utilisateur. Le troisième champ est une liste d'horaires d'accès autorisés.

source: Each access time entry consists of zero or more days of the week, abbreviated B<Su>, B<Mo>, B<Tu>, B<We>, B<Th>, B<Fr>, and B<Sa>, followed by a pair of times separated by a hyphen. The abbreviation B<Wk> may be used to represent Monday thru Friday, and B<Al> may be used to indicate every day. If no days are given, B<Al> is assumed.
fr: Chaque horaire d'accès consiste en zéro ou plusieurs abréviations de jours de la semaine\ : B<Su> (dimanche), B<Mo> (lundi), B<Tu> (mardi), B<We> (mercredi), B<Th> (jeudi), B<Fr> (vendredi), B<Sa> (samedi), suivi d'un couple d'horaires séparés par un tiret. L'abréviation B<Wk> peut être utilisée pour représenter les jours de la semaine du lundi au vendredi, et B<Al> permet de spécifier l'ensemble des jours de la semaine. Par défaut, si aucun jour n'est spécifié, B<Al> est utilisé.

source: EXAMPLES
fr: EXEMPLES

source: The following entry allows access to user B<jfh> on every port during weekdays from 9am to 5pm.
fr: L'entrée suivante autorise l'accès à l'utilisateur B<jfh> sur n'importe quel port pendant la semaine de 9 heures à 17 heures.

source: The following entries allow access only to the users B<root> and B<oper> on /dev/console at any time. This illustrates how the I</etc/porttime> file is an ordered list of access times. Any other user would match the second entry which does not permit access at any time.
fr: L'entrée suivante autorise l'accès à /dev/console uniquement aux utilisateurs B<root> et B<oper> à n'importe quelle heure. Ceci permet de montrer l'importance de l'ordre des entrées dans le fichier I</etc/porttime>. Les autres utilisateurs ne satisferont que la deuxième entrée, qui n'autorise aucun accès.

source: The following entry allows access for the user B<games> on any port during non-working hours.
fr: L'entrée suivante autorise l'accès à tous les ports pour l'utilisateur B<games>, en dehors des heures de travail.

source: /etc/porttime - file containing port access times
fr: /etc/porttime - fichier des autorisations d'accès en fonction de la date et de l'heure

source: sulogin - Single-user login
fr: sulogin - connexion en mode mono-utilisateur

source: B<sulogin> is invoked by B<init> prior to allowing the user access to the system when in single user mode. This feature may only be available on certain systems where B<init> has been modified accordingly, or where the B</etc/inittab> has an entry for a single user login.
fr: B<Sulogin> est invoqué par B<login> avant d'autoriser l'accès au système en mode mono-utilisateur («\ single user\ »). Cette fonctionnalité n'est disponible que sur certains systèmes dont B<init> a été modifié en conséquence, ou pour lesquels B</etc/inittab> contient une entrée pour une connexion mono-utilisateur.

source: The user is prompted
fr: Voici ce qui sera demandé à l'utilisateur\ :

source: Input and output will be performed with the standard file descriptors unless the optional device name argument is provided.
fr: Les entrées et sorties s'effectueront sur les descripteurs de fichier standards, à moins que l'argument optionnel I<tty-device> ne soit fourni.

source: If the user enters the correct root password, a login session is initiated. When B<EOF> is pressed instead, the system enters multi-user mode.
fr: Si l'utilisateur fourni correctement le mot de passe root, une session est lancée. Si B<EOF> ([\ NdT\ : Ctrl-D\ ]) est entré, le système se lance en mode multi-utilisateurs.

source: After the user exits the single-user shell, or presses B<EOF>, the system begins the initialization process required to enter multi-user mode.
fr: Après que l'utilisateur quitte l'interpréteur de commandes en mode mono-utilisateur, ou s'il presse B<EOF>, le système démarre le processus d'initialisation nécessaire à l'entrée en mode multi-utilisateurs.

source: This command can only be used if B<init> has been modified to call B<sulogin> instead of B</bin/sh>, or if the user has set the I<inittab> to support a single user login. For example, the line
fr: Cette commande ne peut être utilisée que si B<init> a été modifié afin d'appeler B<sulogin> à la place de B</bin/sh>, ou si l'utilisateur a configuré I<inittab> pour le support des connexions mono-utilisateur. Par exemple, la ligne suivante\ :

source: should execute the sulogin command in single user mode.
fr: exécute la commande B<sulogin> dans le mode mono-utilisateur.

source: As complete an environment as possible is created. However, various devices may be unmounted or uninitialized and many of the user commands may be unavailable or nonfunctional as a result.
fr: Un environnement aussi complet que possible est créé. Cependant, de nombreux périphériques ne seront peut-être pas montés, ou initialisés, ce qui pourra rendre beaucoup de commandes non disponibles ou non fonctionnelles.

source: /.profile - initialization script for single user shell
fr: /.profile - script d'initialisation des connexions en mode mono-utilisateur

source: expiry - check and enforce password expiration policy
fr: expiry - vérifie et sécurise la durée de validité des mots de passe

source: B<expiry> checks (B<-c>) the current password expiration and forces (B<-f>) changes when required. It is callable as a normal user command.
fr: Avec l'option B<-c>, B<expiry> vérifie la validité du mot de passe de l'utilisateur courant, et force des changements quand nécessaire. Il peut être appelé par un utilisateur normal.

source: /etc/shadow - shadow user account information
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: id - Display current user and group ID names
fr: id - affiche l'identifiant de l'utilisateur courant et le nom de ses groupes

source: B<id [-a>]
fr: B<id> [B<-a>]

source: B<id> displays the current real and effective user and group ID names or values. If the value does not have a corresponding entry in I</etc/passwd> or I</etc/group>, the value will be displayed without the corresponding name. The optional B<-a> flag will display the group set on systems which support multiple concurrent group membership.
fr: B<Id> affiche les noms ou les valeurs des identifiants courants et effectifs de l'utilisateur et de ses groupes. Si un identifiant n'a pas de correspondance dans I</etc/passwd> ou I</etc/group>, alors la valeur est affichée à la place du nom correspondant. L'option B<-a> permet d'afficher l'ensemble des groupes sur les systèmes supportant l'appartenance à plusieurs groupes.

source: su - Change user ID or become super-user
fr: su - change d'identifiant d'utilisateur ou devient superutilisateur

source: B<su> [B<OPTS>] [B<->] [B<username> [B<ARGS>]]
fr: B<su> [B<OPTS>] [B<->] [B<nom_utilisateur> [B<ARGS>]]

source: B<su> is used to become another user during a login session. Invoked without a username, B<su> defaults to becoming the super user. The optional argument B<-> may be used to provide an environment similiar to what the user would expect had the user logged in directly.
fr: B<Su> permet de devenir un autre utilisateur pendant une session. Invoqué sans nom d'utilisateur, le comportement par défaut est de devenir superutilisateur. L'argument optionnel B<-> permet d'obtenir un environnement similaire à celui obtenu par l'utilisateur après une connexion.

source: The user will be prompted for a password, if appropriate. Invalid passwords will produce an error message. All attempts, both valid and invalid, are logged to detect abuses of the system.
fr: Un mot de passe sera demandé à l'utilisateur, si nécessaire. Les mots de passe incorrects produisent un message d'erreur. Toutes les tentatives, réussies ou non, sont enregistrées afin de détecter tout abus du système.

source: An optional command can be executed. This is done by the shell specified in I</etc/passwd> for the target user unless the B<-s> or B<-m> options are used. Any arguments supplied after the B<username> will be passed to the invoked shell (shell must support the -c command line option in order for a command to be passed to it).
fr: Une commande optionnelle peut être exécutée. La commande sera exécutée par l'interpréteur de commandes de l'utilisateur spécifié dans I</etc/passwd>, à moins que l'option B<-s> ou B<-m> ne soit utilisée. Tous les arguments suivant le nom d'utilisateur seront passés à cet interpréteur de commandes (celui-ci doit supporter l'option B<-c> pour que la commande puisse lui être passée).

source: Unless the B<-m> or B<-p> options are used, the current environment is passed to the new shell with alterations. The value of B<$PATH> is reset to B</bin:/usr/bin> for normal users, or B</sbin:/bin:/usr/sbin:/usr/bin> for the super user. This may be changed with the B<ENV_PATH> and B<ENV_SUPATH> definitions in I</etc/login.defs>. B<$IFS>, if is set, is reset to contain space, tab, and newline. B<$USER> is set to the name of the target user, B<$HOME> is set to the home directory of the target user, and B<$SHELL> is set to the shell of the target user. When using the B<-m> or B<-p> options, the user's environment is not changed.
fr: Sauf si l'option B<-m> ou B<-p> est utilisée, l'environnement actuel est fourni à l'interpréteur de commandes avec quelques changements. La valeur de B<$PATH> est remise à B</bin:/usr/bin> pour les utilisateurs normaux, ou à B</sbin:/bin:/usr/sbin:/usr/bin> pour le superutilisateur. Ce comportement peut être modifié avec les paramètres B<ENV_PATH> et B<ENV_SUPATH> de I</etc/login.defs>. B<$IFS>, s'il est défini, est modifié pour ne contenir que espace, tabulation et nouvelle ligne. Le nom de l'utilisateur cible est affecté à B<$USER>, son répertoire personnel à B<$HOME>, et son interpréteur de commandes initial à B<$SHELL>. Avec les options B<-m> ou B<-p>, l'environnement de l'utilisateur n'est pas modifié.

source: A subsystem login is indicated by the presense of a "*" as the first character of the login shell. The given home directory will be used as the root of a new filesystem which the user is actually logged into.
fr: Une connexion à un sous-système est indiquée par la présence d'un «\ *\ » comme premier caractère de l'interpréteur de commandes initial. Le répertoire personnel sera utilisé comme racine d'un nouveau système de fichier dans lequel l'utilisateur sera connecté.

source: make this a login shell
fr: utilise un interpréteur de commandes initial «\ login shell\ »

source: B<-c>, B<--commmand>=I<E<lt>commandE<gt>>
fr: B<-c>, B<--commmand>=I<E<lt>commandeE<gt>>

source: pass I<command> to the invoked shell using its B<-c> option
fr: passe I<commande> à l'interpréteur de commandes invoqué en utilisant l'option B<-c>

source: do not reset environment variables, and keep the same shell
fr: ne remet pas les variables d'environnement à zero, et conserve le même interpréteur de commandes «\ shell\ »

source: B<-s>, B<--shell>=I<E<lt>shellE<gt>>
fr: B<-s>, B<--shell>=I<E<lt>interpréteurE<gt>>

source: use I<shell> instead of the default in /etc/passwd
fr: utilise I<interpréteur> plutôt que l'interpréteur de commandes par défaut défini dans /etc/passwd

source: The B<-m>, B<-p> and B<-s> options are restricted by the target user's shell being listed in B</etc/shells>. If it's not listed, then it's assumed to be a restricted account, a normal su is performed, and those options are ignored silently.
fr: Les options B<-m>, B<-p> et B<-s> sont restreintes aux interpréteurs de commandes listés dans B</etc/shells>. S'il n'est pas listé, le compte est considéré comme restreint, un «\ su\ » normal est exécuté, et ces options sont ignorées.

source: Much of the behavior of this command can be altered via its pam configuration - see B<pam>(7)
fr: Le comportement de cette commande peut être modifié par sa configuration pam. Veuillez consulter B<pam>(7).

source: This version of B<su> has many compilation options, only some of which may be in use at any particular site.
fr: Cette version de B<su> a de nombreuses options de compilation. Seules certaines d'entre elles sont peut-être activées sur votre site.

source: /etc/shells - valid user shells
fr: /etc/shells - liste des interpréteurs de commandes initiaux valables

source: Julianne Frances Haugh (jfh@austin.ibm.com)
fr: Julianne Frances Haugh E<lt>jfh@austin.ibm.comE<gt>

source: grpck - verify integrity of group files
fr: grpck - vérifie l'intégrité des fichiers d'administration des groupes

source: B<grpck> [B<-r>] [I<group> I<shadow>]
fr: B<grpck> [B<-rs>] [I<group> I<gshadow>]

source: B<grpck> verifies the integrity of the system authentication information. All entries in the I</etc/group> and I</etc/gshadow> are checked to see that the entry has the proper format and valid data in each field. The user is prompted to delete entries that are improperly formatted or which have other incorrectable errors.
fr: B<Grpck> vérifie l'intégrité des informations d'authentification du système. Toutes les entrées des fichiers I</etc/group> et I</etc/gshadow> sont vérifiées afin de s'assurer qu'elles ont le bon format et qu'elles contiennent des données valables dans chaque champ. Une confirmation de l'utilisateur sera demandée pour détruire les entrées mal formatées ou ayant d'autres erreurs non récupérables.

source: - a unique group name
fr: - unicité des noms de groupe

source: - a valid list of members and administrators
fr: - validité des membres et administrateurs

source: The checks for correct number of fields and unique group name are fatal. If the entry has the wrong number of fields, the user will be prompted to delete the entire line. If the user does not answer affirmatively, all further checks are bypassed. An entry with a duplicated group name is prompted for deletion, but the remaining checks will still be made. All other errors are warnings and the user is encouraged to run the B<groupmod> command to correct the error.
fr: Une erreur dans le nombre de champs ou la non unicité d'un nom de groupe sera fatale. Si le nombre de champs n'est pas correct, il sera demandé à l'utilisateur de supprimer la ligne. Si l'utilisateur ne répond pas par l'affirmative, les vérifications suivantes ne seront pas effectuées. Il sera également demandé de supprimer les entrées correspondant aux noms de groupe redondants, mais dans ce cas, les autres vérifications sont effectuées. Toutes les autres erreurs ne sont que des avertissements et l'utilisateur est encouragé à utiliser B<groupmod> pour les corriger.

source: The commands which operate on the I</etc/group> file are not able to alter corrupted or duplicated entries. B<grpck> should be used in those circumstances to remove the offending entry.
fr: Les commandes qui opèrent sur le fichier I</etc/group> ne peuvent pas modifier les entrées corrompues ou redondantes. B<Grpck> doit être utilisé dans ce cas pour retirer ces entrées.

source: By default, B<grpck> operates on the files I</etc/group> and I</etc/gshadow>. The user may select alternate files with the I<group> and I<shadow> parameters. Additionally, the user may execute the command in read-only mode by specifying the B<-r> flag. This causes all questions regarding changes to be answered B<no> without user intervention. B<grpck> can also sort entries in I</etc/group> and I</etc/gshadow> by GID. To run it in sort mode pass it B<-s> flag. No checks are performed then, it just sorts.
fr: Par défaut, B<grpck> opère sur les fichiers I</etc/group> et I</etc/gshadow>. L'utilisateur peut spécifier d'autres fichiers avec les paramètres I<group> et I<gshadow>. De plus, l'utilisateur peut exécuter les commandes en lecture seule en utilisant l'option B<-r>. Ceci aura pour conséquence de répondre B<no> à toutes les questions demandant des modifications, sans intervention de l'utilisateur. B<Grpck> permet aussi de trier les entrées de I</etc/group> et I</etc/gshadow> par GID. Pour effectuer ce tri, utilisez l'option B<-s>. Aucune vérification n'est alors effectuée, les entrées sont seulement triées.

source: /etc/gshadow - encrypted passwords and group administrator information
fr: /etc/gshadow - informations cachées sur les groupes

source: /etc/passwd - user information
fr: /etc/passwd - informations sur les comptes des utilisateurs

source: The B<grpck> command exits with the following values:
fr: La commande B<grpck> retourne les valeurs suivantes en quittant\ :

source: One or more bad group entries
fr: Une entrée de groupe ou plus est incorrecte

source: Cannot open group files
fr: Impossible d'ouvrir le fichier group

source: Cannot lock group files
fr: Impossible de verrouiller le fichier group

source: Cannot update group files
fr: Impossible de mettre à jour le fichier group

source: faillog - examine faillog and set login failure limits
fr: failog - examine le fichier failog, et fixe les limites d'échecs de connexion

source: B<faillog> [B<-u> I<login-name>] [B<-a>] [B<-t> I<days>]
fr: B<faillog> [B<-u> I<utilisateur>] [B<-a>] [B<-t> I<jours>]

source: B<faillog> formats the contents of the failure log, I</var/log/faillog>, and maintains failure counts and limits. The order of the arguments to B<faillog> is significant. Each argument is processed immediately in the order given.
fr: B<Faillog> affiche le contenu du journal des échecs de connexion (I</var/log/faillog>), et maintient le décompte et les limitations de ces échecs. L'ordre des arguments de B<faillog> est important. Chaque argument est interprété dans l'ordre donné.

source: The B<-p> flag causes failure entries to be printed in UID order. Entering B<-u >I<login-name> flag will cause the failure record for I<login-name> only to be printed. Entering B<-t >I<days> will cause only the failures more recent than I<days> to be printed. The B<-t> flag overrides the use of B<-u>. The B<-a> flag causes all users to be selected. When used with the B<-p> flag, this option selects all users who have ever had a login failure. It is meaningless with the B<-r> flag.
fr: L'option B<-p> permet d'afficher les échecs dans l'ordre des UID. En spécifiant B<-u> I<utilisateur>, seul les enregistrements correspondant à I<utilisateur> sont affichés. En spécifiant B<-t> I<jours>, seuls les enregistrements plus récents que I<jours> jours sont affichés. L'option B<-t> écrase toute utilisation de l'option B<-u>. L'option B<-a> permet de sélectionner tous les utilisateurs. Quand elle est utilisée avec l'option B<-p>, tous les utilisateurs qui ont déjà eu un échec de connexion sont sélectionnés. Elle n'a aucun sens avec l'option B<-r>.

source: The B<-r> flag is used to reset the count of login failures. Write access to I</var/log/faillog> is required for this option. Entering B<-u >I<login-name> will cause only the failure count for I<login-name> to be reset.
fr: L'option B<-r> permet de remettre à zéro le compteur des échecs. Un accès en écriture sur I</var/log/faillog> est nécessaire pour l'utilisation de cette option. En ajoutant B<-u> I<utilisateur>, seul le compteur des échecs de l'utilisateur I<utilisateur> est remis à zéro.

source: The B<-m> flag is used to set the maximum number of login failures before the account is disabled. Write access to I</var/log/faillog> is required for this option. Entering B<-m >I<max> will cause all accounts to be disabled after I<max> failed logins occur. This may be modified with B<-u >I<login-name> to limit this function to I<login-name> only. Selecting a I<max> value of 0 has the effect of not placing a limit on the number of failed logins. The maximum failure count should always be 0 for B<root> to prevent a denial of services attack against the system.
fr: L'option B<-m> permet de fixer le nombre maximal d'échecs avant de désactiver le compte. Un accès en écriture sur I</var/log/faillog> est nécessaire pour l'utilisation de cette option. L'option B<-m> I<max> permet de fixer une limite de I<max> échecs de connexion pour tous les comptes. On peut restreindre la limite à un utilisateur I<utilisateur> en spécifiant B<-u> I<utilisateur>. Une limite I<max> de 0 aura pour effet de ne pas placer de limite d'échec. La limite pour l'utilisateur B<root> devrait toujours être 0 pour éviter tout risque de déni de service contre le système.

source: Options may be combined in virtually any fashion. Each B<-p>, B<-r>, and B<-m> option will cause immediate execution using any B<-u> or B<-t> modifier.
fr: Les options peuvent être combinées de n'importe quelle façon. Les options B<-p>, B<-r>, et B<-m> sont exécutées immédiatement en utilisant les paramètres des options B<-u> ou B<-t> spécifiées.

source: B<faillog> only prints out users with no successful login since the last failure. To print out a user who has had a successful login since their last failure, you must explicitly request the user with the B<-u> flag, or print out all users with the B<-a> flag.
fr: B<Faillog> n'affiche que les utilisateurs n'ayant pas eu de connexion réussie depuis leur dernier échec. Pour afficher un utilisateur ayant eu une connexion réussie depuis son dernier échec, vous devez explicitement demander cet utilisateur avec l'option B<-u>, ou demander l'affichage de tous les utilisateurs avec l'option B<-a>.

source: Some systems may replace /var/log with /var/adm or /usr/adm.
fr: Sur certains systèmes /var/log est remplacé par /var/adm ou /usr/adm.

source: /var/log/faillog - failure logging file
fr: /var/log/faillog - journal des échecs de connexion

source: faillog - Login failure logging file
fr: faillog - journal des échecs de connexion

source: I<faillog> maintains a count of login failures and the limits for each account. The file is fixed length record, indexed by numerical UID. Each record contains the count of login failures since the last successful login; the maximum number of failures before the account is disabled; the line the last login failure occured on; and the date the last login failure occured.
fr: I<faillog> maintient un compteur des échecs de connexion ainsi que les limites associées à chaque compte. Le fichier contient un nombre fixe d'enregistrements, indexés par un identifiant numérique. Chaque enregistrement comprend le nombre d'échecs de connexion depuis la dernière connexion réussie, le nombre maximal d'échecs avant que le compte ne soit désactivé, la ligne du dernier échec de connexion, et la date du dernier échec.

source: The structure of the file is
fr: La structure du fichier est la suivante\ :

source: struct faillog { short fail_cnt; short fail_max; char fail_line[12]; time_t fail_time; };
fr: struct faillog { short fail_cnt; /* compteur des échecs */ short fail_max; /* nb max avant désactivation */ char fail_line[12]; /* ligne du dernier échec */ time_t fail_time; /* date du dernier échec */ };

source: /var/log/faillog - login failure log
fr: /var/log/faillog - journal des échecs de connexion

source: chage - change user password expiry information
fr: chage - modifie les informations de validité d'un mot de passe

source: [B<-m >I<mindays>] [B<-M >I<maxdays>] [B<-d >I<lastday>] [B<-I >I<inactive>]
fr: [B<-m> I<jours_min>] [B<-M> I<jours_max>] [B<-d> I<dernier_jour>] [B<-I> I<durée_inact>]
