Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: B<shadowconfig on> will turn shadow passwords on; B<shadowconfig off> will turn shadow passwords off. B<shadowconfig> will print an error message and exit with a nonzero code if it finds anything awry. If that happens, you should correct the error and run it again.
fr: B<shadowconfig on> active les mots de passe cachés («\ shadow passwords\ »)\ ; B<shadowconfig off> les désactive. B<Shadowconfig> affiche un message d'erreur et quitte avec une valeur de retour non nulle s'il rencontre quelque chose d'inattendu. Dans ce cas, vous devrez corriger l'erreur avant de recommencer.

source: Turning shadow passwords on when they are already on, or off when they are already off, is harmless.
fr: Activer les mots de passe cachés lorsqu'ils sont déjà activés, ou les désactiver lorsqu'ils ne sont pas actifs est sans effet.

source: Read I</usr/share/doc/passwd/README.Debian> for a brief introduction to shadow passwords and related features.
fr: Lisez I</usr/share/doc/passwd/README.debian> pour une brève introduction aux mots de passe cachés et à leurs fonctionnalités.

source: Note that turning shadow passwords off and on again will lose all password aging information.
fr: Notez que désactiver puis réactiver les mots de passe cachés aura pour conséquence la perte des informations d'âge sur les mots de passe.

source: groupdel - Delete a group
fr: groupdel - supprime un groupe

source: B<groupdel> I<group>
fr: B<groupdel> I<groupe>

source: The B<groupdel> command modifies the system account files, deleting all entries that refer to I<group>. The named group must exist.
fr: La commande B<groupdel> modifie les fichiers d'administration des comptes du système, en supprimant les entrées qui se réfèrent à I<groupe>. Le groupe nommé doit exister.

source: You must manually check all filesystems to insure that no files remain with the named group as the file group ID.
fr: Vous devez vérifier vous-même qu'aucun fichier possédé par le groupe ne subsiste sur tous les systèmes de fichiers.

source: You may not remove the primary group of any existing user. You must remove the user before you remove the group.
fr: Vous ne devez pas supprimer le groupe primaire d'un utilisateur existant. Vous devez supprimer l'utilisateur auparavant.

source: /etc/gshadow - secure group information
fr: /etc/gshadow - informations cachées sur les groupes

source: EXIT VALUES
fr: VALEUR DE RETOUR

source: 0 - success
fr: 0 - succès

source: 2 - bad command syntax
fr: 2 - erreur de syntaxe

source: 6 - specified group doesn't exist
fr: 6 - le groupe spécifié n'existe pas

source: 8 - can't remove user's primary group
fr: 8 - ne peut pas supprimer le groupe d'un utilisateur existant

source: 10 - can't update group file
fr: 10 - ne peut pas mettre à jour le fichier des groupes

source: useradd - Create a new user or update default new user information
fr: useradd - crée un nouvel utilisateur ou modifie les informations par défaut appliquées aux nouveaux utilisateurs

source: B<useradd> [B<-c> I<comment>] [B<-d> I<home_dir>]
fr: B<useradd> [B<-c> I<commentaire>] [B<-d> I<rép_perso>]

source: [B<-e> I<expire_date>] [B<-f> I<inactive_days>]
fr: [B<-e> I<date_fin_validité>] [B<-f> I<durée_inactivité>]

source: [B<-g> I<initial_group>] [B<-G> I<group>[,...]]
fr: [B<-g> I<groupe_initial>] [B<-G> I<groupe>[,...]]

source: [B<-m> [B<-k> I<skeleton_dir>]] [B<-o>] [B<-p> I<passwd>]
fr: [B<-m> [B<-k> I<rép_squelette>]] [B<-o>] [B<-p> I<mot_de_passe>]

source: [B<-s> I<shell>] [B<-u> I<uid>] I<login>
fr: [B<-s> I<interpréteur>] [B<-u> I<uid>] I<utilisateur>

source: B<useradd> B<-D> [B<-g>I< default_group>] [B<-b>I< default_home>]
fr: B<useradd> B<-D> [B<-g> I<groupe_défaut>] [B<-b> I<rép_perso_défaut>]

source: [B<-e>I< default_expire_date>] [B<-f>I< default_inactive>]
fr: [B<-e> I<date_fin_validité_défaut>] [B<-f> I<durée_inactivité_défaut>]

source: [B<-s>I< default_shell>]
fr: [B<-s> I<interpréteur_défaut>]

source: Creating New Users
fr: Création de nouveaux utilisateurs

source: When invoked without the B<-D> option, the B<useradd> command creates a new user account using the values specified on the command line and the default values from the system. The new user account will be entered into the system files as needed, the home directory will be created, and initial files copied, depending on the command line options. The options which apply to the B<useradd> command are:
fr: Quand elle est invoquée sans l'option B<-D>, la commande B<useradd> crée un nouveau compte utilisateur qui utilise les valeurs spécifiées sur la ligne de commande et les valeurs par défaut du système. Le nouveau compte utilisateur sera inséré dans les fichiers du système quand c'est nécessaire, le répertoire personnel sera créé, et les fichiers initiaux copiés, en fonction des options présentes en ligne de commande. Les options qui s'appliquent à la commande B<useradd> sont\ :

source: B<-c >I<comment>
fr: B<-c> I<commentaire>

source: The new user's password file comment field.
fr: Le champ de commentaire du fichier de mots de passe pour le nouvel utilisateur.

source: B<-d >I<home_dir>
fr: B<-d> I<rép_perso>

source: The new user will be created using I<home_dir> as the value for the user's login directory. The default is to append the I<login> name to I<default_home> and use that as the login directory name.
fr: Le nouvel utilisateur sera créé en utilisant I<rép_perso> comme valeur du répertoire de connexion de l'utilisateur. Le comportement par défaut est de concaténer I<utilisateur> au répertoire I<rép_perso_défaut>, et de l'utiliser en tant que nom de répertoire de connexion.

source: B<-e >I<expire_date>
fr: B<-e> I<date_fin_validité>

source: The date on which the user account will be disabled. The date is specified in the format I<YYYY-MM-DD>.
fr: La date à laquelle le compte utilisateur sera désactivé. La date est spécifiée dans le format I<AAAA-MM-JJ>.

source: B<-f >I<inactive_days>
fr: B<-f> I<durée_inactivité>

source: The number of days after a password expires until the account is permanently disabled. A value of 0 disables the account as soon as the password has expired, and a value of -1 disables the feature. The default value is -1.
fr: Le nombre de jours suivant la fin de validité d'un mot de passe après lequel le compte est définitivement désactivé. Une valeur de 0 désactive le compte dès que le mot de passe a dépassé sa fin de validité, et une valeur de -1 désactive cette fonctionnalité. La valeur par défaut est de -1.

source: B<-g >I<initial_group>
fr: B<-g> I<groupe_initial>

source: The group name or number of the user's initial login group. The group name must exist. A group number must refer to an already existing group. The default group number is 1 or whatever is specified in I</etc/default/useradd>.
fr: Le nom du groupe ou le numéro du groupe de connexion initial de l'utilisateur. Le nom du groupe doit exister. Un numéro de groupe doit se référer à un groupe préexistant. Le numéro de groupe par défaut est de 1, ou la valeur spécifiée dans I</etc/default/useradd>.

source: B<-G >I<group,[...]>
fr: B<-G> I<groupe,[...]>

source: A list of supplementary groups which the user is also a member of. Each group is separated from the next by a comma, with no intervening whitespace. The groups are subject to the same restrictions as the group given with the B<-g> option. The default is for the user to belong only to the initial group.
fr: Une liste de groupes supplémentaires auxquels fait également partie l'utilisateur. Chaque groupe est séparé du suivant par une virgule, sans espace entre eux. Les groupes sont soumis aux mêmes restrictions que celles de l'option B<-g>. Le comportement par défaut pour l'utilisateur est de n'appartenir qu'au groupe initial.

source: The user's home directory will be created if it does not exist. The files contained in I<skeleton_dir> will be copied to the home directory if the B<-k> option is used, otherwise the files contained in I</etc/skel> will be used instead. Any directories contained in I<skeleton_dir> or I</etc/skel> will be created in the user's home directory as well. The B<-k> option is only valid in conjunction with the B<-m> option. The default is to not create the directory and to not copy any files. This option may not function correctly if the username has a / in it.
fr: Le répertoire personnel de l'utilisateur sera créé s'il n'existe pas déjà. Les fichiers contenus dans I<rép_squelette> seront copiés dans le répertoire personnel si l'option B<-k> est employée\ ; sinon, les fichiers contenus dans I</etc/skel> seront utilisés à la place. Tous les répertoires contenus dans I<rép_squelette> ou dans I</etc/skel> seront également créés dans le répertoire personnel de l'utilisateur. L'option B<-k> n'est valable qu'en conjonction avec l'option B<-m>. Le comportement par défaut est de ne pas créer le répertoire, et de ne copier aucun fichier. Cette option ne fonctionne pas correctement lorsque le nom de l'utilisateur contient un «\ /\ ».

source: Allow create user with duplicate (non-unique) UID.
fr: Permet de créer un utilisateur avec un identifiant («\ UID\ ») redondant (non unique).

source: B<-p >I<passwd>
fr: B<-p> I<mot_de_passe>

source: The encrypted password, as returned by B<crypt>(3). The default is to disable the account.
fr: Le mot de passe chiffré, comme renvoyé par B<crypt>(3). Le comportement par défaut est de désactiver le compte.

source: B<-s >I<shell>
fr: B<-s> I<interpréteur>

source: The name of the user's login shell. The default is to leave this field blank, which causes the system to select the default login shell.
fr: Le nom de l'interpréteur de commandes initial de l'utilisateur («\ login shell\ »). Le comportement par défaut est de laisser ce champ vide. Le système sélectionnera alors l'interpréteur par défaut.

source: The numerical value of the user's ID. This value must be unique, unless the I<-o> option is used. The value must be non-negative. The default is to use the smallest ID value greater than 99 and greater than every other user. Values between 0 and 99 are typically reserved for system accounts.
fr: La valeur numérique de l'identifiant de l'utilisateur. Cette valeur doit être unique, à moins que l'option I<-o> ne soit utilisée. La valeur ne doit pas être négative. Le comportement par défaut est d'utiliser la plus petite valeur d'identifiant plus grande que 99, et plus grande que celle des identifiants de tous les autres utilisateurs. Les valeurs comprises entre 0 et 99 sont généralement réservées pour les comptes systèmes.

source: Changing the default values
fr: Modifier les valeurs par défaut

source: When invoked with the B<-D> option, B<useradd> will either display the current default values, or update the default values from the command line. The valid options are
fr: Quand il est invoqué avec l'option B<-D>, B<useradd> affichera soit les valeurs actuelles par défaut, soit mettra à jour les valeurs par défaut via la ligne de commande. Les options valables sont\ :

source: B<-b >I<default_home>
fr: B<-b> I<rép_perso_défaut>

source: The initial path prefix for a new user's home directory. The user's name will be affixed to the end of I<default_home> to create the new directory name if the B<-d> option is not used when creating a new account.
fr: Le préfixe du chemin des répertoires personnels pour les nouveaux utilisateurs. Le nom de l'utilisateur sera attaché à la fin de I<rép_perso> pour créer le nom du nouveau répertoire si l'option B<-d> n'est pas utilisée pendant la création d'un nouveau compte.

source: B<-e >I<default_expire_date>
fr: B<-e> I<date_fin_validité_défaut>

source: The date on which the user account is disabled.
fr: La date à laquelle le compte utilisateur sera désactivé.

source: B<-f >I<default_inactive>
fr: B<-f> I<durée_inactivité_défaut>

source: The number of days after a password has expired before the account will be disabled.
fr: Le nombre de jours après la fin de validité d'un mot de passe avant que le compte ne soit désactivé.

source: B<-g >I<default_group>
fr: B<-g> I<groupe_défaut>

source: The group name or ID for a new user's initial group. The named group must exist, and a numerical group ID must have an existing entry .
fr: Le nom de groupe ou l'identifiant numérique du groupe initial d'un nouvel utilisateur. Le groupe spécifié doit exister, et un identifiant de groupe numérique doit déjà exister.

source: B<-s >I<default_shell>
fr: B<-s> I<interpréteur_défaut>

source: The name of the new user's login shell. The named program will be used for all future new user accounts.
fr: Le nom de l'interpréteur de commandes initial («\ login shell\ ») d'un nouvel utilisateur. Le programme nommé sera utilisé pour tous les futurs nouveaux comptes utilisateur.

source: If no options are specified, B<useradd> displays the current default values.
fr: Si aucune option n'est spécifiée, B<useradd> affiche les valeurs par défaut du moment.

source: The system administrator is responsible for placing the default user files in the I</etc/skel> directory.
fr: L'administrateur système doit se charger de placer les fichiers par défaut dans le répertoire I</etc/skel>.

source: You may not add a user to an NIS group. This must be performed on the NIS server.
fr: Vous ne pouvez pas ajouter d'utilisateur à un groupe NIS. Cela doit être effectué sur le serveur NIS.

source: /etc/shadow - secure user account information
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: /etc/default/useradd - default information
fr: /etc/default/useradd - valeurs par défaut utilisées par B<useradd>

source: /etc/skel - directory containing default files
fr: /etc/skel - répertoire contenant les fichiers ajoutés par défaut aux nouveaux utilisateurs

source: chfn - change real user name and information
fr: chfn - modifie le nom complet et les informations associés à un utilisateur

source: [B<-f >I<full_name>] [B<-r >I<room_no>]
fr: [B<-f> I<nom_complet>] [B<-r> I<no_bureau>]

source: [B<-w >I<work_ph>] [B<-h >I<home_ph>] [B<-o >I<other>] [I<user>]
fr: [B<-w> I<tel_bureau>] [B<-h> I<tel_perso>] [B<-o> I<autre>] [I<utilisateur>]

source: B<chfn> changes user fullname, office number, office extension, and home phone number information for a user's account. This information is typically printed by B<finger>(1) and similar programs. A normal user may only change the fields for her own account, subject to the restrictions in /etc/login.defs. (The default configuration is to prevent users from changing their fullname.) The super user may change any field for any account. Additionally, only the super user may use the B<-o> option to change the undefined portions of the GECOS field.
fr: B<Chfn> modifie le nom complet d'un utilisateur, son numéro de bureau, son numéro de téléphone professionnel, et son numéro de téléphone personnel. Ces informations sont généralement affichées par B<finger>(1) ou d'autres programmes similaires. Un utilisateur normal ne peut modifier que les informations associées à son propre compte, avec les restrictions spécifiées dans /etc/login.defs. (Par défaut, les utilisateurs ne peuvent pas modifier leur nom complet). Le superutilisateur peut modifier n'importe quel champ pour n'importe quel compte. De plus, seul le superutilisateur peut utiliser l'option B<-o> pour modifier les parties non spécifiées du champ GECOS.

source: The only restriction placed on the contents of the fields is that no control characters may be present, nor any of comma, colon, or equal sign.
fr: La seule restriction pour le contenu des champs est qu'ils ne doivent contenir aucun caractère de contrôle, ni aucune virgule, deux-points ou signe égal.

source: If none of the options are selected, B<chfn> operates in an interactive fashion, prompting the user with the current values for all of the fields. Enter the new value to change the field, or leave the line blank to use the current value. The current value is displayed between a pair of B<[ ]> marks. Without options, chfn prompts for the current user account.
fr: Si aucune option n'est sélectionnée, B<chfn> opère de façon interactive, demandant à l'utilisateur d'entrer les nouvelles valeurs des champs ou de laisser une ligne blanche pour conserver la valeur actuelle. La valeur actuelle est indiquée entre crochets (B<[ ]>). En l'absence d'option, B<chfn> opère sur l'utilisateur courant.

source: /etc/login.defs - runtime configuragion
fr: /etc/login.defs - configuration de la suite des mots de passe cachés «\ shadow password\ »

source: passwd - The password file
fr: passwd - le fichier des mots de passe

source: I<passwd> contains various pieces of information for each user account. Included is
fr: I<passwd> contient différentes informations sur les comptes utilisateurs, parmi lesquelles\ :

source: Optional encrypted password
fr: un mot de passe chiffré optionnel

source: Numerical user ID
fr: l'identifiant numérique de l'utilisateur

source: Numerical group ID
fr: l'identifiant numérique du groupe de l'utilisateur

source: User name or comment field
fr: le nom complet de l'utilisateur ou un champ de commentaires

source: User home directory
fr: le répertoire personnel de l'utilisateur

source: User command interpreter
fr: l'interpréteur de commandes de l'utilisateur

source: The comment field is used by various system utilities, such as B<finger>(1). Three additional values may be present in the comment field. They are
fr: Le champ de commentaire est utilisé par différents utilitaires système, tels que B<finger>(1). Trois autres valeurs peuvent être présentes dans ce champ\ :

source: pri= - set initial value of nice
fr: pri= - permet de définir la valeur de nice initiale

source: umask= - set initial value of umask
fr: umask= - permet de définir la valeur d'umask initiale

source: ulimit= - set initial value of ulimit
fr: ulimit= - permet de définir la valeur d'ulimit initiale

source: These fields are separated from each other and from any other comment field by a comma.
fr: Ces champs sont séparés du champ de commentaire et les uns des autres par une virgule.

source: The home directory field provides the name of the initial working directory. B<Login> uses this information to set the value of the B<HOME> environmental variable.
fr: Le champ du répertoire personnel de l'utilisateur correspond au nom du répertoire de travail initial. B<Login> utilise cette information pour définir la valeur de la variable d'environnement B<HOME>.

source: The command interpreter field provides the name of the user's command language interpreter, or the name of the initial program to execute. B<Login> uses this information to set the value of the B<SHELL> environmental variable. If this field is empty, it defaults to the value B</bin/sh>.
fr: Le champ de l'interpréteur de commandes correspond au nom de l'interpréteur de commandes de l'utilisateur, ou au nom d'un programme initial à exécuter. B<Login> utilise cette information pour définir la valeur de la variable d'environnement B<SHELL>. Si ce champ est vide, B</bin/sh> est utilisé par défaut.

source: groupmod - Modify a group
fr: groupmod - modifie un groupe

source: B<groupmod> [B<-g>I< gid >[B<-o>]] [B<-n>I< group_name >] I<group>
fr: B<groupmod> [B<-g> I<gid> [B<-o>]] [B<-n> I<nom_groupe> ] I<groupe>

source: The B<groupmod> command modifies the system account files to reflect the changes that are specified on the command line. The options which apply to the I<groupmod> command are
fr: La commande B<groupmod> modifie les fichiers d'administration des comptes du système pour refléter les modifications spécifiées sur la ligne de commande. Les options qui s'appliquent à la commande B<groupmod> sont\ :

source: The numerical value of the group's ID. This value must be unique, unless the B<-o> option is used. The value must be non-negative. Values between 0 and 99 are typically reserved for system groups. Any files which the old group ID is the file group ID must have the file group ID changed manually.
fr: La valeur numérique de l'identifiant du groupe ([\ NdT\ : group ID ou GID\ ]). Cette valeur doit être unique, à moins que l'option B<-o> ne soit utilisée. La valeur ne doit pas être négative. Les valeurs comprises entre 0 et 99 sont généralement réservées aux comptes système. Vous devrez modifier vous-même le groupe propriétaire de tous les fichiers possédés par ce groupe.

source: B<-n >I<group_name>
fr: B<-n> I<nom_groupe>

source: The name of the group will be changed from I<group> to I<group_name>.
fr: Le nom du groupe sera modifié de I<groupe> vers I<nom_groupe>

source: passwd - change user password
fr: passwd - modifie le mot de passe d'un utilisateur

source: B<passwd> [B<-f>|B<-s>] [I<name>]
fr: B<passwd> [B<-f>|B<-s>] [I<nom>]

source: B<passwd> [B<-g>] [B<-r>|B<-R>] I<group>
fr: B<passwd> [B<-g>] [B<-r>|B<-R>] I<groupe>

source: B<passwd> [B<-x >I<max>] [B<-n >I<min>] [B<-w >I<warn>] [B<-i >I<inact>] I<login>
fr: B<passwd> [B<-x> I<max>] [B<-n> I<min>] [B<-w> I<avert>] [B<-i> I<inact>] I<login>

source: B<passwd> changes passwords for user and group accounts. A normal user may only change the password for his/her own account, the super user may change the password for any account. The administrator of a group may change the password for the group. B<passwd> also changes account information, such as the full name of the user, user's login shell, or password expiry date and interval.
fr: B<Passwd> modifie les mots de passe d'utilisateurs ou de groupes. Un utilisateur normal ne peut changer que son mot de passe, le superutilisateur peut changer le mot de passe de n'importe quel compte. L'administrateur d'un groupe peut modifier le mot de passe associé à ce groupe. B<Passwd> modifie également les informations associées au compte, telles que le nom complet de l'utilisateur, son interpréteur de commandes initial («\ login shell\ »), la date de fin de validité du mot de passe, ou sa durée de validité.

source: The B<-s> option makes B<passwd> call B<chsh> to change the user's shell. The B<-f> option makes passwd call chfn to change the user's gecos information. These two options are only meant for compatiblity, since the other programs can be called directly.
fr: Avec l'option B<-s>, B<passwd> appelle B<chsh> pour modifier l'interpréteur de commandes de l'utilisateur. Avec l'option B<-f>, B<passwd> appelle B<chfn> pour modifier les informations GECOS de l'utilisateur [\ NdT\ : ces informations optionnelles contiennent généralement le nom complet de l'utilisateur\ ]. Ces deux options ne sont fournies que pour des raisons de compatibilité puisque ces autres programmes peuvent être appelés directement.

source: Password Changes
fr: Modifications du mot de passe

source: The user is first prompted for his/her old password, if one is present. This password is then encrypted and compared against the stored password. The user has only one chance to enter the correct password. The super user is permitted to bypass this step so that forgotten passwords may be changed.
fr: Dans un premier temps, l'utilisateur doit fournir son ancien mot de passe, s'il en avait un. Ce mot de passe est ensuite chiffré puis comparé avec le mot de passe enregistré. L'utilisateur n'a droit qu'à un seul essai pour entrer le mot de passe correct. Le superutilisateur peut contourner cette première étape de manière à changer les mots de passe ayant été oubliés.

source: After the password has been entered, password aging information is checked to see if the user is permitted to change the password at this time. If not, B<passwd> refuses to change the password and exits.
fr: Une fois que le mot de passe a été entré, les informations de limite de validité du mot de passe sont vérifiées pour s'assurer que l'utilisateur est autorisé à modifier son mot de passe à cet instant. Dans le cas contraire, B<passwd> refuse de changer le mot de passe, et quitte.
