Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: Feb 14, 1996
fr: 14 février 1996

source: NAME
fr: NOM

source: suauth - Detailed su control file
fr: suauth - fichier de contrôle détaillé de su

source: The file I</etc/suauth> is referenced whenever the su command is called. It can change the behaviour of the su command, based upon
fr: Le fichier I</etc/suauth> est lu chaque fois que su est exécuté. Il permet de modifier le comportement de la commande su, en fonction de\ :

source: 1) the user su is targetting
fr: 1) l'utilisateur cible de su

source: 2) the user executing the su command (or any groups he might be a member of)
fr: 2) l'utilisateur qui exécute la commande su (ou un groupe dont il est membre)

source: The file is formatted like this, with lines starting with a # being treated as comment lines and ignored;
fr: Le fichier est formaté de la façon suivante (les lignes commençant par un «\ #\ » sont des commentaires, et sont ignorées)\ :

source: to-id:from-id:ACTION
fr: I<vers-id>:I<par-id>:I<ACTION>

source: Where to-id is either the word B<ALL>, a list of usernames delimited by "," or the words B<ALL EXCEPT> followed by a list of usernames delimited by ","
fr: Où I<vers-id> peut être le mot B<ALL>, une liste de noms d'utilisateurs délimités par une virgule ou B<ALL EXCEPT> suivi d'une liste d'utilisateurs délimités par une virgule.

source: from-id is formatted the same as to-id except the extra word B<GROUP> is recognised. B<ALL EXCEPT GROUP> is perfectly valid too. Following B<GROUP> appears one or more group names, delimited by ",". It is not sufficient to have primary group id of the relevant group, an entry in B</etc/group>(5) is neccessary.
fr: I<par-id> utilise le même format que I<vers-id>, mais accepte également le mot-clef B<GROUP>. B<ALL EXCEPT GROUP> est également accepté. B<GROUP> est suivi d'un ou plusieurs noms de groupes, délimités par une virgule. Avoir comme groupe primaire le groupe approprié ne sera pas suffisant\ : une entrée dans B</etc/group>(5) est nécessaire.

source: Action can be one only of the following currently supported options.
fr: Les valeur d'I<ACTION> valables sont \ :

source: The attempt to su is stopped before a password is even asked for.
fr: La tentative de changement d'utilisateur est arrêtée avant que le mot de passe ne soit demandé.

source: The attempt to su is automatically successful; no password is asked for.
fr: La tentative est automatiquement réussie. Aucun mot de passe n'est demandé.

source: For the su command to be successful, the user must enter his or her own password. They are told this.
fr: Pour que la commande su soit réussie, l'utilisateur doit entrer son propre mot de passe. Ceci lui sera précisé.

source: Note there are three separate fields delimited by a colon. No whitespace must surround this colon. Also note that the file is examined sequentially line by line, and the first applicable rule is used without examining the file further. This makes it possible for a system administrator to exercise as fine control as he or she wishes.
fr: Notez qu'il y a trois champs séparés par un «\ deux-points\ ». Ne pas accoller d'espace à ce «\ deux-points\ ». Notez aussi que le fichier est examiné séquentiellement ligne par ligne, et que la première règle applicable est utilisée sans que le reste du fichier ne soit examiné. Ceci permet à l'administrateur système de définir un contrôle aussi fin qu'il le souhaite.

source: EXAMPLE
fr: EXEMPLE

source: # sample /etc/suauth file # # A couple of privileged usernames may # su to root with their own password. # root:chris,birddog:OWNPASS # # Anyone else may not su to root unless in # group wheel. This is how BSD does things. # root:ALL EXCEPT GROUP wheel:DENY # # Perhaps terry and birddog are accounts # owned by the same person. # Access can be arranged between them # with no password. # terry:birddog:NOPASS birddog:terry:NOPASS #
fr: # exemple de fichier /etc/suauth # # Deux utilisateurs privilégiés peuvent # devenir root avec leur propre mot de passe. # root:chris,birddog:OWNPASS # # Les autres ne peuvent pas de venir root avec # su, à l'exception des membres du groupe wheel. # Ceci correspond au comportement des BSD. # root:ALL EXCEPT GROUP wheel:DENY # # terry et birddog sont des comptes possédés # par la même personne. # Un accès sans mot passe est aménagé # entre ces deux comptes. # terry:birddog:NOPASS birddog:terry:NOPASS #

source: FILES
fr: FICHIERS

source: BUGS
fr: BOGUES

source: There could be plenty lurking. The file parser is particularly unforgiving about syntax errors, expecting no spurious whitespace (apart from beginning and end of lines), and a specific token delimiting different things.
fr: Il en reste sans doute beaucoup. L'analyseur du fichier est particulièrement impitoyable avec les erreurs de syntaxe. Il n'autorise d'espace qu'en début et fin de ligne, et seul le délimiteur spécifique doit être utilisé.

source: An error parsing the file is reported using B<syslogd>(8) as level ERR on facility AUTH.
fr: Une erreur dans l'analyse du fichier est reportée via B<syslogd>(8) au niveau ERR dans la catégorie AUTH.

source: SEE ALSO
fr: VOIR AUSSI

source: AUTHOR
fr: AUTEUR

source: shadow - encrypted password file routines
fr: shadow - routines d'utilisation des mots de passe cachés

source: B<struct spwd *getspnam(char> I<*name>B<);>
fr: B<struct spwd *getspnam(char> I<*nom>B<);>

source: I<shadow> manipulates the contents of the shadow password file, I</etc/shadow>. The structure in the I<#include> file is
fr: I<shadow> manipule le contenu du fichier des mots de passe cachés, I</etc/shadow>. La structure définie dans le fichier inclu est\ :

source: char *sp_namp; /* user login name */
fr: char *sp_namp; /* nom de connexion de l'utilisateur */

source: char *sp_pwdp; /* encrypted password */
fr: char *sp_pwdp; /* mot de passe chiffré */

source: long sp_lstchg; /* last password change */
fr: long sp_lstchg; /* dernier changement de mot de passe */

source: int sp_min; /* days until change allowed. */
fr: int sp_min; /* jours avant de pouvoir changer de mot de passe */

source: int sp_max; /* days before change required */
fr: int sp_max; /* jours avant l'obligation de changer de mot de passe */

source: int sp_warn; /* days warning for expiration */
fr: int sp_warn; /* jours d'avertissement avant la fin de validité */

source: int sp_inact; /* days before account inactive */
fr: int sp_inact; /* jours avant que le compte soit inactif */

source: int sp_expire; /* date when account expires */
fr: int sp_expire; /* date de fin de validité du compte */

source: int sp_flag; /* reserved for future use */
fr: int sp_flag; /* réservé pour une utilisation future */

source: The meanings of each field are
fr: La signification de chaque champ est la suivante\ :

source: sp_namp - pointer to null-terminated user name.
fr: sp_namp - pointeur vers le nom d'utilisateur «\ null-terminated\ ».

source: sp_pwdp - pointer to null-terminated password.
fr: sp_pwdp - pointeur vers le mot de passe «\ null-terminated\ ».

source: sp_lstchg - days since Jan 1, 1970 password was last changed.
fr: sp_lstchg - numéro du jour de dernière modification du mot de passe à compter du premier janvier 1970.

source: sp_min - days before which password may not be changed.
fr: sp_min - nombre de jours pendant lesquels le mot de passe ne peut pas être changé.

source: sp_max - days after which password must be changed.
fr: sp_max - nombre de jours maximal avant que le mot de passe doit être changé.

source: sp_warn - days before password is to expire that user is warned of pending password expiration.
fr: sp_warn - nombre de jours avant que le mot de passe n'arrive en fin de validité pendant lesquels l'utilisateur est averti de la fin prochaine de la validité de son mot de passe.

source: sp_inact - days after password expires that account is considered inactive and disabled.
fr: sp_inact - nombre de jours après la fin de validité du mot de passe avant de considérer que le compte est inactif et désactivé.

source: sp_expire - days since Jan 1, 1970 when account will be disabled.
fr: sp_expire - numéro du jour après lesquels le compte est désactivé, à compter du 1er janvier 1970.

source: sp_flag - reserved for future use.
fr: sp_flag - réservé pour une utilisation future.

source: B<getspent>, B<getspname>, B<fgetspent>, and B<sgetspent> each return a pointer to a B<struct spwd>. B<getspent> returns the next entry from the file, and B<fgetspent> returns the next entry from the given stream, which is assumed to be a file of the proper format. B<sgetspent> returns a pointer to a B<struct spwd> using the provided string as input. B<getspnam> searches from the current position in the file for an entry matching B<name>.
fr: B<Getspent>, B<getspname>, B<fgetspent>, et B<sgetspent> renvoient tous un pointeur vers une structure B<struct spwd>. B<Getspent> renvoie l'entrée suivante du fichier, et B<fgetspent> renvoie l'entrée suivante du flux qui est considéré comme étant un fichier au bon format. B<Sgetspent> renvoie un pointeur vers une structure B<struct spwd> en utilisant la chaîne de caractère fournie en entrée. B<Getspnam> cherche à partir de la position courante une entrée correspondant à B<nom> dans le fichier fourni en entrée.

source: B<setspent> and B<endspent> may be used to begin and end, respectively, access to the shadow password file.
fr: B<Setspent> et B<endspent> peuvent être utilisés pour débuter et terminer l'accès au fichier de mots de passe cachés.

source: The B<lckpwdf> and B<ulckpwdf> routines should be used to insure exclusive access to the I</etc/shadow> file. B<lckpwdf> attempts to acquire a lock using B<pw_lock> for up to 15 seconds. It continues by attempting to acquire a second lock using B<spw_lock> for the remainder of the initial 15 seconds. Should either attempt fail after a total of 15 seconds, B<lckpwdf> returns -1. When both locks are acquired 0 is returned.
fr: Les fonctions B<lckpwdf> et B<ulckpwdf> doivent être utilisée pour garantir un accès exclusif au fichier I</etc/shadow>. B<Lckpwdf> essaie de placer un verrou avec B<pw_lock> pendant 15 secondes. Il essaie ensuite de placer un second verrou en utilisant B<spw_lock> pendant le reste de ces 15 secondes. Si un de ces verrous ne peut être placé, B<lckpwdf> renvoie -1. Quand les deux verrous peuvent être placés, la valeur 0 est renvoyée.

source: Routines return NULL if no more entries are available or if an error occurs during processing. Routines which have B<int> as the return value return 0 for success and -1 for failure.
fr: Les fonctions renvoient NULL si plus aucune entrée n'est disponible ou si une erreur est survenue pendant le traitement. Les fonctions dont la valeur de retour est un B<int> renvoient 0 en cas de succès et -1 en cas d'échec.

source: CAVEATS
fr: AVERTISSEMENTS

source: These routines may only be used by the super user as access to the shadow password file is restricted.
fr: Ces fonctions peuvent n'être disponibles que pour le superutilisateur, puisque l'accès au fichier de mots de passe cachés est restreint.

source: /etc/shadow - encrypted user passwords
fr: /etc/shadow - mots de passe cachés des utilisateurs

source: Julianne Frances Haugh (jockgrrl@ix.netcom.com)
fr: Julianne Frances Haugh E<lt>jockgrrl@ix.netcom.comE<gt>

source: pwauth - administrator defined password authentication routines
fr: pwauth - routines d'authentification définies par l'administrateur

source: B<int pw_auth (char> I<*command,> B<char> I<*user,> B<int> I<reason,> B<char> I<*input)>B<;>
fr: B<int pw_auth (char> I<*commande>, B<char> I<*utilisateur>, B<int> I<raison>, B<char> I<*input)>B<;>

source: B<pw_auth> invokes the administrator defined functions for a given user.
fr: B<pw_auth> invoque les fonctions définies par l'administrateur pour un utilisateur donné.

source: I<command> is the name of the authentication program. It is retrieved from the user's password file information. The string contains one or more executable file names, delimited by semi-colons. Each program will be executed in the order given. The command line arguments are given for each of the reasons listed below.
fr: I<commande> est le nom du programme d'authentification, qui est récupéré dans les informations du fichier de mots de passe concernant l'utilisateur. Cette chaîne contient le nom d'un ou plusieurs fichiers exécutables séparés par des «\ ;\ ». Chacun des programmes sera exécuté dans l'ordre donné. Les arguments de la ligne de commande sont donnés pour chacune des raisons listées ci-dessous.

source: I<user> is the name of the user to be authenticated, as given in the I</etc/passwd> file. User entries are indexed by username. This allows non-unique user IDs to be present and for each different username associated with that user ID to have a different authentication program and information.
fr: I<utilisateur> est le nom de l'utilisateur à authentifier, comme dans le fichier I</etc/passwd>. Les entrées des utilisateurs sont indexées par nom d'utilisateur. Ceci permet d'avoir des identifiants (numériques) non unique, et d'avoir, pour les différents noms d'utilisateur associés à un identifiant, des informations ou un programme d'authentification différents.

source: Each of the permissible authentication reasons is handled in a potentially differenent manner. Unless otherwise mentioned, the standard file descriptors 0, 1, and 2 are available for communicating with the user. The real user ID may be used to determine the identity of the user making the authentication request. I<reason> is one of
fr: Chacune des raisons d'authentification possibles est gérée d'une façon particulière. Sauf si le contraire est mentionné, les descripteurs de fichier standards 0, 1 et 2 sont disponibles pour communiquer avec l'utilisateur. L'identifiant réel de l'utilisateur peut être utilisé pour déterminer l'identité de l'utilisateur demandant son authentification. Les raisons possibles sont\ :

source: Perform authentication for the current real user ID attempting to switch real user ID to the named user. The authentication program will be invoked with a B<-s> option, followed by the username.
fr: Réalise une authentification pour l'identifiant réel de l'utilisateur actuel avant d'utiliser l'utilisateur nommé comme l'identifiant réel. Le programme d'authentification sera appelé avec une option B<-s>, suivie du nom d'utilisateur.

source: Perform authentication for the named user creating a new login session. The authentication program will be invoked with a B<-l> option, followed by the username.
fr: Réalise une authentification pour l'utilisateur nommé, avant de créer une session de connexion «\ login session\ ». Le programme d'authentification sera appelé avec une option B<-k>, suivie par le nom d'utilisateur.

source: Create a new entry for the named user. This allows an authentication program to initialize storage for a new user. The authentication program will be invoked with a B<-a> option, followed by the username.
fr: Créé une nouvelle entrée pour l'utilisateur nommé. Ceci permet à un programme d'authentification d'initialiser l'espace de stockage pour un nouvel utilisateur. Le programme d'authentification sera appelé avec une option B<-a>, suivie du nom d'utilisateur.

source: Alter an existing entry for the named user. This allows an authentication program to alter the authentication information for an existing user. The authentication program will be invoked with a B<-c> option, followed by the username.
fr: Modifie une entrée pour l'utilisateur nommé. Ceci permet à un programme d'authentification de modifier les informations d'authentification pour un utilisateur existant. Le programme d'authentification sera appelé avec une option B<-c>, suivie par le nom d'utilisateur.

source: Delete authentication information for the named user. This allows an authentication program to reclaim storage for a user which is no longer authenticated using the authentication program. The authentication program will be invoked with a B<-d> option, followed by the username.
fr: Supprime les informations d'authentification pour l'utilisateur nommé. Ceci permet à un programme d'authentification de récupérer l'espace de stockage d'un utilisateur qui n'est plus authentifié grâce au programme d'authentification. Le programme d'authentification sera appelé avec une option B<-d> suivie du nom d'utilisateur.

source: Authenticate a user who is connecting to the system using the B<telnet> command. The authentication program will be invoked with a B<-t> option, followed by the username.
fr: Authentifie un utilisateur qui est connecté au système par la commande B<telnet>. Le programme d'authentification sera appelé avec une option B<-t> suivie par le nom d'utilisateur.

source: Authenticate a user who is connecting to the system using the B<rlogin> command. The authentication program will be invoked with a B<-r> option, followed by the username.
fr: Authentifie un utilisateur qui est connecté au système par la commande B<rlogin>. Le programme d'authentification sera appelé avec une option B<-r> suivie par le nom d'utilisateur.

source: Authenticate a user who is connecting to the system using the B<ftp> command. The authentication program will be invoked with a B<-f> option, followed by the username. The standard file descriptors are not available for communicating with the user. The standard input file descriptor will be connected to the parent process, while the other two output file descriptors will be connected to I</dev/null>. The B<pw_auth> function will pipe a single line of data to the authentication program using file descriptor 0.
fr: Authentifie un utilisateur qui est connecté au système par la commande B<ftp>. Le programme d'authentification sera appelé avec une option B<-f> suivie par le nom d'utilisateur. Les descripteurs de fichier standards ne sont pas disponibles pour communiquer avec l'utilisateur. Le descripteur de fichier de l'entrée standard sera connecté au processus parent, et les deux descripteurs de fichier de sortie seront connectés à I</dev/null>. La fonction B<pw_auth> utilisera un pipe («\ tuyau\ ») pour transmettre une seule ligne de données au programme d'authentification en utilisant le descripteur de fichier 0.

source: Authenticate a user who is connecting to the system using the I<rexec> command. The authentication program will be invoked with a B<-x> option, followed by the username. The standard file descriptors are not available for communicating with the remote user. The standard input file descriptor will be connected to the parent process, while the other two output file descriptors will be connected to I</dev/null>. The B<pw_auth> function will pipe a single line of data to the authentication program using file descriptor 0.
fr: Authentifie un utilisateur qui est connecté au système par la commande B<rexec>. Le programme d'authentification sera appelé avec une option B<-x> suivie par le nom d'utilisateur. Les descripteurs de fichier standard ne sont pas disponibles pour communiquer avec l'utilisateur. Le descripteur de fichier de l'entrée standard sera connecté au processus parent, et les deux descripteurs de fichier de sortie seront connectés à I</dev/null>. La fonction B<pw_auth> utilisera un pipe («\ tuyau\ ») pour transmettre une seule ligne de données au programme d'authentification en utilisant le descripteur de fichier 0.

source: The last argument is the authentication data which is used by the B<PW_FTP> and B<PW_REXEC> reasons. It is treated as a single line of text which is piped to the authentication program. When the reason is B<PW_CHANGE,> the value of I<input> is the value of previous user name if the user name is being changed.
fr: Le dernier argument correspond aux données d'authentification qui sont utilisées pour les raisons B<PW_FTP> et B<PW_REXEC>. Il est traité comme une simple ligne de texte, qui est transmise par un pipe au programme d'authentification. Quand la raison est B<PW_CHANGE>, la valeur d'I<input> est la valeur précédente du nom de l'utilisateur si ce nom est en train d'être changé.

source: This function does not create the actual session. It only indicates if the user should be allowed to create the session.
fr: Cette fonction ne créée pas la session. Elle indique uniquement si l'utilisateur doit être autorisé à créer cette session.

source: The network options are untested at this time.
fr: Les options réseau ne sont toujours pas testées à ce jour.

source: The B<pw_auth> function returns 0 if the authentication program exited with a 0 exit code, and a non-zero value otherwise.
fr: La fonction B<pw_auth> retourne 0 si le programme d'authentification a quitté avec une valeur de retour de 0, et une valeur non nulle sinon.

source: pwck - verify integrity of password files
fr: pwck - vérifie l'intégrité des fichiers de mots de passe

source: B<pwck> verifies the integrity of the system authentication information. All entries in the I</etc/passwd> and I</etc/shadow> are checked to see that the entry has the proper format and valid data in each field. The user is prompted to delete entries that are improperly formatted or which have other uncorrectable errors.
fr: B<Pwck> vérifie l'intégrité des informations d'authentification du système. Toutes les entrées des fichiers I</etc/passwd> et I</etc/shadow> sont vérifiées afin de s'assurer qu'elles ont le bon format et qu'elles contiennent des données valables dans chaque champ. Une confirmation de l'utilisateur sera demandée pour détruire les entrées mal formatées ou ayant d'autres erreurs non récupérables.

source: Checks are made to verify that each entry has
fr: Voici les vérifications effectuées\ :

source: - the correct number of fields
fr: - nombre correct de champs

source: - a unique user name
fr: - unicité des noms d'utilisateur

source: - a valid user and group identifier
fr: - validité des identifiant d'utilisateur et de groupe

source: - a valid primary group
fr: - validité du groupe primaire

source: - a valid home directory
fr: - validité du répertoire personnel

source: - a valid login shell
fr: - validité de l'interpréteur de commandes initial («\ login shell\ »)

source: The checks for correct number of fields and unique user name are fatal. If the entry has the wrong number of fields, the user will be prompted to delete the entire line. If the user does not answer affirmatively, all further checks are bypassed. An entry with a duplicated user name is prompted for deletion, but the remaining checks will still be made. All other errors are warning and the user is encouraged to run the B<usermod> command to correct the error.
fr: Une erreur dans le nombre de champs ou la non unicité d'un nom d'utilisateur sera fatale. Si le nombre de champs n'est pas correct, il sera demandé à l'utilisateur de supprimer la ligne. Si l'utilisateur ne répond pas par l'affirmative, les vérifications suivantes ne seront pas effectuées. Il sera également demandé de supprimer les entrées correspondant aux noms d'utilisateur redondants, mais dans ce cas, les autres vérifications sont effectuées. Toutes les autres erreurs ne sont que des avertissements et l'utilisateur est encouragé à utiliser B<usermod> pour les corriger.

source: The commands which operate on the I</etc/passwd> file are not able to alter corrupted or duplicated entries. B<pwck> should be used in those circumstances to remove the offending entry.
fr: Les commandes qui opèrent sur le fichier I</etc/passwd> ne peuvent pas modifier les entrées corrompues ou redondantes. B<Pwck> doit être utilisé dans ce cas pour retirer ces entrées.
