Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge8/man/*/po4a/*/shadow-man.*.po
Languages: fr

source: The user is then prompted for a replacement password. This password is tested for complexity. As a general guideline, passwords should consist of 6 to 8 characters including one or more from each of following sets:
fr: Le nouveau mot de passe est ensuite demandé à l'utilisateur. La complexité de ce mot de passe est testée. Comme ligne de conduite générale, un mot de passe doit toujours être constitué de 6 à 8 caractères en en choisissant un ou plus parmi chacun des ensembles suivants\ :

source: Lower case alphabetics
fr: Caractères alphabétiques minuscules

source: Upper case alphabetics
fr: Caractères alphabétiques majuscules

source: Digits 0 thru 9
fr: Chiffres de 0 à 9

source: Punctuation marks
fr: Marques de ponctuation

source: Care must be taken not to include the system default erase or kill characters. B<passwd> will reject any password which is not suitably complex.
fr: Il faudra faire attention à ne pas utiliser les caractères de suppression ou d'effacement. B<Passwd> rejettera tout mot de passe dont la complexité ne sera pas suffisante.

source: If the password is accepted, B<passwd> will prompt again and compare the second entry against the first. Both entries are required to match in order for the password to be changed.
fr: Si le mot de passe est accepté, B<passwd> demandera de répéter ce mot de passe et comparera le second mot de passe avec le premier. Ces deux mots de passe devront être identiques pour que le mot de passe soit changé.

source: Group passwords
fr: Mots de passe de groupe

source: When the B<-g> option is used, the password for the named group is changed. The user must either be the super user, or a group administrator for the named group. The current group password is not prompted for. The B<-r> option is used with the B<-g> option to remove the current password from the named group. This allows group access to all members. The B<-R> option is used with the B<-g> option to restrict the named group for all users.
fr: L'option B<-g> permet de modifier le mot de passe d'un groupe. L'utilisateur devra être soit le superutilisateur, soit l'administrateur du groupe spécifié. Le mot de passe actuel du groupe n'est pas demandé. L'option B<-r> combinée à l'option B<-g> permet de retirer le mot de passe associé au groupe sélectionné. Ceci autorisera l'accès au groupe à tous ses membres. L'option B<-R> combinée à l'option B<-g> permet de restreindre l'accès à un groupe à tous les utilisateurs.

source: Password expiry information
fr: Informations de validité d'un mot de passe

source: The password aging information may be changed by the super user with the B<-x>, B<-n>, B<-w>, and B<-i> options. The B<-x> option is used to set the maximum number of days a password remains valid. After I<max> days, the password is required to be changed. The B<-n> option is used to set the minimum number of days before a password may be changed. The user will not be permitted to change the password until I<min> days have elapsed. The B<-w> option is used to set the number of days of warning the user will receive before his/her password will expire. The warning occurs I<warn> days before the expiration, telling the user how many days remain until the password is set to expire. The B<-i> option is used to disable an account after the password has been expired for a number of days. After a user account has had an expired password for I<inact> days, the user may no longer sign on to the account.
fr: Les informations de validité temporelle peuvent être modifiées par le superutilisateur avec les options B<-x>, B<-n>, B<-w>, et B<-i>. L'option B<-x> est utilisée pour fixer le nombre de jours maximum pendant lesquels le mot de passe sera valable. Après I<max> jours, le mot de passe devra être changé. L'option B<-n> est utilisée pour fixer le nombre de jours minimum pendant lesquels le mot de passe ne pourra pas être modifié. L'utilisateur ne pourra pas modifier son mot de passe avant une période de I<min> jours. L'option B<-w> est utilisée pour fixer le nombre de jours avant la fin de la validité de son mot de passe pendant lesquels l'utilisateur recevra un avertissement. L'avertissement apparaîtra I<avert> jours avant la fin de validité, indiquant à l'utilisateur combien de jours il reste avant que son mot de passe ne devienne invalide. L'option B<-i> permet de désactiver un compte après une certaine durée de non validité. Si le mot de passe reste invalide pendant I<inact> jours, l'utilisateur ne pourra plus se connecter à son compte.

source: If you wish to immediately expire an account's password, you can use the B<-e> option. This in effect can force a user to change his/her password at the user's next login. You can also use the B<-d> option to delete a user's password (make it empty). Use caution with this option since it can make an account not require a password at all to login, leaving your system open to intruders.
fr: Si vous voulez forcer la fin de validité du mot de passe d'un compte immédiatement, vous pouvez utiliser l'option B<-e>. Ceci permet de forcer un utilisateur à modifier son mot de passe lors de sa prochaine connexion. Vous pouvez également utiliser l'option B<-d> pour supprimer le mot de passe d'un utilisateur (le rendre vide). Faites attention avec cette option, puisqu'elle peut créer des comptes ne nécessitant pas de mot de passe pour se connecter, laissant votre système ouvert à tout intrus.

source: Account maintenance
fr: Maintenance d'un compte

source: User accounts may be locked and unlocked with the B<-l> and B<-u> flags. The B<-l> option disables an account by changing the password to a value which matches no possible encrypted value. The B<-u> option re-enables an account by changing the password back to its previous value.
fr: Des comptes peuvent être bloqués ou débloqués avec les options B<-l> et B<-u>. L'option B<-l> désactive un compte en changeant le champ du mot de passe de telle sorte qu'il ne corresponde à aucun mot de passe chiffré. L'option B<-u> réactive un compte en restaurant le champ du mot de passe à sa valeur précédente.

source: The account status may be viewed with the B<-S> option. The status information consists of 7 fields. The first field is the user's login name. The second field indicates if the user account is locked (L), has no password (NP), or has a usable password (P). The third field gives the date of the last password change. The next four fields are the minimum age, maximum age, warning period, and inactivity period for the password. These ages are expressed in days. See B<Password expiry information> above for a discussion of these fields.
fr: L'état d'un compte peut être visualisé avec l'option B<-S>. Cet état est constitué de 7 champs. Le premier champ est le nom du compte. Le second champ indique si le compte est bloqué (L), n'a pas de mot de passe (NP) ou a un mot de passe utilisable (P). Le troisième champ donne la date de dernière modification du mot de passe. Les quatre champs suivants sont\ : la durée minimum avant modification, la durée maximum de validité, la durée d'avertissement, et la durée d'inactivité autorisée pour le mot de passe. Les durées sont exprimées en jours. Voir B<Informations de validité d'un mot de passe> ci-dessus pour des explications sur ces champs.

source: Hints for user passwords
fr: Astuces pour les mots de passe

source: The security of a password depends upon the strength of the encryption algorithm and the size of the key space. The B<\s-2UNIX\s+2> System encryption method is based on the NBS DES algorithm and is very secure. The size of the key space depends upon the randomness of the password which is selected.
fr: La sécurité d'un mot de passe repose sur la force de l'algorithme de chiffrement et sur la taille de l'espace de clés utilisé. La méthode de chiffrement des systèmes B<\s-2UNIX\s+2> est basée sur l'algorithme NBS DES, elle est très sûre. La taille de l'espace de clés dépend de l'aléa du mot de passe utilisé.

source: Compromises in password security normally result from careless password selection or handling. For this reason, you should not select a password which appears in a dictionary or which must be written down. The password should also not be a proper name, your license number, birth date, or street address. Any of these may be used as guesses to violate system security.
fr: Les compromissions de la sécurité des mots de passe résultent le plus souvent d'une négligence dans le choix du mot de passe, ou lors de son utilisation. Pour cette raison, vous ne devez pas sélectionner de mot de passe apparaissant dans un dictionnaire ou devant être écrit. Le mot de passe ne doit pas non plus être un nom propre, un numéro minéralogique, une date de naissance, ou une adresse. En effet ceux-ci pourraient être devinés pour violer la sécurité du système.

source: Your password must easily remembered so that you will not be forced to write it on a piece of paper. This can be accomplished by appending two small words together and separating each with a special character or digit. For example, Pass%word.
fr: Vous devez pouvoir vous rappeler facilement de votre mot de passe, afin de ne pas avoir à le noter sur un morceau de papier. On peut pour ceci choisir d'accoler deux mots en les séparant avec un caractère spécial ou un chiffre. Par exemple, Mot2passe.

source: Other methods of construction involve selecting an easily remembered phrase from literature and selecting the first or last letter from each word. An example of this is
fr: D'autres méthodes de construction utilisent une phrase facile à se rappeler, et consistent à sélectionner la première ou la dernière lettre de chaque mot. Voici un exemple [\ NdT\ : en anglais\ ]\ :

source: which produces
fr: Ce qui donne\ :

source: You may be reasonably sure few crackers will have included this in their dictionaries. You should, however, select your own methods for constructing passwords and not rely exclusively on the methods given here.
fr: Vous pouvez raisonnablement être assuré que quelques crackers ont désormais inclu ces mots de passe dans leurs dictionnaires. Vous pouvez également utiliser votre propre méthode de construction de mots de passe et ne pas compter uniquement sur les méthodes proposées ici.

source: Notes about group passwords
fr: Notes sur les mots de passe de groupe

source: Group passwords are an inherent security problem since more than one person is permitted to know the password. However, groups are a useful tool for permitting co-operation between different users.
fr: Les mots de passe de groupe représentent naturellement un risque en matière de sécurité, puisque plusieurs personnes ont connaissance du mot de passe. Cependant, les groupes sont utiles pour permettre la coopération entre différents utilisateurs.

source: Not all options may be supported. Password complexity checking may vary from site to site. The user is urged to select a password as complex as he feels comfortable with. Users may not be able to change their password on a system if NIS is enabled and they are not logged into the NIS server.
fr: Toutes les options ne sont pas forcément supportées. La vérification de la complexité des mots de passe peut varier d'un site à l'autre. Il est vivement conseillé aux utilisateurs de choisir un mot de passe aussi complexe que possible. Les utilisateurs peuvent ne pas être capable de changer leur mot de passe sur un système si NIS est activé et qu'ils ne sont pas connectés au serveur NIS.

source: User account information
fr: informations sur les comptes des utilisateurs

source: Encrypted user passwords
fr: mots de passe chiffrés des utilisateurs

source: groupadd - Create a new group
fr: groupadd - crée un nouveau groupe

source: B<groupadd> [B<-g>I< gid >[B<-o>]] I<group>
fr: B<groupadd> [B<-g> I<gid> [B<-o>]] I<groupe>

source: The B<groupadd> command creates a new group account using the values specified on the command line and the default values from the system. The new group will be entered into the system files as needed. The options which apply to the B<groupadd> command are
fr: La commande B<groupadd> crée un nouveau compte de groupe en utilisant les valeurs spécifiées sur la ligne de commande et les valeurs par défaut du système. Le nouveau groupe sera inséré dans les fichiers du système quand c'est nécessaire. Les options qui s'appliquent à la commande B<groupadd> sont\ :

source: The numerical value of the group's ID. This value must be unique, unless the B<-o> option is used. The value must be non-negative. The default is to use the smallest ID value greater than 99 and greater than every other group. Values between 0 and 99 are typically reserved for system accounts.
fr: La valeur numérique de l'identifiant du groupe ([\ NdT\ : group ID ou GID\ ]. Cette valeur doit être unique, à moins que l'option B<-o> ne soit utilisée. La valeur ne doit pas être négative. Par défaut le plus petit identifiant plus grand que 99 et que les identifiants des groupes existants est utilisé. Les valeurs comprises entre 0 et 99 sont généralement réservées aux comptes système.

source: /etc/group - group account information
fr: /etc/group - informations sur les groupes

source: /etc/gshadow - secure group account information
fr: /etc/gshadow - informations cachées sur les groupes

source: B<newusers> - update and create new users in batch
fr: B<newusers> - met à jour, ou crée de nouveaux utilisateurs par lots

source: B<newusers> [I<new_users>]
fr: B<newusers> [I<nouveaux_utilisateurs>]

source: B<newusers> reads a file of user name and clear-text password pairs and uses this information to update a group of existing users or to create new users. Each line is in the same format as the standard password file (see B<passwd>(5)) with the following exceptions.
fr: B<Newusers> lit un fichier contenant des paires de nom d'utilisateur et de mot de passe et utilise ces informations pour mettre à jour un groupe d'utilisateurs existants ou pour créer de nouveaux utilisateurs. Chaque ligne est au même format que le fichier des mots de passe (voir B<passwd>(5)) avec les exceptions suivantes\ :

source: This field will be encrypted and used as the new value of the encrypted password.
fr: Ce champ sera chiffré et utilisé comme la nouvelle valeur du mot de passe chiffré.

source: This field will be ignored for shadow passwords if the user already exists.
fr: Ce champ sera ignoré pour les mots de passe cachés («\ shadow password\ ») si l'utilisateur existe déjà.

source: This field may be the name of an existing group, in which case the named user will be added as a member. If a non-existent numerical group is given, a new group will be created having this number.
fr: Ce champ peut être le nom d'un groupe existant, ce qui permet d'ajouter l'utilisateur désigné dans la liste des membres du groupe. Si un identifiant de groupe inexistant est indiqué, un nouveau groupe est créé, avec cet identifiant de groupe.

source: This field will be checked for existence as a directory and a new directory with the same name will be created if it does not already exist. The ownership of the directory will be set to be that of the user being created or updated.
fr: L'existence du répertoire indiqué dans ce champ est vérifiée, et dans le cas contraire, le répertoire est créé. Le propriétaire du répertoire sera l'utilisateur dont le compte est créé ou mis à jour.

source: This command is intended to be used in a large system environment where many accounts are updated at a single time.
fr: Cette commande a été conçue pour les gros systèmes pour lesquels un grand nombre de comptes sont mis à jour à un même instant.

source: The input file must be protected since it contains unencrypted passwords.
fr: Le fichier d'entrée doit être correctement protégé puisqu'il contient des mots de passe en clair.

source: B<passwd>(1), B<useradd>(8)
fr: B<passwd>(1), B<useradd>(8), B<chpasswd>(8)

source: usermod - Modify a user account
fr: usermod - modifie un compte utilisateur

source: B<usermod> [B<-c> I<comment>] [B<-d> I<home_dir> [B<-m>]]
fr: B<usermod> [B<-c> I<commentaire>] [B<-d> I<rép_perso> [B<-m>]]

source: [B<-g> I<initial_group>] [B<-G> I<group> [,...]]
fr: [B<-g> I<groupe_initial>] [B<-G> I<groupe> [,...]]

source: [B<-l> I<login_name>] [B<-p> I<passwd>]
fr: [B<-l> I<nom_utilisateur>] [B<-p> I<mot_de_passe>]

source: [B<-s> I<shell>] [B<-u> I<uid> [B<-o>]] [B<-L>|B<-U>] I<login>
fr: [B<-s> I<interpréteur>] [B<-u> I<uid> [B<-o>]] [B<-L>|B<-U>] I<utilisateur>

source: The B<usermod> command modifies the system account files to reflect the changes that are specified on the command line. The options which apply to the B<usermod> command are:
fr: La commande B<usermod> modifie les fichiers d'administration des comptes du système pour refléter les modifications qui ont été spécifiées sur la ligne de commande. Les options qui s'appliquent à la commande B<usermod> sont\ :

source: The new value of the user's password file comment field. It is normally modified using the B<chfn>(1) utility.
fr: La nouvelle valeur du champ de commentaire du fichier de mots de passe pour l'utilisateur. Il est normalement modifié en utilisant l'utilitaire B<chfn>(1).

source: The user's new login directory. If the B<-m> option is given the contents of the current home directory will be moved to the new home directory, which is created if it does not already exist.
fr: Le nouveau répertoire de connexion de l'utilisateur. Si l'option B<-m> est fournie, le contenu du répertoire personnel actuel sera déplacé dans le nouveau répertoire personnel, qui sera créé si nécessaire.

source: The group name or number of the user's new initial login group. The group name must exist. A group number must refer to an already existing group. The default group number is 1.
fr: Le nom du groupe ou l'identifiant numérique du groupe de connexion initial de l'utilisateur. Le nom du groupe doit exister. Un numéro de groupe doit se référer à un groupe préexistant. Le numéro de groupe par défaut est de 1.

source: A list of supplementary groups which the user is also a member of. Each group is separated from the next by a comma, with no intervening whitespace. The groups are subject to the same restrictions as the group given with the B<-g> option. If the user is currently a member of a group which is not listed, the user will be removed from the group
fr: Une liste de groupes supplémentaires auxquels fait également partie l'utilisateur. Les groupes sont séparés par une virgule, sans espace entre eux. Les groupes sont soumis aux mêmes restrictions que celles données avec l'option B<-g>. Si l'utilisateur fait actuellement partie d'un groupe qui n'est pas listé, l'utilisateur sera supprimé du groupe.

source: B<-l >I<login_name>
fr: B<-l> I<nom_utilisateur>

source: The name of the user will be changed from I<login> to I<login_name>. Nothing else is changed. In particular, the user's home directory name should probably be changed to reflect the new login name.
fr: Le nom de l'utilisateur passera de I<utilisateur> à I<nom_utilisateur>. Rien d'autre n'est modifié. En particulier, le répertoire personnel de l'utilisateur devra probablement être changé pour refléter le nouveau nom de connexion.

source: The encrypted password, as returned by B<crypt>(3).
fr: Le mot de passe chiffré, comme renvoyé par B<crypt>(3).

source: The name of the user's new login shell. Setting this field to blank causes the system to select the default login shell.
fr: Le nom du nouvel interpréteur de commandes initial («\ login shell\ ») de l'utilisateur. Si le champ est vide, le système sélectionnera l'interpréteur de commandes initial par défaut.

source: The numerical value of the user's ID. This value must be unique, unless the I<-o> option is used. The value must be non-negative. Values between 0 and 99 are typically reserved for system accounts. Any files which the user owns and which are located in the directory tree rooted at the user's home directory will have the file user ID changed automatically. Files outside of the user's home directory must be altered manually.
fr: La valeur numérique de l'identifiant de l'utilisateur. Cette valeur doit être unique, à moins que l'option B<-o> ne soit utilisée. La valeur ne doit pas être négative. Les valeurs comprises entre 0 et 99 sont généralement réservées aux comptes système. Tous les fichiers possédés par l'utilisateur et qui sont situés dans le répertoire personnel de l'utilisateur verront leur identifiant utilisateur automatiquement modifié. Vous devrez rechercher et modifier vous-même les fichiers situés à l'extérieur du répertoire personnel de l'utilisateur.

source: Lock a user's password. This puts a '!' in front of the encrypted password, effectively disabling the password. You can't use this option with I<-p> or I<-U>.
fr: Verrouille le mot de passe d'un utilisateur. Cette option ajoute un «\ !\ » devant le mot de passe chiffré, ce qui désactive le mot de passe. Vous ne pouvez pas utiliser cette option avec B<-p> ou B<-U>.

source: Unlock a user's password. This removes the '!' in front of the encrypted password. You can't use this option with I<-p> or I<-L>.
fr: Déverrouille le mot de passe d'un utilisateur. Cela supprime le «\ !\ » situé devant le mot de passe chiffré. Vous ne pouvez pas utiliser cette option avec B<-p> ou B<-L>.

source: B<usermod> will not allow you to change the name of a user who is logged in. You must make certain that the named user is not executing any processes when this command is being executed if the user's numerical user ID is being changed. You must change the owner of any crontab files manually. You must change the owner of any at jobs manually. You must make any changes involving NIS on the NIS server.
fr: B<Usermod> ne vous permet pas de modifier le nom d'un utilisateur qui est actuellement connecté. Vous devez être sûr que l'utilisateur nommé n'est pas en train d'exécuter un quelconque programme quand cette commande est exécutée si l'UID numérique de l'utilisateur est modifié. Vous devez modifier vous-même le nom du propriétaire de tous les fichiers I<crontab> et des tâches I<at>. Vous devez effectuer les modifications impliquant NIS sur le serveur NIS.

source: userdel - Delete a user account and related files
fr: userdel - supprime un compte utilisateur et les fichiers associés

source: B<userdel> [B<-r>] I<login>
fr: B<userdel> [B<-r>] I<utilisateur>

source: The B<userdel> command modifies the system account files, deleting all entries that refer to I<login>. The named user must exist. The options which apply to the B<userdel> command are:
fr: La commande B<userdel> modifie les fichiers d'administration des comptes du système, en supprimant toutes les entrées qui se réfèrent à I<utilisateur>. L'utilisateur nommé doit exister.

source: Files in the user's home directory will be removed along with the home directory itself and the user's mail spool. Files located in other file systems will have to be searched for and deleted manually.
fr: Les fichiers présents dans le répertoire personnel de l'utilisateur seront supprimés en même temps que le répertoire lui-même. Vous devrez rechercher et éliminer vous-même les fichiers situés dans d'autres systèmes de fichiers.

source: 1 - can't update password file
fr: 1 - ne peut pas mettre à jour le fichier des mots de passe

source: 6 - specified user doesn't exist
fr: 6 - l'utilisateur spécifié n'existe pas

source: 8 - user currently logged in
fr: 8 - l'utilisateur est actuellement connecté

source: 12 - can't remove home directory
fr: 12 - ne peut pas supprimer le répertoire personnel
