Repository: hallyn/shadow-debian
Catalog: 4.0.3-33/po/*.po
Languages: ja, sk

source: Root password:
ja: root のパスワード:
sk: Heslo používateľa root:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
ja: 'root' (システム管理者アカウント) のパスワードをここで設定する必要があります。悪意のある、あるいは資格のないユーザが root 権限を得てしまうことは大損害につながるので、root のパスワードは簡単に推測できるものにならないよう注意を払うべきです。辞書に載っている単語や、あなたのミドルネームのようにあなたに関連する語であってはなりません。良いパスワードとは、アルファベット・数字・記号などで混成され、さらに定期的に変更されるものです。root のパスワードは、root アカウントで 'passwd' コマンドを実行すると変更できます。
sk: Pre správcu systému - používateľa 'root' musíte nastaviť heslo. Zlomyseľný alebo neskúsený používateľ s prístupovými právami root-a môže v systéme napáchať neuveriteľné škody, takže by ste mali zvoliť heslo pre root-a čo najviac neuhádnuteľné. To znamená, že by to nemalo byť slovo zo slovníka, ani údaj, ktorý sa s vami dá ľahko spojiť (napr. prezývka). Dobré heslo obsahuje zmes písmen, číslic a ďalších znakov a malo by byť pravidelne menené. Heslo root-a môžete zmeniť príkazom 'passwd', ktorý spustíte ako používateľ root.

source: Note that you will not be able to see the password as you type it.
ja: パスワードの入力時はパスワードが表示されないことに注意してください。
sk: Uvedomte si, že pri písaní sa heslo nezobrazuje.

source: Please enter the same root password again to verify that you have typed it correctly.
ja: 確認のために、先ほど入力した同じ root のパスワードを再度入力してください。
sk: Zadajte, prosím, znovu heslo pre root-a, aby ste sa presvedčili, že ste ho zadali správne.

source: Create a normal user account now?
ja: ここで一般ユーザアカウントを作成しますか?
sk: Môžem teraz vytvoriť účet pro normálneho používateľa?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
ja: root アカウントで電子メールのやりとりなどの日常業務を行うべきではありません。なぜなら、どんな小さなミスでも取り返しのつかない結果を招くからです。ここで、このような日常業務を行うための一般ユーザアカウントを作成しましょう。
sk: Je veľmi zlým zvykom používať účet root-a pre každodennú prácu, ako je napr. čítanie elektronickej pošty, pretože aj malý preklep môže spôsobiť veľké škody. Na každodennú prácu by ste si mali vytvoriť účet pre normálneho používateľa.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
ja: Debian システムのインストール後でも、(追加ユーザアカウントの作成と同様に) あなたのユーザアカウントを作成することができます。root アカウントで 'adduser <ユーザ名>' と入力してください。<ユーザ名> は 'imurdock' や 'rms' のようなアカウントの名称です。
sk: Tento a ďalšie účty môžete vytvoriť neskôr ako root pomocou príkazu 'adduser <meno>', kde <meno> je používateľské meno ako napr. 'imurdock' alebo 'rms'.

source: Enter a username for your account:
ja: あなたのアカウント名を入力してください:
sk: Zadajte používateľské meno pre nový účet:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
ja: 新しいアカウントのユーザ名を選んでください。あなたのファーストネームを使うのは妥当な選択です。ユーザ名の先頭は小文字アルファベットでなければならず、数字・小文字アルファベットの任意の組合わせで構成されます。
sk: Zvoľte si používateľské meno pre nový účet. Rozumnou voľbou by mohlo byť vaše krstné meno. Používateľské mená by mali začínať malým písmenom, za ktorým môže nasledovať ľubovoľná kombinácia čísel a malých písmen.

source: Invalid username entered.
ja: 無効なユーザ名が入力されました。
sk: Bolo zadané chybné používateľské meno.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
ja: 入力されたユーザ名は無効です。 ユーザ名は数字・小文字アルファベットの任意の組合わせで構成されます。ユーザ名の先頭は小文字アルファベットでなければなりません。
sk: Používateľské meno, ktoré ste zadali, je neplatné. Používateľské mená musia začínať malým písmenom, za ktorým môže nasledovať ľubovoľná kombinácia čísel a malých písmen.

source: Enter a full name for the new user:
ja: 新しいユーザアカウントの本名 (フルネーム) を入力してください:
sk: Zadajte meno a priezvisko nového používateľa:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
ja: ユーザアカウントは非管理者権限で、root アカウントの代わりとして使うために作成されます。
sk: Teraz bude vytvorený používateľský účet, ktorý by ste mali používať namiesto root účtu na bežnú prácu a nesprávcovské veci.

source: Enter a password for the new user:
ja: 新しいユーザアカウントのパスワードを入力してください:
sk: Zadajte heslo pre nového používateľa:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
ja: 良いパスワードは、アルファベット・数字・記号で構成されます。また、ユーザは定期的にパスワードが変更するのが理想的です。
sk: Dobré heslo obsahuje zmes písmen, číslic a ďalších znakov a malo by byť pravidelne menené.

source: Re-enter password to verify:
ja: 確認のため、再度パスワードを入力してください:
sk: Znovu zadajte heslo pre overenie:

source: Please enter the same user password again to verify you have typed it correctly.
ja: 確認のため、先ほど入力したのと同じユーザパスワードを再度正確に入力してください。
sk: Zadajte, prosím, rovnaké heslo, aby ste si overili, či ste ho zadali správne.

source: Password input error.
ja: パスワード入力エラー。
sk: Chyba pri zadávaní hesla.

source: The two passwords you entered were not the same. Please try again.
ja: 2回入力されたパスワードは同じではありません。再度入力してください。
sk: Zadané heslá nie sú rovnaké. Skúste to znova.

source: Empty password was entered.
ja: 空パスワードが入力されました。
sk: Bolo zadané prázdne heslo.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
ja: パスワードに何も入力されなかったようです。これは危険です! 再度入力してください。
sk: Zdá sa, že ste zadali prázdne heslo. To nie je bezpečné! Skúste to znova.

source: Enable shadow passwords?
ja: シャドーパスワードを有効にしますか?
sk: Mám povoliť tieňové (shadow) heslá?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
ja: シャドーパスワードを使うと、暗号化されたパスワード情報さえ誰も見ることができなくなり、システムがより安全になります。パスワード情報は、特別なプログラムしか参照できない別ファイルに保存されます。シャドーパスワードの導入を推奨しますが、NIS を使用する場合は問題が発生する可能性があります。
sk: Tieňové heslá zvyšujú bezpečnosť systému, pretože sú uložené v samostatnom súbore, ktorý môžu čítať iba vybrané programy. Nikto tak nemôže čítať zašifrované heslá iných používateľov. Použitie tieňových hesiel možno iba odporučiť. Problém by mohol nastať iba pri použití NIS.

source: Enable md5 passwords?
ja: md5 パスワードを有効にしますか?
sk: Mám povoliť md5 heslá?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
ja: MD5 パスワード情報は通常のパスワード情報よりも安全で、しかも8文字を越えるパスワードが利用できるようになります (通常のパスワード情報は8文字の字数制限があります)。しかしながら、NIS を利用する場合や古いシステムとパスワードを共用する場合は、互換性問題の原因になり得ます。
sk: Md5 heslá sú bezpečnejšie a umožňujú použiť heslá dlhšie ako 8 znakov. Bohužiaľ môžu spôsobiť problémy pri použití NIS alebo pri zdieľaní súboru hesiel so staršími systémami.
