Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge9/po/*.po
Languages: pl, uk

source: %s: error updating password dbm entry
pl: %s: b³±d podczas aktualizacji wpisu dbm do pliku z has³ami
uk: %s: помилка оновлення запису у баз╕ парол╕в dbm

source: %s: error adding new shadow password entry
pl: %s: b³±d podczas dodawania nowego wpisu do pliku z ukrytymi has³ami
uk: %s: помилка додання нового запису у базу прихованих парол╕в

source: %s: error updating shadow passwd dbm entry
pl: %s: b³±d podczas aktualizacji wpisu dbm do pliku z ukrytymi has³ami
uk: %s: помилка оновлення запису у баз╕ прихованих парол╕в dbm

source: %s: cannot create directory %s
pl: %s: nie mogê utworzyæ katalogu %s
uk: %s: неможливо створити теку %s

source: %s: user %s exists
pl: %s: u¿ytkownik %s istnieje
uk: %s: користувач %s ╕сну╓

source: %s: group %s exists - if you want to add this user to that group, use -g.
pl: %s: grupa %s istnieje - je¶li chcesz dodaæ do niej u¿ytkownika, u¿yj -g.
uk: %s: група %s ╕сну╓ - якщо ви бажа╓те додати користувача до ц╕╓╖ групи, використовуйте -g.

source: %s: warning: CREATE_HOME not supported, please use -m instead.
pl: %s: ostrze¿enie: CREATE_HOME nieobs³ugiwane, proszê u¿yæ -m.
uk: %s: застереження: CREATE_HOME не п╕дтриму╓ться, користуйтесь -m.

source: usage: %s [-r] name
pl: u¿ycie: %s [-r] nazwa
uk: використання: %s [-r] ╕м'я

source: %s: error updating group entry
pl: %s: b³±d podczas aktualizacji wpisu grupy
uk: %s: помилка оновлення запису у баз╕ груп

source: %s: cannot update dbm group entry
pl: %s: nie mogê zaktualizowaæ wpisu dbm do pliku z grupami
uk: %s: неможливо оновити запис у баз╕ груп dbm

source: %s: cannot remove dbm group entry
pl: %s: nie mogê usun±æ wpisu dbm z pliku z grupami
uk: %s: неможливо видалити запис ╕з бази груп dbm

source: %s: cannot rewrite TCFS key file
pl: %s: nie mogê przepisaæ pliku klucza TCFS
uk: %s: неможливо переписати файл ключ╕в TCFS

source: %s: cannot lock TCFS key file
pl: %s: nie mogê zablokowaæ pliku klucza TCFS
uk: %s: неможливо блокувати файл ключ╕в TCFS

source: %s: cannot open TCFS key file
pl: %s: nie mogê otworzyæ pliku klucza TCFS
uk: %s: неможливо в╕дкрити файл ключ╕в TCFS

source: %s: cannot open group file
pl: %s: nie mogê otworzyæ pliku z grupami
uk: %s: неможливо в╕дкрити файл груп

source: %s: cannot open shadow group file
pl: %s: nie mogê otworzyæ pliku z przes³oniêtymi grupami
uk: %s: неможливо в╕дкрити файл прихованих груп

source: %s: error deleting authentication
pl: %s: b³±d podczas usuwania informacji uwierzytelniaj±cej
uk: %s: помилка видалення методу аутентиф╕кац╕╖

source: %s: error deleting password entry
pl: %s: b³±d podczas usuwania wpisu do pliku z has³ami
uk: %s: помилка видалення запису з бази парол╕в

source: %s: error deleting shadow password entry
pl: %s: b³±d podczas usuwania wpisu do pliku z ukrytymi has³ami
uk: %s: помилка видалення запису з бази прихованих парол╕в

source: %s: error deleting TCFS entry
pl: %s: b³±d podczas usuwania wpisu TCFS
uk: %s: помилка видалення запису з бази TCFS

source: %s: error deleting password dbm entry
pl: %s: b³±d podczas usuwania wpisu dbm do pliku z has³ami
uk: %s: помилка видалення запису dbm з бази парол╕в

source: %s: error deleting shadow passwd dbm entry
pl: %s: b³±d podczas usuwania wpisy dbm z pliku z ukrytymi has³ami
uk: %s: помилка видалення запису dbm з бази прихованих парол╕в

source: %s: user %s is currently logged in
pl: %s: u¿ytkownik %s jest aktualnie zalogowany
uk: %s: користувач %s на даний момент у систем╕

source: %s: warning: %s not owned by %s, not removing
pl: %s: ostrze¿enie: w³a¶cicielem %s nie jest %s, nie usuwam
uk: %s: застереження: %s не належить %s, не видалено

source: %s: warning: can't remove
pl: %s: ostrze¿enie: nie mogê usun±æ
uk: %s: застереження: неможливо видалити

source: %s: user %s does not exist
pl: %s: u¿ytkownik %s nie istnieje
uk: %s: користувач %s не ╕сну╓

source: %s: user %s is a NIS user
pl: %s: u¿ytkownik %s jest u¿ytkownikiem NIS
uk: %s: користувач %s ╓ користувачем NIS

source: %s: %s not owned by %s, not removing
pl: %s: w³a¶cicielem %s nie jest %s, nie usuwam
uk: %s: %s не належить %s, не видалено

source: %s: not removing directory %s (would remove home of user %s)
pl: %s: nie usuwam katalogu %s (would remove home of user %s)
uk: %s: не видалено теку %s (можна видалити домашню теку користувача %s)

source: %s: error removing directory %s
pl: %s: b³±d podczas usuwania katalogu %s
uk: %s: помилка видалення теки %s

source: [-d home [-m]] [-s shell] [-c comment] [-l new_name]
pl: [-d kat_dom [-m]] [-s pow³oka] [-c komentarz] [-l nowa_nazwa]
uk: [-d домашня_тека [-m]] [-s оболонка] [-c коментар] [-l нове_╕м'я]

source: [-A {DEFAULT|program},... ]
uk: [-A {DEFAULT|програма},...]

source: [-p passwd] [-L|-U] name
pl: [-p has³o] [-L|-U] nazwa
uk: [-p пароль] [-L|-U] ╕м'я

source: %s: out of memory in update_group
pl: %s: zabrak³o pamiêci w pdate_group
uk: %s: браку╓ пам'ят╕ у update_group

source: %s: out of memory in update_gshadow
pl: %s: zabrak³o pamiêci w update_gshadow
uk: %s: браку╓ пам'ят╕ у update_gshadow

source: %s: no flags given
pl: %s: nie podano flag
uk: %s: не дан╕ прапорц╕

source: %s: shadow passwords required for -e and -f
pl: %s: ukryte has³a wymagane dla -e i -f
uk: %s: прихован╕ парол╕ потр╕бн╕ для -e ╕ -f

source: %s: uid %lu is not unique
pl: %s: uid %lu nie jest niepowtarzalny
uk: %s: uid %lu не ╓ ун╕кальним

source: %s: error deleting authentication method
pl: %s: b³±d podczas usuwania metody uwierzytelniania
uk: %s: помилка видалення методу аутентиф╕кац╕╖

source: %s: error changing authentication method
pl: %s: b³±d podczas zmiany metody uwierzytelniania
uk: %s: помилка зам╕ни методу аутентиф╕кац╕╖

source: %s: error changing password entry
pl: %s: b³±d podczas zmiany wpisu w pliku z has³ami
uk: %s: помилка зм╕ни запису в баз╕ парол╕в

source: %s: error removing password entry
pl: %s: b³±d podczas usuwania wpisu z pliku z has³ami
uk: %s: помилка видалення запису з бази парол╕в

source: %s: error adding password dbm entry
pl: %s: b³±d podczas dodawania wpisu dbm do pliku z has³ami
uk: %s: помилка додання запису dbm у базу прихованих парол╕в

source: %s: error removing passwd dbm entry
pl: %s: b³±d podczas usuwania wpisu dbm z pliku z has³ami
uk: %s: помилка видалення запису dbm з бази парол╕в

source: %s: error removing shadow password entry
pl: %s: b³±d podczas usuwania wpisu z pliku z ukrytymi has³ami
uk: %s: помилка видалення запису з бази прихованих парол╕в

source: %s: error removing shadow passwd dbm entry
pl: %s: b³±d podczas usuwania wpisu dbm z pliku z ukrytymi has³ami
uk: %s: помилка видалення запису dbm з бази прихованих парол╕в

source: %s: directory %s exists
pl: %s: katalog %s isnieje
uk: %s: тека %s ╕сну╓

source: %s: can't create %s
pl: %s: nie mogê utworzyæ %s
uk: %s: неможливо створити %s

source: %s: can't chown %s
pl: %s: nie mogê zmieniæ w³a¶ciciela %s
uk: %s: неможливо зм╕нити володаря %s

source: %s: warning: failed to completely remove old home directory %s
pl: %s: ostrze¿enie: ca³kowite usuniêcie starego katalogu domowego %s nie powiod³o siê.
uk: %s: попередження: не вдалося повн╕стю видалити стару домашню директор╕ю %s

source: %s: cannot rename directory %s to %s
pl: %s: nie mogê zmieniæ nazwy katalogu z %s na %s
uk: %s: неможливо перейменувати теку з %s на %s

source: %s: warning: %s not owned by %s
pl: %s: ostrze¿enie: w³a¶cicielem %s nie jest %s
uk: %s: застереження: %s не належить %s

source: failed to change mailbox owner
pl: nie powiod³a siê zmiana w³a¶ciciela skrzynki pocztowej
uk: неможливо зм╕нити володаря поштово╖ скриньки

source: failed to rename mailbox
pl: zmiana nazwy skrzynki pocztowej nie powiod³a siê
uk: неможливо перейменувати поштову скриньку

source: %s: %s is unchanged
pl: %s: %s jest niezmieniony
uk: %s: %s не зм╕нений

source: Couldn't lock file
pl: Nie mo¿na zablokowaæ pliku
uk: Неможливо блокувати файл

source: Couldn't make backup
pl: Nie mo¿na wykonaæ kopii zapasowej
uk: Неможливо зробити резервну коп╕ю

source: %s: can't restore %s: %s (your changes are in %s)
pl: %s: nie mogê odzyskaæ %s: %s (twoje zmiany s± w %s)
uk: %s: неможливо в╕дновити %s: %s (ваш╕ зм╕ни у %s)

source: Usage: `vipw' edits /etc/passwd `vipw -s' edits /etc/shadow `vigr' edits /etc/group `vigr -s' edits /etc/gshadow
pl: U¿ycie: `vipw' edytuje /etc/passwd `vipw -s' edytuje /etc/shadow `vigr' edytuje /etc/group `vigr -s' edytuje /etc/gshadow
uk: Використання: `vipw' редагу╓ /etc/passwd `vipw -s' редагу╓ /etc/shadow `vigr' редагу╓ /etc/group `vigr -s' редагу╓ /etc/gshadow
