Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge9/po/*.po
Languages: pl, uk

source: group %s: no user %s
pl: grupa %s: nie ma u¿ytkownika %s
uk: група %s: не м╕стить користувача %s

source: delete member `%s'?
pl: skasowaæ cz³onka `%s'?
uk: видалити члена `%s'?

source: invalid shadow group file entry
pl: nieprawid³owy wpis do pliku z ukrytymi has³ami
uk: нев╕рний запис у файл╕ прихованих груп

source: duplicate shadow group entry
pl: duplikuj±cy siê wpis w pliku ukrytych grup
uk: повторн╕ записи у файл╕ прихованих груп

source: no matching group file entry
pl: brak pasuj±cego wpisu w pliku grup
uk: в╕дсутн╕й в╕дпов╕дний запис у файл╕ груп

source: shadow group %s: no administrative user %s
pl: ukryta grupa %s: brak u¿ytkownika administracyjnego %s
uk: прихована група %s: не ма╓ адм╕н╕стратора %s

source: delete administrative member `%s'?
pl: usun±æ cz³onka administracyjnego `%s'?
uk: видалити адм╕н╕стратора `%s'?

source: shadow group %s: no user %s
pl: ukryta grupa %s: nie ma u¿ytkownika %s
uk: прихована група %s: не м╕стить користувача %s

source: %s: cannot update file %s
pl: %s: nie mogê zaktualizowaæ pliku %s
uk: %s: неможливо оновити файл %s

source: %s: the files have been updated; run mkpasswd
pl: %s: pliki zosta³y zaktualizowane; uruchom mkpasswd
uk: %s: файли були оновлен╕; виконайте mkpasswd

source: %s: no changes
pl: %s: bez zmian
uk: %s: без зм╕н

source: %s: the files have been updated
pl: %s: pliku zost³y zaktualizowane
uk: %s: файли були оновлен╕

source: %s: can't lock group file
pl: %s: nie mogê zablokowaæ pliku z grupami
uk: %s: неможливо блокувати файл груп

source: %s: can't open group file
pl: %s: nie mogê otworzyæ pliku z grupami
uk: %s: неможливо в╕дкрити файл груп

source: %s: can't lock shadow group file
pl: %s: nie mogê zablokowaæ pliku z przes³oniêtymi grupami
uk: %s: неможливо блокувати файл прихованих груп

source: %s: can't open shadow group file
pl: %s: nie mogê otworzyæ pliku z przes³oniêtymi grupami
uk: %s: неможливо в╕дкрити файл прихованих груп

source: %s: can't remove shadow group %s
pl: %s: nie mogê usun±æ ukrytej grupy %s
uk: %s: неможливо видалити приховану групу %s

source: %s: can't update shadow entry for %s
pl: %s: nie mogê zaktualizowaæ wpisu ukrytej grupy dla %s
uk: %s: неможливо оновити прихований запис для %s

source: %s: can't update entry for group %s
pl: %s: nie mogê zaktualizowaæ wpisu dla grupy %s
uk: %s: неможливо оновити запис для групи %s

source: %s: can't update shadow group file
pl: %s: nie mogê zaktualizowaæ pliku z ukrytymi grupami
uk: %s: неможливо оновити файл прихованих груп

source: %s: can't update group file
pl: %s: nie mogê zaktualizowaæ pliku z grupami
uk: %s: неможливо оновити файл груп

source: %s: not configured for shadow group support.
pl: %s: nie skonfigurowany dla wsparcia ukrytych grup.
uk: %s: не сконф╕гуровано для п╕дтримки прихованих груп.

source: %s: can't delete shadow group file
pl: %s: nie mogê skasowaæ pliku z ukrytymi grupami
uk: %s: неможливо видалити файл прихованих груп

source: usage: id [-a]
pl: u¿ycie: id [-a]
uk: використання: id [-a]

source: usage: id
pl: u¿ycie: id
uk: використання: id

source: groups=
pl: grupy=
uk: групи=

source: Usage: %s [<-u|--login> login-name] [<-t|--time> days] [<-h|--help>]
pl: U¿ycie: %s [<-u|--login> login] [<-t|--time> dni] [<-h|--help>]
uk: Використання: %s [<-u|--login> login] [<-t|--time> дн╕] [<-h|--help>]

source: Username Port From Latest
pl: U¿ytkownik Port Z Ostatnio
uk: Користувач Порт Зв╕дки Останн╕й вх╕д

source: Username Port Latest
pl: U¿ytkownik Port Ostatnio
uk: Користувач Порт Останн╕й вх╕д

source: **Never logged in**
pl: **Nigdy nie zalogowany**
uk: **Н╕коли не входив**

source: usage: %s [-p] [name]
pl: u¿ycie: %s [-p] [nazwa]
uk: використання: %s [-p] [╕м'я]

source: %s [-p] [-h host] [-f name]
pl: %s [-p] [-h host] [-f nazwa]
uk: %s [-p] [-h вузол] [-f ╕м'я]

source: %s [-p] -r host
uk: %s [-p] -r вузол

source: Invalid login time
pl: Nieprawid³owy czas logowania
uk: Нев╕рний час для входу

source: System closed for routine maintenance
pl: System zamkniêty do rutynowej konserwacji.
uk: Систему закрито для проф╕лактики.

source: [Disconnect bypassed -- root login allowed.]
pl: [Roz³±czenie pominiête -- zezwolenie na logowanie siê root-a.]
uk: [Пройшло в╕дключення -- дозволено вх╕д root-a.]

source: Login timed out after %d seconds.
pl: Limit czasu logowania przekroczony po %d sekundach.
uk: Час лог╕ну вичерпаний за %d секунд.

source: on `%.100s' from `%.200s'
pl: na `%s.100s' z `%.200s'
uk: на `%.100s' з `%.200s'

source: on `%.100s'
pl: na `%.100s'
uk: на `%.100s'

source: TOO MANY LOGIN TRIES (%d)%s FOR `%s'
pl: ZBYT WIELE PROB LOGOWANIA (%d)%s DLA `%s'
uk: ЗАБАГАТО СПРОБ ВХОДУ (%d)%s ДЛЯ `%s'

source: Maximum number of tries exceeded (%d)
pl: Maksymalna liczba prób przekroczona (%d)
uk: Перевищення максимально╖ к╕лькост╕ спроб (%d)

source: login: abort requested by PAM
pl: login: anulowanie ¿±dane przez PAM
uk: login: PAM запросив переривання

source: PAM_ABORT returned from pam_authenticate()
pl: pam_authenticate() zwróci³o PAM_ABORT
uk: PAM_ABORT повернено з pam_authenticate()

source: FAILED LOGIN (%d)%s FOR `%s', %s
pl: NIEUDANE LOGOWANIE (%d)%s DLA `%s', %s
uk: НЕВДАЛИЙ ВХ╤Д (%d)%s ДЛЯ `%s', %s

source: Login incorrect
pl: Nieprawid³owe logowanie
uk: Нев╕рний лог╕н

source: Warning: login re-enabled after temporary lockout.
pl: Ostrze¿enie: logowanie ponownie odblokowanie po czasowej blokadzie.
uk: Попередження: обл╕ковий запис поновлений п╕сля тимчасового блокування.

source: Last login: %s on %s
pl: Ostatnie logowanie: %s na %s
uk: Останн╕й вх╕д в систему: %s на %s

source: Last login: %.19s on %s
pl: Ostatnie logowanie: %s na %s
uk: Останн╕й вх╕д в систему: %.19s на %s

source: from %.*s
pl: z %.*s
uk: з %.*s

source: Starting rad_login
pl: Startujê rad_login
uk: Запуска╓ться rad_login

source: %s: no DBM database on system - no action performed
pl: %s: nie ma bazy DBM na tym systemie - ¿adna akcja nie zosta³a podjêta
uk: %s: нема╓ DBM бази даних у систем╕ - н╕як╕ д╕╖ не виконан╕

source: %s: cannot overwrite file %s
pl: %s: nie mogê nadpisaæ pliku %s
uk: %s: неможливо перезаписати файл %s

source: %s: cannot open DBM files for %s
pl: %s: nie mogê otworzyæ plików DBM dla %s
uk: %s: неможливо в╕дкрити файли DBM для %s

source: %s: the beginning with
pl: %s: rozpoczyna siê od
uk: %s: розпочина╓мо з

source: is too long
pl: jest za d³ugie
uk: ╓ задовгим

source: %s: error parsing line "%s"
pl: %s: b³±d podczas przetwarzania lini "%s"
uk: %s: помилка обробки рядка "%s"

source: adding record for name
pl: dodajê rekord do nazwy
uk: дода╓ться запис для ╕мен╕

source: %s: error adding record for
pl: %s: b³±d podczas dodawania rekordu dla
uk: %s: помилка додання запису для

source: added %d entries, longest was %d
pl: dodano %d wpisów, najd³u¿szy by³ %d
uk: додано %d запис╕в, найдовший %d

source: Usage: %s [-vf] [-p|g|sp|sg] file
pl: U¿ycie: %s [-vf] [-p|g|sp|sg] plik
uk: Використання: %s [-vf] [-p|g|sp|sg] файл

source: Usage: %s [-vf] [-p|g|sp] file
pl: U¿ycie: %s [-vf] [-p|g|sp] plik
uk: Використання: %s [-vf] [-p|g|sp] файл

source: Usage: %s [-vf] [-p|g] file
pl: U¿ycie: %s [-vf] [-p|g] plik
uk: Використання: %s [-vf] [-p|g] файл

source: usage: newgrp [-] [group]
pl: u¿ycie: newgrp [-] [grupa]
uk: використання: newgrp [-] [група]

source: usage: sg group [[-c] command]
pl: u¿ycie: sg grupa [[-c] polecenie]
uk: використання: sg група [[-c] команда]

source: unknown uid: %u
pl: nieznany uid: %u
uk: нев╕домий uid: %u

source: unknown gid: %lu
pl: nieznany gid: %lu
uk: нев╕домий gid: %lu

source: Sorry.
pl: Wybacz.
uk: Вибачте.

source: too many groups
pl: zbyt wiele grup
uk: занадто багато груп

source: Usage: %s [input]
pl: U¿ycie: %s [wej¶cie]
uk: Використання: %s [input]

source: %s: can't lock /etc/passwd.
pl: %s: nie mogê zablokowaæ /etc/passwd.
uk: %s: неможливо блокувати /etc/passwd.

source: %s: can't lock files, try again later
pl: %s: nie mogê zablokowaæ plików, spróbuj pó¼niej
uk: %s: неможливо блокувати файли, спробуйте п╕зн╕ше

source: %s: can't open files
pl: %s: nie mogê otworzyæ plików
uk: %s: неможливо в╕дкрити файли

source: %s: line %d: invalid line
pl: %s: linia %d: nieprawid³owa linia
uk: %s: рядок %d: нев╕рний рядок

source: %s: line %d: can't create GID
pl: %s: linia %d: nie mogê utworzyæ GID
uk: %s: рядок %d: неможливо створити GID

source: %s: line %d: can't create UID
pl: %s: linia %d: nie mogê utworzyæ UID
uk: %s: рядок %d: неможливо створити UID

source: %s: line %d: cannot find user %s
pl: %s: linia %d: nie mogê znale¶æ u¿ytkownika %s
uk: %s: рядок %d: неможливо знайти користувача %s

source: %s: line %d: can't update password
pl: %s: linia %d: nie mogê zaktualizowaæ pliku z has³ami
uk: %s: рядок %d: неможливо оновити пароль

source: %s: line %d: mkdir failed
pl: %s: linia %d: mkdir nie powiod³o siê
uk: %s: рядок %d: mkdir не виконався

source: %s: line %d: chown failed
pl: %s: linia %d: chown nie powiod³o siê
uk: %s: рядок %d: chown не виконався

source: %s: line %d: can't update entry
pl: %s: linia %d: nie mogê zaktualizowaæ wpisu
uk: %s: рядок %d: неможливо оновити запис

source: %s: error updating files
pl: %s: b³±d podczas aktualizowania plików
uk: %s: помилка оновлення файл╕в

source: usage: %s [-f|-s] [name]
pl: u¿ycie: %s [-f|-s] [nazwa]
uk: використання: %s [-f|-s] [╕м'я]

source: %s [-x max] [-n min] [-w warn] [-i inact] name
pl: %s [-x maks] [-n min] [-w ostrz] [-i nieakty] nazwa
uk: %s [-x макс] [-n м╕н] [-w застереження] [-i неактивний] ╕м'я

source: %s {-l|-u|-d|-S|-e} name
pl: %s {-l|-u|-d|-S|-e} nazwa
uk: %s {-l|-u|-d|-S|-e} ╕м'я

source: User %s has a TCFS key, his old password is required.
pl: U¿ytkownik %s posiada klucz TCFS, jego stare has³o jest wymagane.
uk: Користувач %s ма╓ TCFS ключ, потр╕бен його старий пароль.

source: You can use -t option to force the change.
pl: Nie mo¿esz u¿ywaæ opcji -t by wymusiæ zmianê.
uk: Ви можете використати ключ -t для примусового внесення зм╕н.

source: Old password:
pl: Stare has³o:
uk: Старий пароль:

source: Incorrect password for `%s'
pl: Nieprawid³owe has³o `%s'
uk: Нев╕рний пароль для `%s'

source: Warning: user %s has a TCFS key.
pl: Ostrze¿enie: u¿ytkownik %s posiada klucz TCFS.
uk: Попередження: користувач %s ма╓ TCFS ключ.

source: Enter the new password (minimum of %d, maximum of %d characters) Please use a combination of upper and lower case letters and numbers.
pl: Wpisz nowe has³o (minimum %d, maksimum %d znaków) Proszê u¿yj kombinacji wielkich i ma³ych znaków oraz cyfr.
uk: Введ╕ть новий пароль (в╕д %d до %d знак╕в) Зм╕шуйте велик╕ та мал╕ л╕тери та цифри.

source: New password:
pl: Nowe has³o:
uk: Новий пароль:

source: Try again.
pl: Spróbuj ponownie.
uk: Спробуйте ще.

source: Warning: weak password (enter it again to use it anyway).
pl: Ostrze¿enie: s³abe has³o (jednak wpisz je ponowie je¶li chcesz go u¿yæ).
uk: Попередження: поганий пароль (введ╕ть його знову, якщо все одно бажа╓те його використовувати).

source: They don't match; try again.
pl: Nie pasuj±; spróbuj ponownie.
uk: Не сп╕впада╓; спробуйте знову.

source: The password for %s cannot be changed.
pl: Has³o dla %s nie mo¿e byæ zmienione.
uk: Пароль для %s не може бути зм╕нений.

source: Sorry, the password for %s cannot be changed yet.
pl: Wybacz, has³o dla %s nie mo¿e byæ jeszcze zmienione.
uk: Вибачте, пароль для %s не може бути зм╕нений зараз.

source: %s: out of memory
pl: %s: brak pamiêci
uk: %s: брак пам'ят╕

source: Cannot lock the TCFS key database; try again later
pl: Nie mogê zablokowaæ bazy kluczy TCFS; spróbuj ponownie
uk: Неможливо блокувати базу ключ╕в TCFS; спробуйте п╕зн╕ше

source: Cannot open the TCFS key database.
pl: Nie mogê otworzyæ bazy kluczy TCFS.
uk: Неможливо в╕дкрити базу ключ╕в TCFS.

source: Error updating the TCFS key database.
pl: B³±d podczas aktualizacji bazy kluczy TCFS.
uk: Неможливо оновити базу ключ╕в TCFS.

source: Cannot commit TCFS changes.
pl: Nie mogê potwierdziæ zmian TCFS.
uk: Неможливо внести зм╕ни у базу ключ╕в TCFS.

source: %s: Cannot execute %s
pl: %s: Nie mogê wykonaæ %s
uk: %s: Неможливо виконати %s

source: %s: repository %s not supported
pl: %s: ropozytorium %s nie jest obs³ugiwane
uk: %s: репозитор╕й %s не п╕дтриму╓ться

source: %s: Permission denied
pl: %s: Dostêp zabroniony
uk: %s: Доступ заборонено

source: %s: You may not view or modify password information for %s.
pl: %s: Nie mo¿esz zobaczyæ lub zmieniæ has³a dla %s.
uk: %s: Ви не можете переглянути або зм╕нити пароль для %s.

source: Changing password for %s
pl: Zmieniam has³o dla %s
uk: Зм╕ню╓ться пароля для %s

source: The password for %s is unchanged.
pl: Has³o dla %s pozostaje niezmienione.
uk: Пароль для %s не зм╕нений.

source: Password changed.
pl: Has³o zmienione.
uk: Пароль зм╕нений.

source: Usage: %s [-q] [-r] [-s] [passwd [shadow]]
pl: U¿ycie: %s [-q] [-r] [-s] [has³o [shadow]]
uk: Використання: %s [-q] [-r] [-s] [passwd [shadow]]

source: Usage: %s [-q] [-r] [-s] [passwd]
pl: U¿ycie: %s [-q] [-r] [-s] [has³o]
uk: Використання: %s [-q] [-r] [-s] [passwd]

source: invalid password file entry
pl: nieprawid³owy wpis do pliku z has³ami
uk: нев╕рний запис у файл╕ парол╕в

source: duplicate password entry
pl: duplikuj±cy siê wpis w pliku z has³ami
uk: дублюючий запис у файл╕ парол╕в

source: invalid user name '%s'
pl: nieprawid³owa nazwa u¿ytkownika '%s'
uk: нев╕рне ╕м'я користувача '%s'

source: user %s: no group %u
pl: u¿ytkownik %s: brak grupy %u
uk: користувач %s: не ма╓ групи %u

source: user %s: directory %s does not exist
pl: u¿ytkownik %s: katalog %s nie istnieje
uk: користувач %s: тека %s не ╕сну╓

source: user %s: program %s does not exist
pl: u¿ytkownik %s: program %s nie istnieje
uk: користувач %s: програма %s не ╕сну╓

source: invalid shadow password file entry
pl: nieprawid³owy wpis w pliku z has³ami
uk: нев╕рний запис у файл╕ прихованих парол╕в

source: duplicate shadow password entry
pl: duplikuj±cy siê wpis w pliku z ukrytymi has³ami
uk: дублюючий запис у файл╕ прихованих парол╕в

source: no matching password file entry
pl: brak pasuj±cego wpisu w pliku z has³ami
uk: в╕дсутн╕й в╕дпов╕дний запис у файл╕ парол╕в

source: user %s: last password change in the future
pl: u¿ytkownik %s: ostatnia zmiana has³a w przysz³o¶ci
uk: користувач %s: остання зм╕на пароля у майбутньому

source: %s: can't lock passwd file
pl: %s: nie mogê zablokowaæ pliku z has³ami
uk: %s: неможливо блокувати файл парол╕в

source: %s: can't open passwd file
pl: %s: nie mogê otworzyæ pliku z has³ami
uk: %s: неможливо в╕дкрити файл парол╕в

source: %s: can't remove shadow entry for %s
pl: %s: nie mogê usun±æ wpisu z pliku z ukrytymi has³ami dla %s
uk: %s: неможливо видалити запис у файл╕ прихованих парол╕в для %s

source: %s: can't update passwd entry for %s
pl: %s: nie mogê zaktualizowaæ wpisu do pliku z has³ami dla %s
uk: %s: неможливо оновити запис у файл╕ парол╕в для %s

source: %s: can't update shadow file
pl: %s: nie mogê zaktualizowaæ pliku z ukrytymi has³ami
uk: %s: неможливо оновити файл прихованих парол╕в

source: %s: can't update passwd file
pl: %s: nie mogê zaktualizowaæ pliku z has³ami
uk: %s: неможливо оновити файл парол╕в

source: %s: Shadow passwords are not configured.
pl: %s: Przes³oniête has³a nie s± skonfigurowane.
uk: %s: Прихован╕ парол╕ не сконф╕гуровано.

source: %s: can't update entry for user %s
pl: %s: nie mogê zaktualizowaæ wpisu dla u¿ytkownika %s
uk: %s: неможливо оновити запис для користувача %s

source: %s: can't delete shadow password file
pl: %s: nie mogê skasowaæ pliku z ukrytymi has³ami
uk: %s: неможливо видалити файл прихованих парол╕в

source: Access to su to that account DENIED.
pl: Dostêp do polecenia su z tego konta ZABRONIONY.
uk: Доступ цього користувача до su ЗАБОРОНЕНО.

source: Password authentication bypassed.
pl: Uwierzytelnianie na podstawie has³a pominiête.
uk: Аутентиф╕кац╕ю пройдено.

source: Please enter your OWN password as authentication.
pl: Proszê wpisz swoje W£ASNE has³o jako has³o uwierzytelniaj±ce.
uk: Будь ласка введ╕ть ваш ВЛАСНИЙ пароль для аутентиф╕кац╕╖.

source: Command line args too long
pl: Argumenty linii poleceñ zbyt d³ugie
uk: Аргументи командного рядка занадто довг╕

source: No shell
pl: Brak pow³oki
uk: Нема╓ оболонки

source: Sorry.
pl: Wybacz.
uk: Вибачте.

source: %s: must be run from a terminal
pl: %s: musisz uruchamiaæ z terminala
uk: %s: повинно бути запущено з терм╕налу

source: Usage: su [OPTS] [-] [username [ARGS]] - make this a login shell -c, --command=<command> pass command to the invoked shell using its -c option -m, -p, --preserve-environment do not reset environment variables, and keep the same shell -s, --shell=<shell> use shell instead of the default in /etc/passwd
pl: U¿ycie: su [OPCJE] [-] [username [ARGUMENTY]] - uczyñ to pow³ok± logowania -c, --command=<polecenie> przeka¿ polecenie do wywo³anej pow³oki u¿ywaj±c jej opcji -c -m, -p, --preserve-environment nie resetuj zmiennych ¶rodowiskowych i u¿yj tej samej pow³oki -s, --shell=<pow³oka> u¿yj pow³oki zamiast domy¶lnej z /etc/passwd
uk: Використання: su [опц╕╖] [-] [╕м'я_користувача [аргументи]] - створити login shell -c, --command=<команда> передати команду створен╕й оболонц╕ за допомогою ╖╖ опц╕╖ -c -m, -p, --preserve-environment не скидати зм╕нн╕ оточення та використовувати ту саму оболонку -s, --shell=<оболонка> використовувати оболонку зам╕сть вказано╖ в /etc/passwd

source: %s: pam_start: error %d
pl: %s: pam_start: b³±d %d
uk: %s: pam_start: помилка %d

source: Unknown id: %s
pl: Nieznany id: %s
uk: Нев╕домий id: %s

source: You are not authorized to su %s
pl: Nie masz autoryzacji by u¿ywaæ su %s
uk: Ви не авторизован╕ для su %s

source: (Enter your own password.)
pl: (Wpisz swoje w³asne has³o.)
uk: (Введ╕ть ваш пароль.)

source: %s: %s (Ignored)
pl: %s: %s (Zignorowano)
uk: %s: %s (╤гноровано)

source: No password file
pl: Brak pliku z has³ami
uk: Нема╓ файла парол╕в

source: No password entry for 'root'
pl: Brak wpisu do bazy hase³ dla 'root'
uk: Браку╓ запису у баз╕ парол╕в для 'root'

source: Type control-d to proceed with normal startup, (or give root password for system maintenance):
pl: Wpisz control-d by kontynuowaæ normalny start, (lub podaj has³o root-a by przej¶æ do trybu utrzymania systemu):
uk: Натисн╕ть control-d для виконання звичайного завантаження, (або введ╕ть пароль адм╕н╕стратора для в╕дновлення системи):

source: Entering System Maintenance Mode
pl: Wchodzê w tryb utrzymania systemu
uk: Входимо у режим в╕дновлення системи

source: %s: rebuild the group database
pl: %s: przebuduj bazê grup
uk: %s: перебудову╓ться база груп

source: %s: rebuild the shadow group database
pl: %s: przebuduj bazê przes³oniêtych hase³
uk: %s: перебудову╓ться база прихованих груп

source: %s: invalid numeric argument `%s'
pl: %s: nieprawid³owy argument numeryczny `%s'
uk: %s: нев╕рний числовий аргумент `%s'

source: %s: unknown gid %s
pl: %s: nieznany gid %s
uk: %s: нев╕домий gid %s

source: %s: unknown group %s
pl: %s: nieznana grupa %s
uk: %s: нев╕дома група %s

source: group=%s,%u basedir=%s skel=%s
pl: grupa=%s,%u kat_baz=%s skel=%s
uk: група=%s,%u головна_тека=%s skel=%s

source: shell=%s
pl: pow³oka=%s
uk: оболонка=%s

source: inactive=%ld expire=%s
pl: nieaktywne=%ld wyga¶niêcie=%s
uk: неактивний=%ld просторочений=%s

source: GROUP=%u
pl: GRUPA=%u
uk: ГРУПА=%u

source: HOME=%s
pl: KAT_DOM=%s
uk: ДОМАШНЯ_ТЕКА=%s

source: INACTIVE=%ld
pl: NIEAKTYWNE=%ld
uk: НЕАКТИВНИЙ=%ld

source: EXPIRE=%s
pl: WYGA¦NIÊCIE=%s
uk: ПРОСТРОЧЕНИЙ=%s

source: SHELL=%s
pl: POW£OKA=%s
uk: ОБОЛОНКА=%s

source: %s: cannot create new defaults file
pl: %s: nie mo¿na utworzyæ nowego pliku ze standardowymi ustawieniami
uk: %s: неможливо створити новий файл ╕з значеннями за замовчанням

source: %s: cannot open new defaults file
pl: %s: nie mo¿na utworzyæ nowego pliku ze standardowymi ustawieniami
uk: %s: неможливо створити новий файл ╕з значеннями за замовчанням

source: %s: rename: %s
pl: %s: zmiana nazwy: %s
uk: %s: перейменування: %s

source: %s: group `%s' is a NIS group.
pl: %s: grupa `%s' jest grup± NIS.
uk: %s: група `%s' ╓ групою NIS.

source: %s: too many groups specified (max %d).
pl: %s: podano zbyt wiele grup (maks %d).
uk: %s: вказано занадто багато груп (макс %d).

source: usage: %s [-u uid [-o]] [-g group] [-G group,...]
pl: u¿ycie: %s [-u uid [-o]] [-g grupa] [-G grupa,...]
uk: використання: %s [-u uid [-o]] [-g група] [-G група,...]

source: [-d home] [-s shell] [-c comment] [-m [-k template]]
pl: [-d kat_dom] [-s pow³oka] [-c komentarz] [-m [-k wzór]]
uk: [-d домашня_тека] [-s оболонка] [-c коментар] [-m [-k шаблон]]

source: [-f inactive] [-e expire ]
pl: [-f nieaktywne] [-e utrata_wa¿no¶ci ]
uk: [-f неактивний] [-e прострочений]

source: [-A program]
uk: [-A програма]

source: [-p passwd] name
pl: [-p has³o] nazwa
uk: [-p пароль] ╕м'я

source: %s -D [-g group] [-b base] [-s shell]
pl: %s -D [-g grupa] [-b baza] [-s pow³oka]
uk: %s -D [-g група] [-b базова_тека] [-s оболонка]

source: [-f inactive] [-e expire ]
pl: [-f nieaktywne] [-e utrata_wa¿no¶ci ]
uk: [-f неактивний] [-e прострочений]

source: %s: error locking group file
pl: %s: b³±d podczas blokowania pliku z grupami
uk: %s: помилка блокування файлу груп

source: %s: error opening group file
pl: %s: b³±d podczas otwierania pliku z grupami
uk: %s: помилка в╕дкриття файлу груп

source: %s: error locking shadow group file
pl: %s: b³±d podczas blokowania pliku z ukrytymi has³ami
uk: %s: помилка блокування файлу прихованих груп

source: %s: error opening shadow group file
pl: %s: b³±d podczas otwierania pliku z ukrytymi grupami
uk: %s: помилка в╕дкриття файлу прихованих груп

source: %s: uid %u is not unique
pl: %s: uid %u nie jest niepowtarzalny
uk: %s: uid %u не ╓ ун╕кальним

source: %s: can't get unique uid
pl: %s: nie mogê uzyskaæ niepowtarzalnego uid
uk: %s: неможливо отримати ун╕кальн╕й uid

source: %s: invalid field `%s'
pl: %s: nieprawid³owe pole `%s'
uk: %s: нев╕рне поле `%s'

source: %s: invalid base directory `%s'
pl: %s: nieprawid³owy katalog bazowy `%s'
uk: %s: нев╕рна базова тека `%s'

source: %s: invalid comment `%s'
pl: %s: nieprawid³owy komentarz `%s'
uk: %s: нев╕рний коментар `%s'

source: %s: invalid home directory `%s'
pl: %s: nieprawid³owy katalog domowy `%s'
uk: %s: нев╕рна домашня тека `%s'

source: %s: invalid date `%s'
pl: %s: nieprawid³owa data `%s'
uk: %s: нев╕рна дата `%s'

source: %s: shadow passwords required for -e
pl: %s: ukryte has³a wymagane dla -e
uk: %s: прихован╕ парол╕ потр╕бн╕ для -e

source: %s: shadow passwords required for -f
pl: %s: ukryte has³a wymagane dla -f
uk: %s: прихован╕ парол╕ потр╕бн╕ для -f

source: %s: invalid shell `%s'
pl: %s: nieprawid³owa pow³oka `%s'
uk: %s: нев╕рна оболонка `%s'

source: %s: invalid user name '%s'
pl: %s: nieprawid³owa nazwa u¿ytkownika '%s'
uk: %s: нев╕рне ╕м'я користувача '%s'

source: %s: cannot rewrite password file
pl: %s: nie mogê przepisaæ pliku z has³ami
uk: %s: неможливо переписати файл парол╕в

source: %s: cannot rewrite shadow password file
pl: %s: nie mogê przepisaæ pliku z ukrytymi has³ami
uk: %s: неможливо переписати файл прихованих парол╕в

source: %s: unable to lock password file
pl: %s: nie mogê zablokowaæ pliku z has³ami
uk: %s: неможливо блокувати файл парол╕в

source: %s: unable to open password file
pl: %s: nie mogê otworzyæ pliku z has³ami
uk: %s: неможливо в╕дкрити файл парол╕в

source: %s: cannot lock shadow password file
pl: %s: nie mogê zablokowaæ pliku z ukrytymi has³ami
uk: %s: неможливо блокувати файл прихованих парол╕в

source: %s: cannot open shadow password file
pl: %s: nie mogê otworzyæ pliku z ukrytymi has³ami
uk: %s: неможливо в╕дкрити файл прихованих парол╕в

source: %s: error adding authentication method
pl: %s: b³±d podczas dodawania metody uwierzytelniania
uk: %s: помилка додання методу аутентиф╕кац╕╖

source: %s: error adding new password entry
pl: %s: b³±d podczas dodawania nowego wpisu do pliku z has³ami
uk: %s: помилка додання нового запису у базу парол╕в
