Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge9/po/*.po
Languages: pl, uk

source: Dialup Password:
pl: Has³o dostêpu modemowego:
uk: Пароль для модемного п╕дключення:

source: Could not allocate space for config info.
pl: Nie mogê przydzieliæ miejsca dla informacji o konfiguracji.
uk: Неможливо вид╕лити ресурси для конф╕гурац╕йних даних.

source: configuration error - unknown item '%s' (notify administrator)
pl: b³±d w konfiguracji - nieznana pozycja '%s' (powiadom administratora)
uk: помилка у конф╕гурац╕╖ - нев╕дома позиц╕я '%s' (пов╕домте адм╕н╕стратора)

source: error - lookup '%s' failed
pl: b³±d - wyszukiwanie '%s' nie powiod³o siê
uk: помилка - не вдалося знайти '%s'

source: %s not found
pl: %s nie znaleziony
uk: %s не знайдено

source: Warning: unknown group %s
pl: Ostrze¿enie: nieznana grupa %s
uk: Попередження: нев╕дома група %s

source: Warning: too many groups
pl: Ostrze¿enie: zbyt wiele grup
uk: Попередження: занадто багато груп

source: Your password has expired.
pl: Twoje has³o straci³o wa¿no¶æ.
uk: Ваш пароль застар╕в.

source: Your password is inactive.
pl: Twoje has³o jest nieaktywne.
uk: Ваш пароль ╓ неактивним.

source: Your login has expired.
pl: Twoje konto straci³o wa¿no¶æ.
uk: Ваш обл╕ковий запис застар╕в.

source: Contact the system administrator.
pl: Skontaktuj siê z administratorem systemu.
uk: Зв'яж╕ться з системним адм╕н╕стратором.

source: Choose a new password.
pl: Wybierz nowe has³o.
uk: Вибер╕ть новий пароль.

source: Your password will expire in %ld days.
pl: Twoje has³o straci wa¿no¶æ w ci±gu %ld dni.
uk: Ваш пароль застар╕╓ через %ld дн╕в.

source: Your password will expire tomorrow.
pl: Jutro twoje has³o straci wa¿no¶æ.
uk: Ваш пароль застар╕╓ завтра.

source: Your password will expire today.
pl: Dzi¶ twoje has³o straci wa¿no¶æ.
uk: Ваш пароль застар╕╓ сьогодн╕.

source: Unable to change tty %s
pl: Nie mo¿na zmieniæ tty %s
uk: Неможливо зм╕нити tty %s

source: Environment overflow
pl: Przepe³nienie ¶rodowiska
uk: Переповнення оточення

source: You may not change $%s
pl: Nie mo¿esz zmieniaæ $%s
uk: Ви не можете зм╕нити $%s

source: %d failure since last login. Last was %s on %s.
pl: %d niepowodzenie od ostatniego logowania, które odby³o siê dnia %s na %s.
uk: %d помилка з часу останнього входу. Останн╕й вх╕д: %s з %s.

source: Too many logins.
pl: Zbyt wiele otwartych sesji.
uk: Занадто багато сес╕й.

source: Password does not decrypt secret key for %s.
pl: Tym has³em nie mo¿na zdeszyfrowaæ tajnego klucza dla %s.
uk: Пароль не дешифру╓ та╓мний ключ для %s.

source: Could not set %s's secret key: is the keyserv daemon running?
pl: Nie mogê ustawiæ tajnego klucza dla %s: czy serwer kluczy dzia³a?
uk: Неможливо встановити та╓мний ключ для %s: чи запущений сервер ключ╕в?

source: You have new mail.
pl: Masz now± pocztê.
uk: Ви ма╓те нову пошту.

source: No mail.
pl: Nie masz poczty.
uk: Пошти нема╓.

source: You have mail.
pl: Masz pocztê.
uk: Ви ма╓те пошту.

source: Bad password: %s.
pl: Z³e has³o: %s.
uk: Поганий пароль: %s.

source: passwd: pam_start() failed, error %d
pl: passwd: pam_start() nie powiod³o siê, b³±d %d
uk: passwd: pam_start() не виконано, помилка %d

source: Incorrect password for %s.
pl: Nieprawid³owe has³o dla %s.
uk: Нев╕рний пароль для %s.

source: Unable to cd to "%s"
pl: Nie mogê zmieniæ katalogu na "%s"
uk: Неможливо перейти до теки "%s"

source: No directory, logging in with HOME=/
pl: Brak katalogu, logujê z HOME=/
uk: Нема теки, в╕дкрива╓мо сес╕ю з HOME=/

source: Executing shell %s
pl: Uruchamiam pow³okê %s
uk: Викону╓ться оболонка %s

source: Cannot execute %s
pl: Nie mogê uruchomiæ %s
uk: Неможливо виконати %s

source: Invalid root directory "%s"
pl: Nieprawid³owy katalog g³ówny "%s"
uk: Нев╕рна коренева тека "%s"

source: Can't change root directory to "%s"
pl: Nie mogê zmieniæ g³ównego katalogu na "%s"
uk: Неможливо зм╕нити кореневу теку на "%s"

source: malloc(%d) failed
pl: malloc(%d) nie powiod³o siê
uk: malloc(%d) не виконано

source: Password:
pl: Has³o:
uk: Пароль:

source: %s's Password:
pl: Has³o u¿ytkownika %s:
uk: Пароль користувача %s:

source: (Echo on)
uk: (повторення вв╕мкнене)

source: Usage: %s [-l] [-m min_days] [-M max_days] [-W warn] [-I inactive] [-E expire] [-d last_day] user
pl: U¿ycie: %s [-l] [-m min_dni] [-M maks_dni] [-W ostrze¿] [-I nieaktywne] [-E utrata_wa¿no¶ci] [-d ostatni_dzieñ] u¿ytkownik
uk: Використання: %s [-l] [-m м╕н_дн╕в] [-M макс_дн╕в] [-W застереження] [-I неактивн╕сть] [-E строк_д╕╖] [-d останн╕й_день] користувач

source: Usage: %s [-l] [-m min_days] [-M max_days] [-d last_day] user
pl: U¿ycie: %s [-l] [-m min_dni] [-M maks_dni] [-d ostatni_dzieñ] u¿ytkownik
uk: Використання: %s [-l] [-m м╕н_дн╕в] [-M макс_дн╕в] [-d останн╕й_день] користувач

source: Enter the new value, or press ENTER for the default
pl: Wpisz now± warto¶æ lub wci¶nij ENTER by przyj±æ warto¶æ standardow±
uk: Введ╕ть нове значення, або натисн╕ть ENTER для значення за замовчанням

source: Minimum Password Age
pl: Minimalny wiek has³a
uk: М╕н╕мальний в╕к пароля

source: Maximum Password Age
pl: Maksymalny wiek has³a
uk: Максимальний в╕к пароля

source: Last Password Change (YYYY-MM-DD)
pl: Ostatnia zmiana has³a (RRRR-MM-DD)
uk: Остання зм╕на пароля (РРРР-ММ-ДД)

source: Password Expiration Warning
pl: Ostrze¿enie o utracie wa¿no¶ci has³a
uk: Застереження про прострочення пароля

source: Password Inactive
pl: Has³o nieaktywne
uk: Пароль неактивний

source: Account Expiration Date (YYYY-MM-DD)
pl: Data utraty wa¿no¶ci konta (RRRR-MM-DD)
uk: Дата прострочення рахунку (РРРР-ММ-ДД)

source: Minimum: %ld
uk: М╕н╕мум: %ld

source: Maximum: %ld
pl: Maksimim: %ld
uk: Максимум: %ld

source: Warning: %ld
pl: Ostrze¿enie: %ld
uk: Застереження: %ld

source: Inactive: %ld
pl: Nieaktywne: %ld
uk: Неактивний: %ld

source: Last Change:
pl: Ostatnia zmiana:
uk: Остання зм╕на:

source: Never
pl: Nigdy
uk: Н╕коли

source: Password Expires:
pl: Has³o traci wa¿no¶æ:
uk: Пароль застар╕ва╓:

source: Password Inactive:
pl: Has³o nieaktywne:
uk: Пароль неактивний:

source: Account Expires:
pl: Has³o traci wa¿no¶æ:
uk: Рахунок застар╕ва╓:

source: %s: do not include "l" with other flags
pl: %s: nie ³±cz "l" z innymi flagami
uk: %s: не використовуйте "l" з ╕ншими опц╕ями

source: %s: permission denied
pl: %s: odmowa dostêpu
uk: %s: у доступ╕ в╕дмовлено

source: %s: PAM authentication failed
pl: %s: uwierzytelnianie PAM nie powiod³o siê
uk: %s: PAM аутентиф╕кац╕я не пройшла

source: %s: can't lock password file
pl: %s: nie mogê zablokowaæ pliku z has³ami
uk: %s: неможливо заблокувати файл парол╕в

source: %s: can't open password file
pl: %s: nie mogê otworzyæ pliku z has³ami
uk: %s: неможливо в╕дкрити файл парол╕в

source: %s: unknown user: %s
pl: %s: nieznany u¿ytkownik: %s
uk: %s: нев╕домий користувач: %s

source: %s: can't lock shadow password file
pl: %s: nie mogê zablokowaæ pliku z ukrytymi has³ami
uk: %s: неможливо заблокувати файл прихованих парол╕в

source: %s: can't open shadow password file
pl: %s: nie mogê otworzyæ pliku z ukrytymi has³ami
uk: %s: неможливо в╕дкрити файл прихованих парол╕в

source: Changing the aging information for %s
pl: Zmieniam informacjê o u¿ytkowniku %s
uk: Зм╕ню╓ться в╕кова ╕нформац╕я для %s

source: %s: error changing fields
pl: %s: b³±d podczas zmieniania pól
uk: %s: помилка зам╕ни поля

source: %s: can't update password file
pl: %s: nie mogê zaktualizowaæ pliku z has³ami
uk: %s: неможливо оновити файл парол╕в

source: %s: can't update shadow password file
pl: %s: nie mogê zaktualizowaæ pliku z ukrytymi has³ami
uk: %s: неможливо оновити файл прихованих парол╕в

source: Error updating the DBM password entry.
pl: B³±d podczas aktualizacki bazy hase³ DBM.
uk: Помилка оновлення запису пароля у DBM.

source: %s: can't rewrite shadow password file
pl: %s: nie mogê przepisaæ pliku z ukrytymi has³ami
uk: %s: неможливо переписати файл прихованих парол╕в

source: %s: can't rewrite password file
pl: %s: nie mogê przepisaæ pliku z has³ami
uk: %s: неможливо переписати файл парол╕в

source: %s: PAM chauthtok failed
pl: %s: PAM chauthok nie powiod³o siê
uk: %s: помилка PAM chauthtok

source: Usage: %s [-f full_name] [-r room_no] [-w work_ph] [-h home_ph] [-o other] [user]
pl: U¿ycie: %s [-f imiê_nazwisko] [-r nr_pokoju] [-w tel_praca] [-h tel_dom] [-o inne] [u¿ytkownik]
uk: Використання: %s [-f повне_╕м'я] [-r номер_к╕мнати] [-w робоч╕й_телефон] [-h домашн╕й_телефон] [-o ╕нше] [користувач]

source: Usage: %s [-f full_name] [-r room_no] [-w work_ph] [-h home_ph]
pl: U¿ycie: %s [-f imiê_nazwisko] [-r nr_pokoju] [-w tel_praca] [-h tel_dom]
uk: Використання: %s [-f повне_╕м'я] [-r номер_к╕мнати] [-w робоч╕й_телефон] [-h домашн╕й_телефон]

source: Enter the new value, or press ENTER for the default
pl: Wpisz now± warto¶æ lub wci¶nij ENTER by przyj±c warto¶æ domy¶ln±
uk: Введ╕ть нове значення, або натисн╕ть ENTER для значення за замовчуванням

source: Full Name
pl: Imiê i nazwisko
uk: Повне ╕м'я

source: Full Name: %s
pl: Imiê i nazwisko: %s
uk: Повне ╕м'я: %s

source: Room Number
pl: Numer pokoju
uk: Номер к╕мнати

source: Room Number: %s
pl: Numer pokoju: %s
uk: Номер к╕мнати: %s

source: Work Phone
pl: Telefon do pracy
uk: Робоч╕й телефон

source: Work Phone: %s
pl: Telefon do pracy: %s
uk: Робоч╕й телефон: %s

source: Home Phone
pl: Telefon domowy
uk: Домашн╕й телефон

source: Home Phone: %s
pl: Telefon domowy: %s
uk: Домашн╕й телефон: %s

source: Other
pl: Inne
uk: ╤нше

source: %s: Permission denied.
pl: %s: Brak praw dostêpu.
uk: %s: У доступ╕ в╕дмовлено.

source: %s: Unknown user %s
pl: %s: Nieznany u¿ytkownik %s
uk: %s: Нев╕домий користувач %s

source: %s: Cannot determine your user name.
pl: %s: Nie mogê ustaliæ twojej nazwy u¿ytkownika.
uk: %s: Неможливо визначити ваше ╕м'я користувача.

source: %s: cannot change user `%s' on NIS client.
pl: %s: nie mogê zmieniæ u¿ytkownika `%s' na kliencie NIS.
uk: %s: неможливо зм╕нити користувача `%s' у кл╕╓нт╕ NIS.

source: %s: `%s' is the NIS master for this client.
pl: %s: `%s' jest nadrzêdnym serwerm NIS dla tego klienta.
uk: %s: `%s' ╓ NIS сервером для цього кл╕╓нта.

source: Changing the user information for %s
pl: Zmieniam informacjê o u¿ytkowniku %s
uk: Зм╕ню╓ться ╕нформац╕я про користувача %s

source: %s: invalid name: "%s"
pl: %s: nieprawid³owa nazwa: "%s"
uk: %s: нев╕рне ╕м'я: "%s"

source: %s: invalid room number: "%s"
pl: %s: nieprawid³owy numer pokoju: "%s"
uk: %s: нев╕рний номер к╕мнати: "%s"

source: %s: invalid work phone: "%s"
pl: %s: nieprawid³owy numer telefonu do pracy: "%s"
uk: %s: нев╕рний робочий телефон: "%s"

source: %s: invalid home phone: "%s"
pl: %s: nieprawid³owy numer telefonu domowego: "%s"
uk: %s: нев╕рний домашн╕й телефон: "%s"

source: %s: "%s" contains illegal characters
pl: %s: "%s" zawiera nieprawid³owe znaki
uk: %s: "%s" м╕стить заборонен╕ символи

source: %s: fields too long
pl: %s: pola zbyt d³ugie
uk: %s: поля занадто довг╕

source: Cannot change ID to root.
pl: Nie mogê zmieniæ ID na root.
uk: Неможливо зм╕нити ID на root.

source: Cannot lock the password file; try again later.
pl: Nie mogê zablokowaæ pliku z has³ami; spróbuj pó¼niej.
uk: Неможливо заблокувати файл парол╕в; спробуйте п╕зн╕ше.

source: Cannot open the password file.
pl: Nie mogê otworzyæ pliku z has³ami.
uk: Неможливо в╕дкрити файл парол╕в.

source: %s: %s not found in /etc/passwd
pl: %s: %s nie znaleziony w /etc/passwd
uk: %s: %s не знайдено в /etc/passwd

source: Error updating the password entry.
pl: B³±d podczas aktualizacji wpisu do bazy hase³.
uk: Неможливо оновити запис у файл╕ парол╕в.

source: Cannot commit password file changes.
pl: Wprowadzenie zmian do pliku passwd jest niemo¿liwe.
uk: Неможливо записати зм╕ни до файлу парол╕в.

source: Cannot unlock the password file.
pl: Nie mogê usun±æ blokady z pliku z has³ami.
uk: Неможливо розблокувати файл парол╕в.

source: Usage: chpasswd [options] Options: -e, --encrypted supplied passwords are encrypted -h, --help display this help message and exit -m, --md5 use MD5 encryption instead DES when the supplied passwords are not encrypted
pl: U¿ycie: chpasswd [opcje] Opcje: -e, --encrypted podane has³a s± zaszyfrowane -h, --help wy¶wietla ten ekran pomocy -m, --md5 je¶li podane has³a s± niezaszyfrowane, u¿ywa szyfrowania MD5 zamiast DES.
uk: Використання: chpasswd [опц╕╖] Опц╕╖: -e, --encrypted надан╕ парол╕ зашифрован╕ -h, --help показати це пов╕домлення та вийти -m, --md5 використовувати MD5-шифрування зам╕сть DES, коли надан╕ парол╕ не зашифрован╕

source: %s: can't lock shadow file
pl: %s: nie mogê zablokowaæ pliku z ukrytymi has³ami
uk: %s: неможливо заблокувати файл з прихованими паролями

source: %s: can't open shadow file
pl: %s: nie mogê otworzyæ pliku z ukrytymi has³ami
uk: %s: неможливо в╕дкрити файл з прихованими паролями

source: %s: line %d: line too long
pl: %s: linia %d: linia zbyt d³uga
uk: %s: рядок %d: рядок занадто довгий

source: %s: line %d: missing new password
pl: %s: linia %d: brakuje nowego has³a
uk: %s: рядок %d: браку╓ нового пароля

source: %s: line %d: unknown user %s
pl: %s: linia %d: nieznany u¿ytkownik %s
uk: %s: рядок %d: нев╕домий користувач %s

source: %s: line %d: cannot update password entry
pl: %s: linia %d: nie mogê zaktualizowaæ wpisu do bazy hase³
uk: %s: рядок %d: неможливо оновити запис у баз╕ парол╕в

source: %s: error detected, changes ignored
pl: %s: wykryto b³±d, zignorowano modyfikacje
uk: %s: виявлено помилку, зм╕ни ╕гноруються

source: %s: error updating shadow file
pl: %s: b³±d podczas aktualizacji pliku z ukrytymi has³ami
uk: %s: помилка оновлення файлу з прихованими паролями

source: %s: error updating password file
pl: %s: b³±d podczas aktualizacji pliku z has³ami
uk: %s: помилка оновлення файлу з паролями

source: Usage: %s [-s shell] [name]
pl: U¿ycie: %s [-s pow³oka] [nazwa]
uk: Використання: %s [-s оболонка] [╕м'я]

source: Enter the new value, or press return for the default
pl: Wpisz now± warto¶æ lub wci¶nij ENTER by przyj±c warto¶æ domy¶ln±
uk: Введ╕ть нове значення, або натисн╕ть ENTER, для значення за замовченням

source: Login Shell
pl: Pow³oka logowania
uk: Оболонка

source: You may not change the shell for %s.
pl: Nie mo¿esz zmieniaæ pow³oki dla %s.
uk: Не можна зм╕нити оболонку для %s.

source: Changing the login shell for %s
pl: Zmieniam pow³okê logowania dla %s
uk: Зм╕ню╓ться оболонка для %s

source: %s: Invalid entry: %s
pl: %s: Nieprawid³owy wpis: %s
uk: %s: Нев╕рний запис: %s

source: %s is an invalid shell.
pl: %s jest nieprawid³ow± pow³ok±.
uk: %s ╓ нев╕рною оболонкою.

source: Usage: %s [-(a|d)] shell
pl: U¿ycie: %s [-(a|d)] pow³oka
uk: Використання: %s [-(a|d)] оболонка

source: Shell password:
pl: Has³o pow³oki:
uk: Пароль оболонки:

source: re-enter Shell password:
pl: Wpisz ponownie has³o pow³oki:
uk: Повтор╕ть пароль оболонки:

source: %s: Passwords do not match, try again.
pl: %s: Has³a nie pasuj±, spróbuj ponownie.
uk: %s: Парол╕ не сп╕впадають, спробуйте знову.

source: %s: can't create %s
pl: %s: nie mogê utworzyæ %s
uk: %s: неможливо створити %s

source: %s: can't open %s
pl: %s: nie mogê otworzyæ %s
uk: %s: неможливо в╕дкрити %s

source: %s: Shell %s not found.
pl: %s: Pow³oka %s nie znaleziona.
uk: %s: Оболонка %s не знайдена.

source: Usage: expiry {-f|-c}
pl: U¿ycie: expiry {-f|-c}
uk: Використання: expiry {-f|-c}

source: %s: WARNING! Must be set-UID root!
pl: %s: OSTRZE¯ENIE! Program musi posiadaæ SUID root!
uk: %s: УВАГА! Програма повинна бути SUID root!

source: %s: unknown user
pl: %s: nieznany u¿ytkownik
uk: %s: нев╕домий користувач

source: usage: %s [-a|-u user] [-m max] [-r] [-t days] [-l locksecs]
pl: u¿ycie: %s [-a|-u u¿ytkownik] [-m maks] [-r] [-t dni] [-l bloksek]
uk: використання: %s [-a|-u користувач] [-m макс] [-r] [-t дн╕в] [-l лок_сек]

source: Unknown User: %s
pl: Nieznany u¿ytkownik: %s
uk: Нев╕домий користувач: %s

source: Username Failures Maximum Latest
pl: U¿ytkownik Niepowodzenia Maksymalnie Ostatnio
uk: Користувач Помилок Максимум Остання

source: %s on %s
pl: %s na %s
uk: %s на %s

source: [%lds left]
pl: [%lds pozosta³o]
uk: [%lds залишилось]

source: [%lds lock]
pl: [%lds blokada]
uk: [%lds блоковано]

source: usage: %s [-r|-R] group
pl: u¿ycie: %s [-r|-R] grupa
uk: використання: %s [-r|-R] група

source: %s [-a user] group
pl: %s [-a u¿ytkownik] grupa
uk: %s [-a користувач] група

source: %s [-d user] group
pl: %s [-d u¿ytkownik] grupa
uk: %s [-d користувач] група

source: %s [-A user,...] [-M user,...] group
pl: %s [-A u¿ytkownik,...] [-M u¿ytkownik,...] grupa
uk: %s [-A користувач,...] [-M користувач,...] група

source: %s [-M user,...] group
pl: %s [-M u¿ytkownik,...] grupa
uk: %s [-M користувач,...] група

source: %s: unknown user %s
pl: %s: nieznany u¿ytkownik %s
uk: %s: нев╕домий користувач %s

source: Permission denied.
pl: Dostêp zabroniony.
uk: Доступ заборонено.

source: %s: shadow group passwords required for -A
pl: %s: plik z ukrytymi has³ami grup wymagany dla -A
uk: %s: прихован╕ парол╕ груп потр╕бн╕ для -A

source: Who are you?
pl: Kim jeste¶?
uk: Ви хто?

source: unknown group: %s
pl: nieznana grupa: %s
uk: нев╕дома група: %s

source: Adding user %s to group %s
pl: Dodajê nowego u¿ytkownika %s do grupy %s
uk: Дода╓ться новий користувач %s до групи %s

source: Removing user %s from group %s
pl: Usuwam u¿ytkownika %s z grupy %s
uk: Видаля╓ться користувач %s з групи %s

source: %s: unknown member %s
pl: %s: nieznany cz³onek %s
uk: %s: нев╕домий член %s

source: %s: Not a tty
pl: %s: To nie tty
uk: %s: Не ╓ tty

source: Changing the password for group %s
pl: Zmieniam has³o dla grupy %s
uk: Зм╕на пароля для групи %s

source: New Password:
pl: Nowe has³o:
uk: Новий пароль:

source: Re-enter new password:
pl: Wpisz has³o ponownie:
uk: Повтор╕ть новий пароль:

source: They don't match; try again
pl: Nie pasuj±; spróbuj ponownie
uk: не сп╕впада╓; спробуйте знову

source: %s: Try again later
pl: %s: Spróbuj ponownie pó¼niej
uk: %s: Спробуйте знову п╕зн╕ше

source: %s: can't get lock
pl: %s: nie mogê zablokowaæ
uk: %s: неможливо заблокувати

source: %s: can't get shadow lock
pl: %s: nie mogê zablokowaæ pliku z ukrytymi has³ami
uk: %s: неможливо заблокувати базу прихований парол╕в

source: %s: can't open file
pl: %s: nie mogê otworzyæ pliku
uk: %s: неможливо в╕дкрити файл

source: %s: can't update entry
pl: %s: nie mogê zaktualizowaæ wpisu
uk: %s: неможливо оновити запис

source: %s: can't update shadow entry
pl: %s: nie mogê zaktualizowaæ wpisu do pliku z ukrytymi has³ami
uk: %s: неможливо оновити запис у баз╕ прихованих парол╕в

source: %s: can't re-write file
pl: %s: nie mogê przepisaæ pliku
uk: %s: неможливо переписати файл

source: %s: can't re-write shadow file
pl: %s: nie mogê przepisaæ pliku z ukrytymi has³ami
uk: %s: неможливо переписати файл прихований парол╕в

source: %s: can't unlock file
pl: %s: nie mogê usun±æ blokady z pliku
uk: %s: неможливо розблокувати файл

source: %s: can't update DBM files
pl: %s: nie mogê zaktualizwoaæ plików DBM
uk: %s: неможливо оновити DBM файл

source: %s: can't update DBM shadow files
pl: %s: nie mogê zaktualizowaæ pliku DBM z ukrytymi has³ami
uk: %s: неможливо оновити DBM файл з прихованими паролями

source: usage: groupadd [-g gid [-o]] group
pl: u¿ycie: groupadd [-g gid [-o]] grupa
uk: використання: groupadd [-g gid [-o]] група

source: %s: error adding new group entry
pl: %s: b³±d podczas dodawania nowej grupy
uk: %s: помилка додання нового запису у файл груп

source: %s: cannot add new dbm group entry
pl: %s: nie mogê dodaæ nowego wpisu do bazy dbm grup
uk: %s: неможливо додати новий запис у файл груп dbm

source: %s: name %s is not unique
pl: %s: nazwa %s nie jest niepowtarzalny
uk: %s: ╕м'я %s не ╓ ун╕кальним

source: %s: gid %u is not unique
pl: %s: uid %u nie jest niepowtarzalny
uk: %s: gid %u не ╓ ун╕кальним

source: %s: can't get unique gid
pl: %s: nie mogê uzyskaæ niepowtarzalnego gid
uk: %s: неможливо отримати ун╕кальний gid

source: %s: %s is a not a valid group name
pl: %s: %s: nie jest prawid³ow± nazw± grupy
uk: %s: %s не ╓ в╕рним ╕менем групи

source: %s: invalid group %s
pl: %s: nieprawid³owa grupa %s
uk: %s: нев╕рна група %s

source: %s: -O requires NAME=VALUE
pl: %s: -O wymaga ZMIENNA=WARTO¦Æ
uk: %s: -O вимага╓ ЗМ╤ННА=ЗНАЧЕННЯ

source: %s: cannot rewrite group file
pl: %s: nie mogê przepisaæ pliku z grupami
uk: %s: неможливо переписати файл груп

source: %s: cannot rewrite shadow group file
pl: %s: nie mogê przepisaæ pliku z ukrytymi grupami
uk: %s: неможливо переписати файл прихованих груп

source: %s: unable to lock group file
pl: %s: nie mogê zablokowaæ pliku z grupami
uk: %s: неможливо заблокувати файл груп

source: %s: unable to open group file
pl: %s: nie mogê otworzyæ pliku z grupami
uk: %s: неможливо в╕дкрити файл груп

source: %s: unable to lock shadow group file
pl: %s: nie mogê zablokowaæ pliku z ukrytymi grupami
uk: %s: неможливо блокувати файл прихованих груп

source: %s: unable to open shadow group file
pl: %s: nie mogê otworzyæ pliku z ukrytymi grupami
uk: %s: неможливо в╕дкрити файл прихованих груп

source: %s: group %s exists
pl: %s: grupa %s istnieje
uk: %s: група %s ╕сну╓

source: usage: groupdel group
pl: u¿ycie: groupdel grupa
uk: використання: groupdel група

source: %s: error removing group entry
pl: %s: b³±d podczas usuwania grupy
uk: %s: помилка видалення запису з бази груп

source: %s: error removing group dbm entry
pl: %s: b³±d podczas usuwania wpisu dbm o grupie
uk: %s: помилка видалення запису з бази груп dbm

source: %s: error removing shadow group entry
pl: %s: b³±d podczas usuwania wpisu o ukrytej grupie
uk: %s: помилка видалення запису з бази прихованих груп

source: %s: error removing shadow group dbm entry
pl: %s: b³±d podczas usuwania wpisu dbm z pliku ukrytych grup
uk: %s: помилка видалення запису з бази прихованих груп dbm

source: %s: cannot remove user's primary group.
pl: %s: nie mogê usun±æ podstawowej grupy u¿ytkowników.
uk: %s: неможливо видалити первинну групу користувача.

source: %s: group %s does not exist
pl: %s: grupa %s nie isnieje
uk: %s: група %s не ╕сну╓

source: %s: group %s is a NIS group
pl: %s: grupa %s jest grup± NIS
uk: %s: група %s ╓ групою NIS

source: %s: %s is the NIS master
pl: %s: %s jest g³ównym serwerem NIS
uk: %s: %s ╓ головним сервером NIS

source: usage: groupmod [-g gid [-o]] [-n name] group
pl: u¿ycie: groupmod [-g gid [-o]] [-n nazwa] grupa
uk: використання: groupmod [-g gid [-o]] [-n ╕м'я] група

source: %s: %s not found in /etc/group
pl: %s: %s nie znaleziony w /etc/group
uk: %s: %s не знайдено у /etc/passwd

source: %s: cannot add new dbm shadow group entry
pl: %s: nie mogê dodaæ nowego wpisu dbm do pliku z ukrytymi grupami
uk: %s: неможливо додати запис у базу прихованих груп dbm

source: %s: %u is not a unique gid
pl: %s: %u nie jest niepowtarzalnym gid
uk: %s: %u не ╓ ун╕кальним gid

source: %s: %s is not a unique name
pl: %s: %s nie jest niepowtarzaln± nazw±
uk: %s: %s не ╓ ун╕кальним ╕менем

source: unknown user %s
pl: nieznany u¿ytkownik %s
uk: нев╕домий користувач %s

source: Usage: %s [-r] [-s] [group [gshadow]]
pl: U¿ycie: %s [-r] [-s] [grupa [gshadow]]
uk: Використання: %s [-r] [-s] [group [gshadow]]

source: Usage: %s [-r] [-s] [group]
pl: U¿ycie: %s [-r] [-s] [grupa]
uk: Використання: %s [-r] [-s] [group]

source: No
pl: Nie
uk: Н╕

source: %s: -s and -r are incompatibile
pl: %s: -s i -r s± niekompatybilne
uk: %s: -s та -r несум╕сн╕

source: %s: cannot lock file %s
pl: %s: nie mogê zablokowaæ pliku %s
uk: %s: неможливо заблокувати файл %s

source: %s: cannot open file %s
pl: %s: nie mogê otworzyæ pliku %s
uk: %s: неможливо в╕дкрити файл %s

source: invalid group file entry
pl: nieprawid³owy wpis do pliku grup
uk: нев╕рний запис у файл╕ груп

source: delete line `%s'?
pl: usun±æ liniê `%s'?
uk: видалити рядок `%s'?

source: duplicate group entry
pl: duplikat wpisu grup
uk: повторн╕ записи у баз╕ груп

source: invalid group name `%s'
pl: nieprawid³owa nazwa grupy `%s'
uk: нев╕рне ╕м'я групи `%s'
