Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge9/debian/po/*.po
Languages: cs, eu, mk

source: Root password:
cs: Heslo u¾ivatele root:
eu: Root pasahitza:
mk: Root лозинка:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
cs: Ne¾ budete pokraèovat, musíte nastavit heslo pro u¾ivatele 'root' - správce systému. Zlomyslný nebo neznalý u¾ivatel s rootovskými právy mù¾e v systému napáchat neuvìøitelné ¹kody, tak¾e byste mìli zvolit rootovo heslo co nejvíce neuhodnutelné. To znamená, ¾e by to nemìlo být slovo ze slovníku, ani údaj, který se s vámi dá lehce spojit (jméno miláèka). Dobré heslo obsahuje smìs písmen, èíslic a dal¹ích znakù a je pravidelnì mìnìno. Rootovo heslo mù¾ete zmìnit pøíkazem 'passwd', který spustíte jako u¾ivatel root.
eu: Zuk root, sistema kudeatzaile kontuarentzat pasahitz bat ezarri behar duzu. Erabiltzaile maltzur edo ezjakin batek root saio baimenak lortzeak emaitza kaltegarriak izan ditzake, honegatik asmatzeko zail den pasahitz bat ezarri beharko zenuke. Ez da hiztegian aurki daitekeen edo zurekin erraz lotu daitekeen hitz bat izan behar. Pasahitz egoki bat letra, zenbaki eta puntuazio ikurren nahaspen bat izan beharko litzateke eta aldiro aldatu. Root pasahitza aldatu ahal izateko abiarazi 'passwd' root bezala.
mk: Потребно е да поставиш лозинка за „root“, главната администраторска сметка. Злобен или неквалификуван корисник со рут пристап може да има разурнувачки ефекти, па треба да се осигураш дека рут лозинката не е лесна да се погоди. Не треба да биде збор од речник или збор кој може лесно да се поврзе со тебе, како твоето презиме. Добра лозинка ќе содржи мешавина од букви, бројки и интерпукциски знаци и ќе биде менувана редовно. Рут лозинката се менува извршувајќи ја „passwd“ програмта како root.

source: Note that you will not be able to see the password as you type it.
cs: Heslo se pøi psaní nezobrazuje.
eu: Kontutan izan ez zenukeela idazten duzun pasahitza ikusi beharko.
mk: Имај на ум дека нема да можеш да ја гледаш лозинката како што ја куцаш.

source: Please enter the same root password again to verify that you have typed it correctly.
cs: Zadejte znovu rootovo heslo, abyste se pøesvìdèili, ¾e jste jej zadali správnì.
eu: Mesedez sartu berriz root pasahitza egoki idatzi duzula egiaztatzeko.
mk: Те молам внеси ја повторно истата рут лозинка повторно за да се потврди дека правилно си ја внел.

source: Create a normal user account now?
cs: Vytvoøit úèet pro bì¾ného u¾ivatele?
eu: Erabiltzaile arrunt kontu bat orain sortu?
mk: Создади сметка за нормален корисник сега?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
cs: Není dobrý nápad pou¾ívat úèet roota pro ka¾dodenní práci, jako tøeba ètení po¹ty, proto¾e i malý pøeklep mù¾e zpùsobit veliké ne¹tìstí. Nyní mù¾ete vytvoøit úèet bì¾ného u¾ivatele pro ka¾dodenní práci.
eu: Ideia txarra da root kontua eguneroko lanak, eposta irakurri eta antzerakoak, egiteko erabiltzea, edozein akats txiki konponezina izan bait liteke. Zuk erabiltzaile arrunt kontu bat sortu beharko zenuke eguneroko lanentzat.
mk: Лоша идеја е да се користи рут сметката за нормални секојдневни активности, како што се читање на електронска пошта, бидејќи и најмала грешка може да предизвика катастрофа. Треба да направиш нормален корисник кој ќе се користи за тие секојдневни задачи.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
cs: Tento a dal¹í úèty mù¾ete vytvoøit pozdìji jako root pøíkazem 'adduser <uzivjmeno>', kde <uzivjmeno> je u¾ivatelské jméno jako napø. 'imurdock' nebo 'rms'.
eu: Kontura hadi beranduago sor dezakezula (beste edozein kontu bezala) "adduser <erabiltzaile_izena>" root bezala abiaraziaz, non <erabiltzaile_izena> erabiltzailearen izena da imurdock edo rms antzera.
mk: Имај на ум дека може да го направиш подоцна(како и било која дополнителна сметка) куцајќи „adduser <корисничко име>“ како root, каде корисничко име е нешто како „petko“ или „stanko“.

source: Enter a username for your account:
cs: Zadejte u¾ivatelské jméno pro nový úèet:
eu: Sar ezazu erabiltzaile izena zure kontuarentzat:
mk: Внеси кориснички име за твојата сметка:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
cs: Zadejte u¾ivatelské jméno pro nový úèet. Rozumnou volbou bývá køestní jméno u¾ivatele. U¾ivatelské jméno musí zaèínat malým písmenem, za kterým mù¾e následovat libovolná kombinace èísel a malých písmen.
eu: Aukeratu erabiltzaile izena zure konturarentzat. Zure izena aukera egokia izaten da. Erabiltzaile izena minuskula batez hasi behar da edozein letra eta zenbaki nahaspenez jarraiturik.
mk: Избери корисничко име за новата сметака. Твоето име е добар избор. Корисничкото име треба да почне со мала буква по која може да има било каква комбинација на бројки или мали букви.

source: Invalid username entered.
cs: Bylo zadáno chybné u¾ivatelské jméno.
eu: Erabiltzaile izen baliogabea.
mk: Внесено е неправилно корисничко име.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
cs: U¾ivatelské jméno, které jste zadali, je neplatné. U¾ivatelská jména musí zaèínat malým písmenem, za kterým mù¾e následovat libovolná kombinace èísel a malých písmen.
eu: Zuk emandako erabiltzaile izena baliogabea da. Kontutan izan erabiltzaile izena minuskula batez hasi behar dela edozein letra eta zenbaki nahaspenez jarraiturik.
mk: Корисничкото име кое го внесе е неправилно. Имај на ум дека корисничкото име треба да почне со мала буква по која може да има било каква комбинација на бројки или мали букви.

source: Enter a full name for the new user:
cs: Zadejte celé jméno nového u¾ivatele:
eu: Idatzi erabiltzaile berriaren izen osoa:
mk: Внеси целосно име за новиот корисник:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
cs: Nyní bude vytvoøen u¾ivatelský úèet, který slou¾í k bì¾né (neadministrátorské) práci.
eu: Erabiltzaile kontu bat sortuko da zuk kudeatzaile ekintzak ez direnetan erabil dezazun.
mk: Коринисчка сметка ќе биде направена за да ја користиш наместо root сметката за неадминистративни активности.

source: Enter a password for the new user:
cs: Zadejte heslo pro nového u¾ivatele:
eu: Idatzi erabiltzaile berriaren pasahitza:
mk: Внеси лозинка за новиот корисник:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
cs: Dobré heslo obsahuje smìs písmen, èíslic a dal¹ích znakù a je pravidelnì mìnìno.
eu: Pasahitz egoki bat letra, zenbaki eta puntuazio ikurren nahasketa bat da eta aldiro aldatu beharko litzateke.
mk: Добра лозинка е лозинка со мешавина на букви, бројки и интерпукциски знаци и која се менува на редовни периоди.

source: Re-enter password to verify:
cs: Znovu zadejte heslo pro ovìøení:
eu: Berretsi pasahitza egiaztapenerako:
mk: Поторно внеси ја лозинката да се потврди:

source: Please enter the same user password again to verify you have typed it correctly.
cs: Zadejte prosím stejné heslo, abyste si ovìøili, ¾e jste jej zadali správnì.
eu: Mesedez idatzi erabiltzaile berdinaren pasahitza berriz, egoki idatzi duzula egiaztatzeko.
mk: Те молам внеси ја истата лозинка повторно за да се потврди дека правилно си ја искуцал.

source: Password input error.
cs: Chyba pøi zadávání hesla.
eu: Errorea pasahitza idazterakoan.
mk: Грешка при внес на лозинка.

source: The two passwords you entered were not the same. Please try again.
cs: Zadaná hesla nejsou stejná. Zkuste to znovu.
eu: Zuk idatzitako bi pasahitzak ezberdinak dira. Mesedez saiatu berriz.
mk: Двете лозинки кои ги внесе не се исти. Те молам пробај повторно.

source: Empty password was entered.
cs: Bylo zadáno prázdné heslo.
eu: Pasahitza zurian utzi duzu.
mk: Беше внесена празна лозинка.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
cs: Zdá se, ¾e jste zadali prázdné heslo. To není bezpeèné! Zkuste to znovu.
eu: Pasahitza zurian utzi duzu. Hau ez da ziurra ! Saiatu zaitez berriro.
mk: Изгледа како да не внесе ништо за лозинката. Ова не е безбедно! Те молам пробај повторно.

source: Enable shadow passwords?
cs: Povolit stínová hesla?
eu: Itzalpeko pasahitzak gaitu?
mk: Овозможи прикриени лозинки?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
cs: Stínová hesla zvy¹ují bezpeènost systému, proto¾e nikdo nemù¾e vidìt za¹ifrovaná hesla jiných u¾ivatelù. Hesla jsou ulo¾ena v samostatném souboru, který mohou èíst jen vybrané programy. Pou¾ití stínových hesel lze jen doporuèit. Problém by mohl nastat pouze pøi pou¾ití NIS.
eu: Itzalpeko pasahitzek zure sistema ziurrago egiten dute inor ez bait da enkriptaturiko pasahitzak ikusteko gai. Pasahitzak bereizitako fitxategi batetan gordeko dira eta aplikazio bereziek bakarrik irakur ditzakete. Hala ere zuk NIS erabili behar baduzu arazoak sor litzazke.
mk: Прикриени лозинки го прават твојот систем уште побезбеден бидејќи никој неможе да ги види ни енкриптираните лозинки. Лозинките се чуваат по посебна датотека која може да ја прочитаат само посебни програми. Користењето на прикриени лозинки е препорачливо. Сепак, ако мислиш да работиш со NIS може да се појават проблеми.

source: Enable md5 passwords?
cs: Povolit md5 hesla?
eu: md5 pasahitzak gaitu?
mk: Овозможи мд5 лозинки?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
cs: Md5 hesla jsou bezpeènìj¹í a umo¾òují pou¾ít hesla del¹í ne¾ 8 znakù. Bohu¾el mohou zpùsobit problémy pøi pou¾ití NIS nebo pøi sdílení souboru hesel se star¹ími systémy.
eu: Md5 pasahitzak ziurragoak dira eta 8 karaktere baino luzegaoak diren pasahitzak onartzen ditu. Hala ere NIS erabili behar baduzu edo sistema zaharragoekin pasahitzak partekatu, arazoak sor litzazke.
mk: Мд5 лозинките се посигурни и овозможуваат да се користат лозинки поголеми од 8 карактери. Сепак, може да предизвикаат проблеми ако користиш NIS или ги делиш датотеките со лозинки со постари системи.
