Repository: hallyn/shadow-debian
Catalog: 4.0.3-31sarge4/po/*.po
Languages: ar, mg, nn

source: Root password:
ar: كلمة سر الجذر:
mg: Teny mpamoa root:
nn: Rotpassord:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
ar: عليك تعيين كلمة سر 'للجذر'، حساب مدير النّظام. حصول مستخدمٍ خبيث أو غير مؤهّل على إمكانيّات الجذر قد يكون له عواقب وخيمة لذا حاول جهدك أن تختار كلمة سرٍّ يصعب تخمينها. لا ينبغي أن تكون كلمةً موجودةً في القاموس أو كلمةً يسهل ربطها بك، كاسمك الأوسط. كلمة السّر الجيّدة تحتوي خليطاً من الحروف و الأرقام و العلامات و تغيّر بانتظام. يمكن تغيير كلمة سرّ الجذر بتشغيل برنامج passwd بصفة الجذر.
mg: Mila manome teny mpamoa ho an'ny 'root' ianao, hanidina ny kaontin'ny mpitantana ny milina. Ireo mpampiasa manana eritreritra ratsy na tsy za-draharaha tafiditra ho 'root' dia mety hanimba ny milina, noho izany dia tokony hifidy teny mpamoa root izay sarotra vinavinaina ianao. Tsy tokony hatao teny hita ao amin'ny rakibolana, na teny mora fantarina mikasika anao, tahakan'ny fanampin'anarana, izy io. Ny teny mpamoa tsara dia ahitana fikambanana litera, marika sy mari-pijanonan-teny ary tokony hovaina matetika. Ny teny mpamoa root dia azo ovaina ami'ny alalan'ny rindran'asa 'passwd', alefa rehefa root.
nn: No må du laga eit passord for «root», kontoen for systemadministrasjon. Ein ukvalifisert brukar eller ein brukar med uærlege føremål som har root-tilgang kan ha katastrofale følgjer. Du bør difor velja passord med varsemd slik at det ikkje er lett å gjetta seg til. Det bør ikkje vera eit ord som står i ordlista, eller eit ord som lett vert assosiert med deg, som til dømes mellomnamnet ditt. Eit godt passord inneheld ei blanding av bokstavar, tal og andre teikn og blir endra regelmessig. Root-passordet kan du endra ved å køyra programmet «passwd» som root.

source: Note that you will not be able to see the password as you type it.
ar: لاحظ أنّك لن تتمكّن من رؤية كلمة السّر أثناء كتابتها.
mg: Tadidio fa tsy ho hitanao ilay teny mpamoa mandritran'ny fampidirana azy.
nn: Merk at du ikkje vil kunne sjå passordet medan du skriv det inn.

source: Please enter the same root password again to verify that you have typed it correctly.
ar: رجاءً أدخل كلمة سرّ الجذر ذاتها مجدّداً للتّأكّد أنّك أدخلتها بشكلٍ صحيح.
mg: Azafady ampidiro indray ilay teny mpamoa root hanamarinana fa voasoratra tsara ilay izy.
nn: Skriv inn det same root-passordet ein gong til for å kontrollera at du har skrive det inn rett.

source: Create a normal user account now?
ar: هل تريد إنشاء حساب مستخدمٍ عادي الآن؟
nn: Oppretta ein vanleg brukarkonto no?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
ar: لا يحبّذ أن تستعمل الحساب الجذر للنّشاطات العاديّة اليوميّة كقراءة البريد الإلكتروني، و ذلك لأنّ أصغر الغلطات قد تأتي بكارثة. يستحسن أن تنشئ حساب مستخدمٍ عادي و تخصّصه لتلك المهام اليوميّة.
nn: Det er ikkje lurt å bruka root-kontoen for vanleg bruk av datamaskina, slik som lesing av e-post, fordi berre ein liten tabbe kan føra til katastrofe. No kan du laga ein vanleg brukarkonto som du kan ha til dagleg bruk.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
ar: لاحظ أنّ بإمكانك إنشاؤه لاحقاً (إضافةً لأيّ حساباتٍ أخرى) بإدخال 'adduser <username>' بصفة الجذر حيث <username>' هو اسم مستخدم مثل 'imurdock' أو 'rms'.
mg: Tadidio fa afaka mamorona io kaonty io ianao atsy aoriana rehefa root (sy izay kaonty hafa fanampiny) amin'ny alalan'ny 'adduser <username>', <username> no anaran'ilay mpapiasa. Ohatra : 'imurdock', 'rms'.
nn: Merk at du kan laga ein konto seinar (i tillegg til fleire kontoar) ved å skriva «adduser <brukarnamn> som root, der <brukarnamn> er eit brukarnamn, som «oladunk» eller «jensbond».

source: Enter a username for your account:
ar: أدخل اسم مستخدمٍ لحسابك:
mg: Ampidiro ny anarana mpampiasa ho an'ny kaontinao :
nn: Skriv inn eit brukarnamn for kontoen din:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
ar: اختر اسم مستخدمٍ لحسابك الجديد. اسمك الأوّل اختيارٌ معقول. يفترض أن يبدأ اسم المستخدم بحرفٍ صغير متبوعاً بأيّ خليطٍ من الأرقام و المزيد من الأحرف الصّغيرة.
mg: Misafidiana anarana mpampiasa ho an'ny kaonty vaovao. Ny anaranao dia mety. Ny anarana mpampiasa dia tsy maintsy atomboka amina litera atao zana-tsoratra, ary afaka tohizana amina fikambanana marika sy litera maro hafa, zana-tsoratra avokoa.
nn: Vel eit brukarnamn for den nye kontoen. Førenamnet ditt er eit godt val. Brukarnamnet må starta med ein liten bokstav, resten av brukarnamnet kan vera ein kombinasjon av tal og fleire små bokstavar.

source: Invalid username entered.
ar: أُدخل اسم مستخدم غير صحيح.
mg: Tsy ekena ny anarana mpampiasa nampidirinao.
nn: Du skreiv inn eit ugyldig brukarnamn.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
ar: اسم المستخدم الذي أدخلته غير صالح. لاحظ أن أسماء المستخدمين يجب أن تبدأ بحرفٍ صغير متبوعاً بأيّ خليطٍ من الأرقام و المزيد من الأحرف الصّغيرة.
mg: Tsy ekena ilay anarana mpampiasa nampidirinao. Tadidio fa ny ananrana mpampiasa dia tsy maintsy atomboka amina litera atao zana-tsoratra, izay azo tohizana amina fikambanana marika sy litera maro hafa, izay atao zana-tsoratra avokoa.
nn: Brukarnamnet du skreiv inn er ugyldig. Merk at brukarnamn må starta med ein liten bokstav, resten av brukarnamnet kan vera ein kombinasjon av tal og fleire små bokstavar.

source: Enter a full name for the new user:
ar: أدخل الاسم الكامل للمستخدم الجديد:
mg: Ampidiro ny anaran'ny mpampiasa vaovao :
nn: Skriv inn fullt namn for den nye brukaren:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
ar: سيُنشأ حساب مستخدم لك لتستعمله بدلاً من الجذر للأغراض الغير إداريّة.
mg: Ny kaontina mpampiasa tsotra izay ho foronina ho anao hampiasaina fa tsy ny kaonty root raha toa ka hanao asa tsy mikasika ny fitantanana ny milina ianao.
nn: Ein brukarkonto vil bli oppretta for deg til ikkje-administrative oppgåver.

source: Enter a password for the new user:
ar: أدخل كلمة سر للمستخدم الجديد:
mg: Ampidiro ny teny mpamoan'ny mpampiasa vaovao :
nn: Skriv inn eit passord for den nye brukaren:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
ar: كلمة السّر الجيّدة تحتوي خليطاً من الحروف و الأرقام و العلامات و تغيّر بانتظام.
mg: Ny teny mpamoa tsara dia hahitana fikanbanana litera, isa sy mari-pijanonan-tsoratra ary tokony hovaina matetika.
nn: Eit godt passord inneheld ei blanding av bokstavar, tal og andre teikn og blir endra regelmessig.

source: Re-enter password to verify:
ar: أدخل كلمة السّر مجدّداً للتّأكيد:
mg: Ampidiro indray ny teny mpamoa hanamarinana azy :
nn: Skriv inn passordet på ny for verifikasjon:

source: Please enter the same user password again to verify you have typed it correctly.
ar: رجاءً أدخل كلمة سرّ المستخدم ذاتها مجدّداً للتّأكّد أنّك أدخلتها بشكلٍ صحيح.
mg: Azafady ampidiro ilay teny mpamoan'ny mpampiasa mba hanamarinana fa voatendrinao tsara ilay izy.
nn: Skriv inn det same brukarpassordet igjen for å verifisera at du har skrive passordet rett.

source: Password input error.
ar: خطأ في إدخال كلمة السّر.
mg: Nisy fahadisoana nadritra ny fampidirana ny teny mpamoa.
nn: Feil med inntasta passord.

source: The two passwords you entered were not the same. Please try again.
ar: كلمتا السّر اللتان أدخلتهما ليستا متطابقتين. رجاءً حاول مجدّداً.
mg: Tsy mitovy ireo teny mpamoa roa izay nampidirinao. Azafady andramo indray.
nn: Dei to passorda du skreiv inn er ikkje like. Prøv igjen.

source: Empty password was entered.
ar: أُدخلت كلمة سرٍّ فارغة.
mg: Tsy nisy teny mpamoa tafiditra.
nn: Tomt passord

source: You seem to have entered nothing for the password. That is not secure! Please try again.
ar: يبدو أنّك لم تدخل شيئاً ككلمة سر. هذا ليس آمناً! رجاءً حاول مجدّداً.
nn: Det ser ut til at du ikkje har skrive inn noko passord. Det er ikkje trygt! Prøv igjen.

source: Enable shadow passwords?
ar: هل تريد تمكين كلمات السّر المظلّلة؟
nn: Ta i bruk skuggepassord?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
ar: كلمات السّر المظلّلة تجعل نظامك أكثر آماناً لأنّ لا أحد سيتمكّن من رؤية حتّى كلمات السّر المشفّرة. كلمات السّر تخزّن في ملفٍّ منفصل لا يستطيع قراءته إلّا برامج خاصّة. ينصح بشدّة باستعمال كلمات السّر المظلّلة. و لكن إن كنت ستستعمل NIS فقد تواجه مشاكلاً.
nn: Skuggepassord gjer systemet ditt tryggare fordi ingen kan lesa passord, ikkje ein gong i kryptert tilstand. Passord er lagra i ei separat fil som berre kan lesast av spesielle program. Vi tilrår bruk av skuggepassord. Viss du skal bruka NIS derimot, kan du få problem.

source: Enable md5 passwords?
ar: هل تريد تمكين كلمات سر md5؟
nn: Ta i bruk md5-passord?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
ar: كلمات سر md5 أكثر أماناً و تسمح باستعمال كلمات سرٍّ أطول من 8 حروف. لكنّها قد تسبّب مشاكل توافقيّة إذا كنت تستعمل NIS أو تشارك ملفّات كلمات السّر مع أنظمةٍ قديمة.
nn: Md5-passord er tryggare og tillet passord å vera lengre enn 8 teikn. Men viss du brukar NIS eller deler passord med eldre system kan du få kompabilitetsproblem.
