Repository: hallyn/shadow-debian
Catalog: 4.0.3-34/po/*.po
Languages: el, lt, pl, pt, ro

source: Root password:
el: Κωδικός του χρήστη root:
lt: Administratoriaus (root) slaptažodis:
pl: Has³o administratora (root):
pt: Password de root:
ro: Parola de root (a superutilizatorului):

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
el: Πρέπει να ορίσετε έναν κωδικό για το χρήστη root, τον διαχειριστή του συστήματος. Ενας κακόβουλος ή μη εξουσιοδοτημένος χρήστης με δικαιώματα διαχειριστή μπορεί να έχει καταστροφικά αποτελέσματα, για αυτό ο κωδικός του root δε θα πρέπει να είναι εύκολα εικάσιμος, και δε θα πρέπει να είναι απλή λέξη που μπορεί να βρεθεί σε λεξικό, ή μια λέξη με την οποία να έχετε άμεσο συσχετισμό, όπως το πατρικό σας. Ένας καλός κωδικός θα πρέπει να περιέχει ένα μείγμα από χαρακτήρες, αριθμούς και σημεία στίξης και θα πρέπει να αλλάζει σε τακτά χρονικά διαστήματα. Ο κωδικός αλλάζει εκτελώντας το πρόγραμμα 'passwd' ως root.
lt: Dabar Jūs turite nurodyti naudotojo 'root' (sistemos administravimo paskyros) slaptažodį. Piktavalis ar nekvalifikuotas naudotojas, turintis 'root' teises, gali sukelti pražūtingas pasekmes, todėl turėtumėte pasirinkti tokį slaptažodį, kurį nėra lengva atspėti. Tai neturėtų būti žodis, randamas žodyne, arba žodis, kuris gali būti lengvai susiejamas su jumis. Geras slaptažodis turėtų būti sudarytas iš raidžių, skaitmenų ir skyrybos ženklų, ir turėtų būti reguliariai keičiamas. Slaptažodis keičiamas programa 'passwd'.
pl: Musisz ustaliæ has³o dla konta root - administratora systemu. Z³o¶liwy lub niewykwalifikowany u¿ytkownik z uprawnieniami administratora mo¿e dokonaæ strasznych szkód, wiêc powiniene¶ postaraæ siê by has³o by³o trudne do odgadniêcia. Has³o to nie powinno byæ s³owem ze s³ownika lub s³owem, które ³atwo z Tob± skojarzyæ, na przyk³ad Twoim drugim imieniem. Dobre has³o powinno zawieraæ litery, cyfry i znaki przestankowe i powinno byæ zmieniane w regularnych odstêpach czasu. Has³o administratora mo¿na zmieniæ u¿ywaj±c komendy 'passwd' jako root.
pt: É necessário definir uma password para o 'root', a conta administrativa do sistema. Um utilizador malicioso ou não qualificado com acesso root pode trazer consequências desastrosas, portanto deve ter cuidado para escolher uma password que não seja fácilmente adivinhada. A password não deve ser uma palavra encontrada no dicionário ou uma palavra que possa ser facilmente associada a si, como o seu nome do meio. Uma boa password deve conter uma mistura de letras, números e sinais de pontuação e deve ser modificada em intervalo regulares. A password de root é modificada através da execução do comando 'passwd' como utilizador root.
ro: Trebuie să setaţi o parolă pentru contul de administrare 'root'. Un utilizator rău-voitor şi care nu ar trebui să aibă acces care capăta acces la contul de root poate provoca dezastre, deci ar trebui să aveţi grijă să alegeţi o parolă de root care nu poate fi uşor ghicită. N-ar trebui să fie un cuvânt care se găseşte în dicţionar sau un cuvânt care poate fi asociat uşor cu dvs., ca de exemplu prenumele dvs. O parolă bună conţine un amestec de litere, numere şi semne de punctuaţie care se schimbă la intervale regulate de timp. Parola de root se schimbă prin rularea programului 'passwd' ca root (folosind acest cont).

source: Note that you will not be able to see the password as you type it.
el: Ο κωδικός δε θα φαίνεται κατά την πληκτρολόγηση του.
lt: Įvesdami slaptažodį, įvedamų simbolių ekrane nematysite.
pl: Zwróæ uwagê, ¿e has³o nie bêdzie widoczne podczas wpisywania.
pt: Note que não poderá ver a password enquanto a digita.
ro: Atenţie: nu veţi putea să vedeţi parola în timp ce o scrieţi.

source: Please enter the same root password again to verify that you have typed it correctly.
el: Παρακαλώ ξαναδώστε τον ίδιο κωδικό του root για την εξακρίβωση της ορθής πληκτρολογησής του.
lt: Prašau įvesti tą patį 'root' slaptažodį dar kartą, kad būtų galima patikrinti, ar teisingai įvedėte.
pl: Proszê wpisaæ to samo has³o ponownie, aby upewniæ siê, ¿e zosta³o wpisane poprawnie.
pt: Por favor introduza a mesma password de root novamente para verificar se a introduziu correctamente.
ro: Vă rugăm sa introduceţi din nou aceiaşi parolă de root pentru a verifica faptul că nu aţi scris-o incorect.

source: Create a normal user account now?
el: Θέλετε να δημιουργήσετε έναν απλό χρήστη τώρα;
lt: Ar norite dabar sukurti paprasto naudotojo paskyrą?
pl: Czy chcesz teraz utworzyæ konto dla zwyk³ego u¿ytkownika?
pt: Criar uma conta de utilizador normal agora?
ro: Acum creaţi un cont de utilizator normal?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
el: Δε συνιστάται να χρησιμοποιείτε τον χρήστη root για καθημερινές εργασίες, όπως ανάγνωση της αλληλογραφίας, γιατί ακόμη και ένα μικρό λάθος μπορεί να αποβεί καταστροφικό. Τώρα, μπορείτε να δημιουργήσετε έναν απλό χρήστη για τις καθημερινές εργασίες.
lt: Naudoti administratoriaus (root) paskyrą kasdieniniams darbams, pavyzdžiui, elektroninio pašto skaitymui, yra pavojinga, nes net menka klaida gali pridaryti daug žalos. Dabar Jūs galite sukurti paprasto naudotojo paskyrą, kurią naudosite kasdieniam darbui.
pl: Nie jest dobrze u¿ywaæ konta root do codziennych czynno¶ci, jak czytanie poczty elektronicznej, poniewa¿ nawet niewielka pomy³ka mo¿e spowodowaæ katastrofê. Powiniene¶ utworzyæ konto zwyk³ego u¿ytkownika, przeznaczone na te codzienne czynno¶ci.
pt: É uma má ideia usar a conta de root para actividades normais do dia-a-dia, como ler mensagens electrónicas, porque até mesmo um pequeno erro pode resultar num desastre. Agora pode criar uma conta de utilizador normal para utilizar nas tarefas do dia-a-dia.
ro: Este o idee proastă să folosiţi contul de root pentru activităţile normale de zi cu zi, ca citirea de poştă electronică, deoarece chiar şi o mică greşeală poate duce la un dezastru. Este recomandat să creaţi un cont de utilizator pe care sa-l utilizaţi pentru sarcinile de zi cu zi.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
el: Σημειώστε ότι μπορείτε αν θέλετε να δημιουργήσετε το λογαριασμό (ή και περισσότερους αν επιθυμείτε) με την εκτέλεση της εντολής 'adduser <username>' ως χρήστης root, όπου <username> είναι το όνομα χρήστη όπως 'imurdock' ή 'rms'.
lt: Atkreipkite dėmesį, kad šią paskyrą (account) Jūs galite sukurti ir vėliau (kaip ir bet kokią papildomą paskyrą), pasinaudodami komanda 'adduser <username>' (dirbant 'root' teisėmis), kur <username> - naudotojo vardas, pvz., 'imurdock' ar 'rms'.
pl: Zwróæ uwagê, ¿e mo¿esz utworzyæ je pó¼niej (podobnie jak ka¿de dodatkowe konto) wpisuj±c komendê 'adduser <nazwa>' jako root, gdzie <nazwa> jest (o¶mio lub mniej znakow±) nazw± u¿ytkownika, na przyk³ad 'jnowak' albo 'aga'.
pt: Note que pode criar essa conta posteriormente (como também qualquer outra conta adicional) digitando 'adduser <nome do utilizador>' como root, onde <nome do utilizador> é um nome de utilizador, como 'imurdock' ou 'rms'.
ro: A se observa că-l puteţi crea mai târziu ( ca de altfel şi alte conturi ) tastând 'adduser <numeutilizator>' ca root, unde <numeutilizator> este un nume de utilizator ca 'imurdock' sau 'rms'.

source: Enter a username for your account:
el: Εισάγετε το όνομα χρήστη του λογαριασμού σας:
lt: Įveskite naudotojo vardą:
pl: Wpisz nazwê u¿ytkownika dla Twojego konta:
pt: Introduza um nome de utilizador para sua conta:
ro: Introduceţi un nume de utilizator pentru contul dvs.:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
el: Επιλέξτε ένα ονομα χρήστη για το νέο λογαριασμό. Το μικρό σας όνομα είναι μια λογική επιλογή. Το όνομα χρήστη θα πρέπει να ξεκινά με ένα πεζό γράμμα και να ακολουθείται απο οποιονδήποτε συνδυασμό αριθμών και πεζών γραμμάτων.
lt: Pasirinkite naudotojo vardą naujajai paskyrai. Jūsų vardas yra tinkamas pasirinkimas. Naudotojo vardas turėtų prasidėti iš mažosios raidės, po kurios gali būti mažųjų raidžių ir skaitmenų kombinacija.
pl: Wybierz nazwê dla nowego konta. Twoje imiê wydaje siê byæ rozs±dnym wyborem. Nazwa u¿ytkownika powinna zaczynaæ siê od ma³ej litery, po której mog± nastêpowaæ cyfry i inne ma³e litery.
pt: Seleccione um nome de utilizador para a nova conta. O primeiro nome é uma escolha razoável. O nome de utilizador de comecar com uma letra minuscula, que pode ser seguida de qualquer combinação de números e mais letras minusculas.
ro: Selectaţi un nume pentru noul cont. Prenumele dumneavoastră este o alegere rezonabilă. Numle de utilizator ar trebui să înceapă cu literă mică, care poate fi urmată de orice combinaţie de numere şi mai multe litere mici.

source: Invalid username entered.
el: Μη έγκυρο όνομα χρήστη.
lt: Įvestas netaisyklingas naudotojo vardas.
pl: Wprowadzono nieprawid³ow± nazwê u¿ytkownika.
pt: O nome de utilizador introduzido é inválido .
ro: S-a introdus nume de utilizator invalid.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
el: Το όνομα χρήστη που δώσατε δεν είναι έγκυρο. Σημειώστε ότι το όνομα χρήστη θα πρέπει να αρχίζει με πεζό γράμμα και να ακολουθείται από οποιονδήποτε συνδυασμό αριθμών και πεζών γραμμάτων.
lt: Jūsų įvestas naudotojo vardas netaisyklingas. Atkreipkite dėmesį, kad naudotojo vardas turi prasidėti mažąja raide, po kurios gali būti mažųjų raidžių ir skaitmenų kombinacija.
pl: Wprowadzona przez Ciebie nazwa u¿ytkownika jest nieprawid³owa. Nazwa u¿ytkownika powinna zaczynaæ siê od ma³ej litery, po której mog± nastêpowaæ cyfry i inne ma³e litery.
pt: O nome de utilizador introduzido é inválido. Note que nomes de utilizadores devem iniciar com uma letra minuscula, a qual pode ser seguida de qualquer combinação de números e mais letras minusculas.
ro: Numele de utilizator introdus de dvs. este invalid. A se observa că numele de utilizatori trebuie să inceapă cu literă mică urmată de orice combinaţie de cifre şi alte litere mici.

source: Enter a full name for the new user:
el: Εισάγετε το πλήρες όνομα του νέου χρήστη:
lt: Įveskite naujojo naudotojo vardą ir pavardę:
pl: Wpisz pe³n± nazwê u¿ytkownika:
pt: Introduza o nome completo para o novo utilizador:
ro: Introduceţi numele complet pentru noul utilizator:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
el: Θα δημιουργηθεί ένας λογαριασμός απλού χρήστη, τον οποίο συνιστάται να χρησιμοποιείτε για τις καθημερινές μη διαχειριστικές εργασίες αντί του λογαριασμού root.
lt: Jums bus sukurta naudotojo paskyra (account), kurią galėsite naudoti vietoje 'root' paskyros ne administravimo darbams atlikti.
pl: Zostanie dla Ciebie utworzone konto do u¿ytku zamiast konta root do celów nie zwi±zanych z czynno¶ciami administracyjnymi.
pt: Uma conta de utilizador será criada para poder usa-la em vez da conta de root para actividades não-administrativas.
ro: Un cont de utilizator va fi creat pentru ca dvs. să-l utilizaţi în loc de contul de root pentru activităţi non-administrative.

source: Enter a password for the new user:
el: Εισάγετε έναν κωδικό για το νέο χρήστη:
lt: Įveskite naujo naudotojo slaptažodį:
pl: Wpisz has³o dla nowego u¿ytkownika:
pt: Introduza uma password para o novo utilizador:
ro: Introduceţi o parolă pentru noul utilizator:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
el: Ένας καλός κωδικός θα πρέπει να περιέχει ένα μείγμα από χαρακτήρες, αριθμούς και σημεία στίξης και θα πρέπει να αλλάζει σε τακτά χρονικά διαστήματα.
lt: Saugus slaptažodis turėtų būti sudarytas iš raidžių, skaitmenų ir skyrybos ženklų, ir turėtų būti reguliariai keičiamas.
pl: Dobre has³o powinno zawieraæ litery, cyfry i znaki przestankowe i powinno byæ zmieniane w regularnych odstêpach czasu.
pt: Uma boa password contém uma mistura de letras, números e pontuação e é modificada em intervalos regulares.
ro: O parolă bună conţine un amestec de litere, numere şi semne de punctuaţie care se schimbă la intervale regulate de timp.

source: Re-enter password to verify:
el: Ξαναδώστε τον κωδικό για επιβεβαίωση:
lt: Dar kartą įveskite slaptažodį patikrinimui:
pl: Potwierd¼ has³o:
pt: Introduz a password novamente para verificação:
ro: Reintroduceţi parola pentru verificare:

source: Please enter the same user password again to verify you have typed it correctly.
el: Παρακαλώ ξαναδώστε τον ίδιο κωδικό για την επιβεβαίωσή του.
lt: Prašau įvesti tą patį slaptažodį vėl, patikrinimui ar teisingai jį įvedėte.
pl: Proszê wpisaæ to samo has³o ponownie, aby upewniæ siê, ¿e zosta³o wpisane poprawnie.
pt: Por favor, introduza a mesma password novamente para verificar se a digitou corretamente.
ro: Vă rugăm sa introduceţi din nou aceiaşi parolă de utilizator pentru a verifica faptul că nu aţi scris-o incorect.

source: Password input error.
el: Σφάλμα κατά την εισαγωγή του κωδικού.
lt: Slaptažodžio įvedimo klaida.
pl: B³±d przy wpisywaniu has³a.
pt: Erro na introdução da password.
ro: Eroare la introducerea parolei.

source: The two passwords you entered were not the same. Please try again.
el: Οι δύο κωδικοί που δώσατε διαφέρουν. Παρακαλώ ξαναπροσπαθήστε.
lt: Jūsų įvesti slaptažodžiai nesutampa. Bandykite dar kartą.
pl: Has³a, które zosta³y wpisane nie s± identyczne. Proszê spróbowaæ jeszcze raz.
pt: As duas passwords que você informou não foram a mesma. Por favor, tente novamente.
ro: Cele două parole introduse de dvs. nu au fost identice. Vă rugăm să încercaţi din nou.

source: Empty password was entered.
el: Δώσατε κενό κωδικό.
lt: Įvestas tuščias slaptažodis.
pl: Wpisano puste has³o.
pt: Uma password em branco foi introduzida.
ro: S-a introdus parolă vidă.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
el: Ο κωδικός που δώσατε είναι κενός. Κάτι τέτοιο δεν είναι ασφαλές! Παρακαλώ ξαναπροσπαθήστε.
lt: Jūs nieko neįvedėte vietoje slaptažodžio. Tai nesaugu! Bandykite dar kartą.
pl: Wygl±da na to, ¿e zosta³o wpisane puste has³o. To nie jest bezpieczne! Proszê spróbowaæ jeszcze raz.
pt: Parece que não introduziu nada para a password. Isto não é seguro ! Por favor, tente novamente.
ro: Se pare că nu aţi introdus nimc pentru parolă. Acest lucru nu vă asigură siguranţa! Vă rugăm să încercati din nou.

source: Enable shadow passwords?
el: Θέλετε να ενεργοποιήσετε τους σκιώδεις κωδικούς;
lt: Ar leisti paslėptų (shadow) slaptažodžių palaikymą?
pl: Czy w³±czyæ ukryte has³a?
pt: Activar as passwords shadow?
ro: Se activează parolele 'umbrite' (shadow) ?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
el: Οι σκιώδεις κωδικοί καθιστούν το σύστημά σας πιο ασφαλές, εφόσον δεν είναι πλέον δυνατή η ανάγνωση ακόμη και των κωδικοποιημένων κωδικών. Οι κωδικοί πρόσβασης αποθηκεύονται σε ξεχωριστό αρχείο που είναι αναγνώσιμο μόνο από ειδικά προγράμματα. Η χρήση των σκιωδών κωδικών πρόσβασης συνιστάται, αν και μπορεί να συναντήσετε προβλήματα αν τους χρησιμοποιήσετε σε συνδυασμό με το σύστημα NIS.
lt: Paslėpti (shadow) slaptažodžiai daro Jūsų sistemą saugesne, kadangi niekas negalės matyti netgi užšifruotų slaptažodžių. Slaptažodžiai saugomi atskirame faile, kurį skaityti gali tik specialios programos. Labai rekomenduojama naudoti paslėptus slaptažodžius, bet jei žadate naudoti NIS, gali kilti problemų.
pl: Ukryte has³a (shadow passwords) sprawiaj±, ¿e system staje siê bezpieczniejszy dziêki temu, ¿e nikt nie ma uprawnieñ do czytania nawet zakodowanych hase³. Has³a s± przechowywane w oddzielnym pliku, który mo¿e byæ czytany tylko przez specjalne programy. Zalecamy u¿ywanie ukrytych hase³. Je¶li masz zamiar u¿ywaæ NIS, móg³by¶/mog³aby¶ napotkaæ k³opoty.
pt: Passwords shadow fazem com que o seu sistema seja mais seguro porque ninguém consegue ver as passwords encriptadas. As passwords são guardadas num ficheiro separado, o qual pode ser lido apenas por programas especiais. O uso de passwords shadow é recomendado. No entanto, caso vá utilizar NIS poderá ter problemas.
ro: Parolole umbrite vă fac sistemul mai sigur deoarece nimeni nu poate vedea nici parolele criptate. Parolele sunt stocate într-un fişier separat care nu poate fi citit decât decât de programe speciale. Utilizarea parolelor umbrite este puternic recomandată. Totuşi dacă veţi folosi NIS veţi ajunge să aveţi probleme.

source: Enable md5 passwords?
el: Θέλετε να χρησιμοποιήσετε κωδικούς τύπου MD5;
lt: Ar įjungti md5 slaptažodžių palaikymą?
pl: Czy w³±czyæ has³a md5?
pt: Activar passwords md5?
ro: Se activează parolele md5?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
el: Οι κωδικοί τύπου MD5 είναι πιο ασφαλείς και επιτρέπουν κωδικούς με μήκος μεγαλύτερο των 8 χαρακτήρων. Παρ' όλ' αυτά, μπορεί να δημιουργήσουν προβλήματα ασυμβατότητας αν χρησιμοποιείτε το σύστημα NIS ή μοιράζεστε αρχεία κωδικών πρόσβασης με παλαιότερα συστήματα.
lt: Md5 slaptažodžiai yra saugesni ir leidžia naudoti ilgesnius negu 8 simbolių slaptažodžius, tačiau gali iškilti suderinamumo problemų, jei naudojate NIS arba naudojate bendrus su senesnėmis sistemomis slaptažodžių failus.
pl: Has³a Md5 s± bezpieczniejsze i pozwalaj± na u¿ywanie hase³ d³u¿szych ni¿ 8 znaków. Mog± jednak sprawiæ problemy ze zgodno¶ci±, je¶li u¿ywasz NIS lub dzielisz has³a z innymi, starszymi systemami.
pt: Passwords md5 são mais seguras e permitem que passwords maiores do que 8 caracteres sejam utilizadas. No entanto, elas podem causar problemas de incompatilidade caso esteja a usar NIS ou a partilhar passwords com sistemas mais antigos.
ro: Parolele md5 sunt mai sigure şi permit utilizarea parolelor mai lungi de 8 caractere. Totuşi, ele pot provoca probleme de compatibilitate dacă folosiţi NIS sau dacă partajaţi fişiere cu sisteme mai vechi.
