Repository: hallyn/shadow-debian
Catalog: debian/po/*.po
Languages: fr, nb, nl, ru

source: Root password:
fr: Mot de passe du superutilisateur (« root ») :
nb: Root-passord:
nl: Beheerderswachtwoord:
ru: Пароль суперпользователя:

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in the dictionary, or a word that could be easily associated with you, like your middle name. A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals. The root password is changed by running the 'passwd' program as root.
fr: Vous devez choisir un mot de passe pour le superutilisateur, le compte d'administration du système. Un utilisateur malintentionné ou peu expérimenté qui aurait accès à ce compte peut provoquer des désastres. En conséquence, ce mot de passe ne doit pas être facile à deviner, ni correspondre à un mot du dictionnaire ou vous être facilement associé. Un bon mot de passe est un mélange de lettres, chiffres et signes de ponctuation. Il devra être changé régulièrement avec le programme « passwd ».
nb: Her må root-passordet bestemmes. Root er sjefskontoen for systemadministrator. En ondsinnet eller ukvalifisert bruker med root-tilgang kan få katastrofale følger. Velg derfor et root-passord som er vanskelig å gjette. Ordet må ikke kunne slås opp i en ordbok, eller lett assosieres med deg som f.eks. et mellomnavn. Et godt passord inneholder en blanding av bokstaver, nummer og skilletegn, og vil byttes ut etter faste perioder. Root-passordet endres ved å kjøre 'passwd'-programmet som root.
ru: Перед продолжением установки необходимо ввести пароль учётной записи суперпользователя root, используемой для администрирования системы. Доступ к компьютеру с использованием этой учётной записи злонамеренных или низкоквалифицированных пользователей может иметь катастрофические последствия. Поэтому пароль суперпользователя не должен легко угадываться, не должен быть словарным слово, и он не должен быть связан с вашей личностью (не следует использовать в качестве пароля суперпользователя своё отчество). Хороший пароль представляет собой смесь букв, цифр и знаков пунктуации, и должен периодически меняться. Для смены пароля суперпользователя следует выполнить от имени суперпользователя команду passwd.

source: Note that you will not be able to see the password as you type it.
fr: Par sécurité, rien n'est affiché pendant la saisie.
nb: Merk at du vil ikke se passordet mens du skriver det.
nl: Opgelet: u ziet het wachtwoord niet terwijl u het ingeeft.
ru: Во время ввода пароля вводимые символы не будут отображаться на экране.

source: Please enter the same root password again to verify that you have typed it correctly.
fr: Veuillez entrer à nouveau le mot de passe du superutilisateur afin de vérifier qu'il a été saisi correctement.
nb: Skriv inn det samme root-passordet på nytt for å kontrollere at du tastet det inn korrekt.
nl: Gelieve het beheerderswachtwoord nogmaals in te geven om te bevestigen dat er geen tikfouten gemaakt zijn.
ru: Введите тот же самый пароль ещё раз, чтобы убедиться в правильности ввода.

source: Create a normal user account now?
fr: Faut-il créer un compte d'utilisateur ordinaire maintenant ?
nb: Skal det opprettes en vanlig brukerkonto?
nl: Wilt u nu een normale gebruikersaccount aanmaken?
ru: Желаете создать обычного пользователя?

source: It's a bad idea to use the root account for normal day-to-day activities, such as the reading of electronic mail, because even a small mistake can result in disaster. You should create a normal user account to use for those day-to-day tasks.
fr: Il est préférable d'éviter de se servir du compte du superutilisateur (« root ») lors de l'utilisation normale du système, par exemple la lecture du courrier. En effet, même une petite erreur pourrait alors avoir des conséquences catastrophiques.
nb: Det kan være særdeles dumt å bruke root-kontoen til daglige gjøremål, slik som f.eks å lese e-post. Den minste feil kan da få katastrofale følger. Du skal heller opprette en vanlig brukerkonto til de daglige gjøremål.
nl: Het is geen goed idee om de 'root'-account te gebruiken voor dagelijkse activiteiten zoals het lezen van e-mail, omdat zelfs kleine vergissingen dan desastreuze gevolgen kunnen hebben. U kunt best een normale gebruikersaccount aanmaken voor dagdagelijkse activiteiten.
ru: Использование учётной записи суперпользователя для выполнения повседневной работы, (чтения электронной почты, например), крайне нежелательно, так как в этом случае малейшая оплошность с Вашей стороны может привести к катастрофе. Сейчас вы можете создать учётную запись обычного пользователя, от имени которого вы будете заниматься повседневной работой в системе.

source: Note that you may create it later (as well as any additional account) by typing 'adduser <username>' as root, where <username> is an user name, like 'imurdock' or 'rms'.
fr: Veuillez noter que vous pourrez le créer plus tard (de même que tout autre compte supplémentaire) en utilisant la commande « adduser <utilisateur> » en tant que « root », où <utilisateur> représente le compte à créer, par exemple « imurdock » ou « rms ».
nb: Du kan også opprette vanlige brukerkonto ved en senere anledning. Nye brukerkontoer kan opprettes ved å taste 'adduser <brukernavn>' som root. <brukernavn> er brukernavnet, f.eks 'imurdock' eller 'rms'.
nl: Merk op dat u deze account (en aanvullende accounts) altijd later kunt aanmaken door het commando 'adduser <gebruikersnaam>' uit te voeren als 'root' (waarbij <gebruikersnaam> de gewenste gebruikersnaam is, bv. 'imurdock' of 'rms')
ru: Вы сможете создать пользовательскую запись (или даже несколько) и позже, выполнив (от имени суперпользователя) команду 'adduser <имя>', где <имя> - имя пользователя (иначе называемое учётной записью), например 'imurdock' или 'rms'.

source: Enter a username for your account:
fr: Identifiant (« login ») pour votre compte utilisateur :
nb: Skriv inn brukernavnet:
ru: Введите имя пользователя:

source: Select a username for the new account. Your first name is a reasonable choice. The username should start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
fr: Veuillez choisir un identifiant pour le nouveau compte. Votre prénom est un choix possible. Les identifiants doivent commencer par une lettre minuscule, suivie d'un nombre quelconque de chiffres ou de lettres minuscules.
nb: Brukernavnet du skrev er ugyldig. Merk at brukernavn må starte med en liten bokstav, deretter kan du bruke en hvilken som helst kombinasjon av tall og små bokstaver.
nl: Wat is de gebruikersnaam voor de nieuwe account? Uw voornaam is een goede keuze. De gebruikersnaam dient te starten met een kleine letter en verder te bestaan uit een combinatie van kleine letters en/of cijfers.
ru: Выберите имя пользователя (учётную запись), под которым вы будете известны в системе. В качестве учётной записи может быть использовано ваше реальное имя. Учётная запись должно начинаться со строчной латинской буквы, за которой может следовать любое количество строчных латинских букв или цифр.

source: Invalid username entered.
fr: Identifiant non valable
nb: Ugyldig brukernavn.
ru: Введено некорректное имя пользователя.

source: The user name you entered is invalid. Note that usernames must start with a lower-case letter, which can be followed by any combination of numbers and more lower-case letters.
fr: L'identifiant que vous avez indiqué n'est pas valable. Les identifiants doivent commencer par une lettre minuscule, suivie d'un nombre quelconque de chiffres ou de lettres minuscules.
nb: Brukernavnet du skrev inn er ugyldig. Merk at brukernavn må starte med en liten bokstav, deretter kan du bruke en hvilken som helst kombinasjon av tall og små bokstaver.
nl: De ingevoerde gebruikersnaam is ongeldig. Gebruikersnamen starten met een kleine letter en bestaan verder uit een combinatie van kleine letters en/of cijfers.
ru: Вы ввели некорректное имя пользователя. Имя пользователя должно начинаться со строчной латинской буквы, за которой может следовать любое количество строчных латинских букв или цифр.

source: Enter a full name for the new user:
fr: Nom complet (ceci n'est PAS l'identifiant ou « login ») :
nb: Skriv inn brukerens hele og fulle navn:
ru: Введите полное имя пользователя:

source: A user account will be created for you to use instead of the root account for non-administrative activities.
fr: Un compte d'utilisateur va être créé afin que vous puissiez disposer d'un compte différent de celui du superutilisateur (« root »), pour l'utilisation courante du système.
nb: En brukerkonto lages framfor at root-kontoen brukes til ikke-administrative aktiviteter.
nl: Er wordt nu een gewone gebruikersaccount aangemaakt zodat u zich enkel als 'root' moet aanmelden voor niet-beheerdersactiviteiten
ru: Будет создана учётная запись пользователя, которая будет использоваться вместо учётной записи суперпользователя (root) для выполнения всех действий, не связанных с администрированием.

source: Enter a password for the new user:
fr: Mot de passe pour le nouvel utilisateur :
nb: Skriv et passord for den nye brukeren:
ru: Введите пароль нового пользователя:

source: A good password will contain a mixture of letters, numbers and punctuation and will be changed at regular intervals.
fr: Un bon mot de passe est composé de lettres, nombres et signes de ponctuation. Il devra en outre être changé régulièrement.
nb: Et bra passord inneholder en blanding av bokstaver, tall og skilletegn, og blir også endret jevnlig.
ru: Хороший пароль представляет из себя смесь букв, цифр и знаков препинания, и должен периодически меняться.

source: Re-enter password to verify:
fr: Confirmation du mot de passe :
nb: Skriv passordet på nytt som en sjekk:
nl: Wachtwoord nogmaals invoeren ter bevestiging:
ru: Введите пароль ещё раз:

source: Please enter the same user password again to verify you have typed it correctly.
fr: Veuillez entrer à nouveau le mot de passe pour l'utilisateur, afin de vérifier que votre saisie est correcte.
nb: Skriv inn det samme bruker-passordet på nytt for å kontrollere at du tastet det inn korrekt.
nl: Gelieve het gebruikerswachwoord nogmaals in te voeren om te bevestigen dat er geen tikfouten gemaakt zijn.
ru: Проверка правильности ввода осуществляется путём повторного ввода пароля и сравнения результатов.

source: Password input error.
fr: Erreur de saisie du mot de passe
nb: Feil med passord-innskriving.
ru: Ошибка ввода пароля.

source: The two passwords you entered were not the same. Please try again.
fr: Les deux mots de passe que vous avez entrés sont différents. Veuillez choisir à nouveau un mot de passe.
nb: De to passordene du oppga var ikke like. Vennligst forsøk igjen.
nl: De twee ingevoerde wachtwoorden komen niet overeen. Gelieve opnieuw te proberen.
ru: Введённые вами пароли не совпадают. Попробуйте ещё раз.

source: Empty password was entered.
fr: Mot de passe vide
nb: Det ble ikke oppgitt noe passord.
ru: Введён пустой пароль.

source: You seem to have entered nothing for the password. That is not secure! Please try again.
fr: Il semble que vous ayez choisi un mot de passe vide. Cela compromet la sécurité du système. Veuillez à nouveau choisir un mot de passe.
nb: Du ser ut til å ha oppgitt et tomt passord. Det er ikke trygt! Forsøk pa nytt.
ru: Вы ввели в качестве пароля пустую строку. Это серьёзная угроза безопасности системы! Пожалуйста, выберите другой пароль.

source: Enable shadow passwords?
fr: Faut-il activer les mots de passe cachés (« shadow passwords ») ?
nb: Skal jeg ta i bruk skyggepassord?
nl: Wilt u shaduwwachtwoorden activeren?
ru: Включить поддержку теневых (shadow) паролей?

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. Passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended. However, if you're going to use NIS you could run into trouble.
fr: Les mots de passe cachés rendent votre système plus sûr car personne n'aura accès aux mots de passe chiffrés. Les mots de passe seront conservés dans un fichier à part et ne pourront être lus que par des programmes spéciaux. L'utilisation des mots de passe cachés est fortement recommandée à moins que vous n'utilisiez NIS.
nb: Skyggepassord gjør systemet mer sikkert. På den måten kan heller ingen se på de krypterte passordene. Passord lagres i en separat fil som bare kan bli lest av helt spesielle program. Det er sterkt anbefalt å bruke skyggepassord. Men brukes NIS får du vanskeligheter.
ru: Использование теневых (shadow) паролей повышает безопасность вашей системы, т.к. при этом блокируется доступ обычных пользователей к зашифрованным паролям. Это достигается путём хранения зашифрованных паролей в отдельном файле, доступ к котором имеют только специальные программы. Рекомендуется использовать теневые пароли. Однако, следует помнить, что при использовании NIS теневые пароли могут вызвать ряд сложностей.

source: Enable md5 passwords?
fr: Faut-il activer les mots de passe MD5 ?
nb: Skal md5-passord tas i bruk?
ru: Включить поддержку паролей md5?

source: Md5 passwords are more secure and allow for passwords longer than 8 characters to be used. However, they can cause compatibility problems if you are using NIS or sharing password files with older systems.
fr: Les mots de passe MD5 sont plus sûrs et permettent d'utiliser des mots de passe de plus de 8 caractères. Cependant cela peut poser des problèmes de compatibilité si vous utilisez NIS ou si vos mots de passe sont partagés avec des systèmes plus anciens.
nb: Md5-passord er mer sikker og tilllater bruk av passord med mer enn 8 tegn. De kan dog forårsaken kompatibilitetsproblemer hvis du bruker NIS, eller deler passord-filer med eldre systemer.
ru: Пароли md5 - более надёжный по сравнению с традиционным метод хранения паролей. Кроме того, при использовании паролей md5 длина пароля может превышать 8 символов. Однако, если вы используете NIS или планируете использовать единый файл паролей в окружении, в котором присутствуют старые системы, у вас могут возникнуть проблемы совместимости.

source: You need to set a password for 'root', the system administrative account. A malicious or unqualified user with root access can have disastrous results, so you should take care to choose a root password that is not easy to guess. It should not be a word found in dictionaries, or a word that could be easily associated with you.
nl: Er moet een wachtwoord ingesteld worden voor de gebruiker 'root' (systeembeheerderaccount). Een kwaadwillende of niet-gekwalificeerde gebruiker met beheerderstoegang kan desastreuze gevolgen hebben. Daarom kiest u dan ook best een beheerderswachtwoord dat moeilijk te raden is, en dat dus niet voorkomt in een woordenboek of makkelijk met u te associëren valt.

source: Full name for the new user:
nl: Volledige naam voor de nieuwe gebruiker:

source: Please enter the real name of this user. This information will be used for instance as default origin for emails sent by this user as well as any program which displays or uses the user's real name. Your full name is a reasonable choice.
nl: Wat is de officiële naam van deze gebruiker? Deze informatie wordt bijvoorbeeld gebruikt als standaard oorsprong voor e-mails die door deze gebruiker verstuurd worden, alsmede door elk programma dat de gebruikers 'echte' naam weergeeft. Uw volledige naam is een redelijke keuze.

source: Username for your account:
nl: Gebruikersnaam voor uw account:

source: Invalid username
nl: Ongeldige gebruikersnaam

source: Password for the new user:
nl: Wachtwoord voor de nieuwe gebruiker:

source: A good password will contain a mixture of letters, numbers and punctuation and should be changed at regular intervals.
nl: Een goed wachtwoord bevat een mengeling van letters, cijfers en leestekens, en kan best op geregelde intervallen veranderd worden.

source: Password input error
nl: Wachtwoordinvoerfout

source: Empty password
nl: Leeg wachtwoord

source: You entered an empty password, which is not allowed. Please choose a non-empty password.
nl: U heeft een leeg wachtwoord ingevoerd, dit is niet toegestaan. Gelieve een niet-leeg wachtwoord te kiezen.

source: Shadow passwords make your system more secure because nobody is able to view even encrypted passwords. The passwords are stored in a separate file that can only be read by special programs. The use of shadow passwords is strongly recommended, except in a few cases such as NIS environments.
nl: Schaduwwachtwoorden maken uw systeem veiliger omdat dan zelfs de versleutelde wachtwoorden door niemand bekeken kunnen worden. Deze worden dan opgeslagen in een apart bestand dat alleen gelezen kan worden door speciale programma's. Gebruik van shaduwwachtwoorden wordt ten sterkste aangeraden, behalve in een paar specifieke gevallen zoals NIS-omgevingen.

source: Set up users and passwords
nl: Gebruikers en wachtwoorden instellen
